<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Wescamp-i18n-commit] r2186 - in	branches/1.4/Invasion_from_the_Unknown:	Invasion_from_the_Unknown/translations/fr/LC_MESSAGES po
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/wescamp-i18n-commit/2008-May/index.html" >
   <LINK REL="made" HREF="mailto:wescamp-i18n-commit%40lists.berlios.de?Subject=Re%3A%20%5BWescamp-i18n-commit%5D%20r2186%20-%20in%0A%09branches/1.4/Invasion_from_the_Unknown%3A%0A%09Invasion_from_the_Unknown/translations/fr/LC_MESSAGES%20po&In-Reply-To=%3C200805010947.m419l9fU013272%40sheep.berlios.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   
   <LINK REL="Next"  HREF="001375.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Wescamp-i18n-commit] r2186 - in	branches/1.4/Invasion_from_the_Unknown:	Invasion_from_the_Unknown/translations/fr/LC_MESSAGES po</H1>
    <B>noyga at BerliOS</B> 
    <A HREF="mailto:wescamp-i18n-commit%40lists.berlios.de?Subject=Re%3A%20%5BWescamp-i18n-commit%5D%20r2186%20-%20in%0A%09branches/1.4/Invasion_from_the_Unknown%3A%0A%09Invasion_from_the_Unknown/translations/fr/LC_MESSAGES%20po&In-Reply-To=%3C200805010947.m419l9fU013272%40sheep.berlios.de%3E"
       TITLE="[Wescamp-i18n-commit] r2186 - in	branches/1.4/Invasion_from_the_Unknown:	Invasion_from_the_Unknown/translations/fr/LC_MESSAGES po">noyga at mail.berlios.de
       </A><BR>
    <I>Thu May  1 11:47:09 CEST 2008</I>
    <P><UL>
        
        <LI>Next message: <A HREF="001375.html">[Wescamp-i18n-commit] r2187 - in	branches/1.4/Extended_Era/Extended_Era: . eras	images/units/chaos races units/aragwaith units/chaos	units/dark_elves units/dwarves units/kalifa units/nagas	units/orcs units/outlaws units/sidhe units/steppe_orcs	units/sylvan_fairies units/trolls units/woses
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#1374">[ date ]</a>
              <a href="thread.html#1374">[ thread ]</a>
              <a href="subject.html#1374">[ subject ]</a>
              <a href="author.html#1374">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Author: noyga
Date: 2008-05-01 11:46:53 +0200 (Thu, 01 May 2008)
New Revision: 2186

Modified:
   branches/1.4/Invasion_from_the_Unknown/Invasion_from_the_Unknown/translations/fr/LC_MESSAGES/wesnoth-Invasion_from_the_Unknown.mo
   branches/1.4/Invasion_from_the_Unknown/po/fr.po
Log:
French translation update


Modified: branches/1.4/Invasion_from_the_Unknown/Invasion_from_the_Unknown/translations/fr/LC_MESSAGES/wesnoth-Invasion_from_the_Unknown.mo
===================================================================
(Binary files differ)

Modified: branches/1.4/Invasion_from_the_Unknown/po/fr.po
===================================================================
--- branches/1.4/Invasion_from_the_Unknown/po/fr.po	2008-04-29 22:17:41 UTC (rev 2185)
+++ branches/1.4/Invasion_from_the_Unknown/po/fr.po	2008-05-01 09:46:53 UTC (rev 2186)
@@ -6,7 +6,7 @@
 &quot;Project-Id-Version: fr_0.6.71\n&quot;
 &quot;Report-Msgid-Bugs-To: <A HREF="http://bugs.wesnoth.org/\n">http://bugs.wesnoth.org/\n</A>&quot;
 &quot;POT-Creation-Date: 2008-04-02 17:33+0200\n&quot;
-&quot;PO-Revision-Date: 2008-04-29 18:29+0100\n&quot;
+&quot;PO-Revision-Date: 2008-04-30 18:36+0100\n&quot;
 &quot;Last-Translator: Damien J &lt;guydelatourATgloireetpouvoirPTcom&gt;\n&quot;
 &quot;Language-Team: Wesnoth &lt;<A HREF="https://lists.berlios.de/mailman/listinfo/wescamp-i18n-commit">fr at li.org</A>&gt;\n&quot;
 &quot;MIME-Version: 1.0\n&quot;
@@ -52,7 +52,6 @@
 
 #. [campaign]
 #: Invasion_from_the_Unknown/_main.cfg:60
-#, fuzzy
 msgid &quot;&quot;
 &quot;Long after the Fall, the last forest elves are forced to abandon their safe &quot;
 &quot;valley, and find themselves resorting to the dark means of necromancy in &quot;
@@ -60,10 +59,11 @@
 &quot;finally free the Great Continent from its chaos, or perish in the foolish &quot;
 &quot;attempt of restoring peace and life to the lands.&quot;
 msgstr &quot;&quot;
-&quot;Longtemps apr&#232;s la Chute, les derniers elfes luttaient pour survivre &#224; &quot;
-&quot;l'ext&#233;rieur quand ils furent contraints d'abandonner leur vall&#233;e tranquille. &quot;
-&quot;Finiront ils par lib&#233;rer le grand continent du chaos ou p&#233;riront ils durant &quot;
-&quot;cette tentative&#160;?&quot;
+&quot;Longtemps apr&#232;s la Chute, les derniers elfes des for&#234;ts furent contraints &quot;
+&quot;d'abandonner leur vall&#233;e tranquille et oblig&#233;s de s'adonner aux arts noirs &quot;
+&quot;de la n&#233;cromancie pour survivre aux p&#233;rils et aux d&#233;fis de ce nouveau monde &quot;
+&quot;cruel. Finiront-ils par lib&#233;rer le Grand Continent du chaos, ou p&#233;riront-ils &quot;
+&quot;durant cette folle tentative pour restaurer la paix et la vie sur terre&#160;?&quot;
 
 #. [campaign]
 #: Invasion_from_the_Unknown/_main.cfg:66
@@ -186,7 +186,7 @@
 #. [about]
 #: Invasion_from_the_Unknown/about.cfg:91
 msgid &quot;Graphics&quot;
-msgstr &quot;Graphiques&quot;
+msgstr &quot;Graphismes&quot;
 
 #. [entry]
 #: Invasion_from_the_Unknown/about.cfg:288
@@ -280,6 +280,8 @@
 &quot; Vegetated terrains are forest (normal, snow or tropical) hexes, great tree &quot;
 &quot;hexes, and mushroom grove hexes (both underground and surface variations).&quot;
 msgstr &quot;&quot;
+&quot; Les terrains v&#233;g&#233;taux sont les for&#234;ts (normales, enneig&#233;es ou tropicales), &quot;
+&quot;les arbres v&#233;n&#233;rables, et les for&#234;ts de champignons.&quot;
 
 #: Invasion_from_the_Unknown/macros/abilities.cfg:30
 msgid &quot;dauntless&quot;
@@ -471,6 +473,9 @@
 &quot;Most enemies respawn two or more turns after you kill them, so try to get &quot;
 &quot;away from their initial locations as quickly as possible.&quot;
 msgstr &quot;&quot;
+&quot;La plupart des ennemis resurgissent deux tours ou plus apr&#232;s leur mort. &quot;
+&quot;Essayez de vous eloigner de leur position initiale aussi rapidement que &quot;
+&quot;possible.&quot;
 
 #. [dummy]
 #: Invasion_from_the_Unknown/macros/glamour.cfg:22
@@ -559,7 +564,7 @@
 #. [then]
 #: Invasion_from_the_Unknown/macros/glamour.cfg:344
 msgid &quot;Surely I have never seen anything like... like this.&quot;
-msgstr &quot;Je n'avais jamais vu quelque chose comme &#231;a... auparavant.&quot;
+msgstr &quot;En v&#233;rit&#233;, je n'avais jamais vu quelque chose comme &#231;a...&quot;
 
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/macros/items.cfg:51
@@ -643,7 +648,7 @@
 msgid &quot;&quot;
 &quot;This bow has been enchanted, and it will grant every arrow you shoot with it &quot;
 &quot;the poison special.&quot;
-msgstr &quot;Ces arc enchant&#233; vous permettra de tirer avec une attaque empoisonn&#233;e.&quot;
+msgstr &quot;Ces arc enchant&#233; vous permettra de d&#233;coher des tirs empoisonn&#233;s.&quot;
 
 #. [object]
 #: Invasion_from_the_Unknown/macros/items.cfg:383
@@ -847,7 +852,7 @@
 #: Invasion_from_the_Unknown/macros/scenario-deaths.cfg:386
 msgid &quot;I have fallen. Hopefully you can finish our journey without me...&quot;
 msgstr &quot;&quot;
-&quot;Je suis tomb&#233;. Heureusement, vous pouvez terminer votre voyage sans moi...&quot;
+&quot;Je suis tomb&#233;. Heureusement, vous pouvez terminer votre p&#233;riple sans moi...&quot;
 
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/macros/scenario-deaths.cfg:399
@@ -1101,11 +1106,11 @@
 
 #: Invasion_from_the_Unknown/macros/special-notes.cfg:29
 msgid &quot; Some of this unit's attacks are not available except on defense.&quot;
-msgstr &quot;&quot;
+msgstr &quot; Cette unit&#233; ne peut utiliser certains de ses coups qu'en d&#233;fense.&quot;
 
 #: Invasion_from_the_Unknown/macros/special-notes.cfg:32
 msgid &quot; Some of this unit's attacks are not available except on offense.&quot;
-msgstr &quot;&quot;
+msgstr &quot; Cette unit&#233; ne peut utiliser certains de ses coups qu'en attaque.&quot;
 
 #: Invasion_from_the_Unknown/macros/special-notes.cfg:35
 msgid &quot;&quot;
@@ -1120,6 +1125,8 @@
 msgid &quot;&quot;
 &quot; This unit cannot move to terrains other than water, castle and villages.&quot;
 msgstr &quot;&quot;
+&quot; Cette unit&#233; ne peut se d&#233;placer que dans l'eau, les ch&#226;teaux et les &quot;
+&quot;villages.&quot;
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:10
@@ -1148,6 +1155,9 @@
 &quot;Also, you should play Episode II only if you have played Episode I at least &quot;
 &quot;once; otherwise, you might get lost trying to understand the plot.&quot;
 msgstr &quot;&quot;
+&quot;De m&#234;me, vous ne devriez jouer l'&#233;pisode II qu'apr&#232;s avoir fait l'&#233;pisode I &quot;
+&quot;au moins une fois&#160;; sinon, vous pourriez &#234;tre perdus en essayant de &quot;
+&quot;comprendre le complot.&quot;
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:36
@@ -1165,7 +1175,6 @@
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:39
-#, fuzzy
 msgid &quot;&quot;
 &quot;Our story starts long after the era known by most people as the Golden Age, &quot;
 &quot;with the adventures of the last forest elves in the Great Continent, hidden &quot;
@@ -1173,9 +1182,12 @@
 &quot;interrupted by minor skirmishes of outsiders. That till certain fateful day, &quot;
 &quot;on which the shadows let themselves fall over this shelter.&quot;
 msgstr &quot;&quot;
-&quot;Tout d'abord, l'introduction. notre histoire d&#233;bute apr&#232;s l'&#233;poque &quot;
-&quot;g&#233;n&#233;ralement connue sous le nom d'&#194;ge d'Or avec les aventures des derniers &quot;
-&quot;elfes forestiers sur le Grand Continent, cach&#233;s dans une vall&#233;e loin &#224; l'est.&quot;
+&quot;Notre histoire d&#233;bute apr&#232;s l'&#233;poque g&#233;n&#233;ralement connue sous le nom d'&#194;ge &quot;
+&quot;d'Or, avec les aventures des derniers elfes des for&#234;ts sur le Grand &quot;
+&quot;Continent, cach&#233;s dans une vall&#233;e loin &#224; l'est et o&#249; leur tranquillit&#233; &quot;
+&quot;n'&#233;tait que parfois interrompue par des petites escarmouches avec des &quot;
+&quot;&#233;trangers. Cela jusqu'au jour tragique o&#249; les ombres s'abattirent sur ce &quot;
+&quot;refuge.&quot;
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:42
@@ -1200,9 +1212,9 @@
 &quot;small surprise to my friends that I have followed in his footsteps and &quot;
 &quot;became a patrol leader myself.&quot;
 msgstr &quot;&quot;
-&quot;Au fil du temps, il est devenu de plus en plus dur de prot&#233;ger notre vall&#233;e. &quot;
-&quot;Les attaques ponctuelles de n&#233;cromanciens et des bandes de fugitifs sont &quot;
-&quot;devenu plus qu'un simple d&#233;sagr&#233;ment. Nous n'avons perdu ni les style &quot;
+&quot;``Au fil du temps, il est devenu de plus en plus dur de prot&#233;ger notre &quot;
+&quot;vall&#233;e. Les attaques ponctuelles de n&#233;cromanciens et des bandes de fugitifs &quot;
+&quot;sont devenu plus qu'un simple d&#233;sagr&#233;ment. Nous n'avons perdu ni les style &quot;
 &quot;d'escrime ni celui de l'archerie issus de nos anc&#234;tres, aussi, en &quot;
 &quot;repr&#233;sailles, nos chefs ont commenc&#233; &#224; envoyer des patrouilles en missions. &quot;
 &quot;Des combattants qui r&#244;dent chaque jour aux fronti&#232;res de la vall&#233;e.Je n'ai &quot;
@@ -1246,7 +1258,6 @@
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:57
-#, fuzzy
 msgid &quot;&quot;
 &quot;Recently however, the attacks of occasional invaders started to increase. &quot;
 &quot;Their attacks slowly building up into an inexplicable frenzy. It was as if &quot;
@@ -1257,13 +1268,13 @@
 &quot;such determined foes.&quot;
 msgstr &quot;&quot;
 &quot;R&#233;cemment cependant, les attaques des envahisseurs occasionnels ont commenc&#233; &quot;
-&quot;&#224; augmenter. Leurs attaques s'accroissaient lentement dans une fr&#233;n&#233;sie &quot;
-&quot;inexplicable. Comme s'ils &#233;taient pouss&#233;s par quelque sinistre force. Ils se &quot;
-&quot;lan&#231;aient sur nos &#233;p&#233;es et nos fl&#232;ches comme si la mort &#233;tait une meilleure &quot;
-&quot;alternative que de tomber en arri&#232;re. Nos patrouilles ont fortement grandi &quot;
-&quot;en taille pour r&#233;sister, devenant plus difficiles &#224; diriger car la plupart &quot;
-&quot;des gens n'avaient tout simplement pas risquer leur vie au combat contre des &quot;
-&quot;adversaires aussi d&#233;cid&#233;s.&quot;
+&quot;&#224; augmenter. Elles s'accroissaient lentement, avec une fr&#233;n&#233;sie &quot;
+&quot;inexplicable, comme si elles &#233;taient motiv&#233;es par quelque sinistre dessein. &quot;
+&quot;Les agresseurs se lan&#231;aient sur nos &#233;p&#233;es et nos fl&#232;ches comme si la mort &quot;
+&quot;&#233;tait une meilleure alternative que de battre en retraite. Pour r&#233;sister, &quot;
+&quot;nos patrouilles ont fortement grandi en taille, tout en devenant plus &quot;
+&quot;difficiles &#224; diriger car la plupart des gens n'avaient tout simplement pas &quot;
+&quot;envie de risquer leur vie contre des adversaires aussi d&#233;cid&#233;s.&quot;
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:60
@@ -1304,11 +1315,11 @@
 &quot;would I have survived? Probably not, but then, would that have helped in any &quot;
 &quot;way to what was to happen next?&quot;
 msgstr &quot;&quot;
-&quot;notre groupe a &#233;t&#233; tr&#232;s affaibli par cette bataille, nous nous sommes donc &quot;
-&quot;retir&#233;s du principal verrou de la vall&#233;e. Une autre patrouille s'est occup&#233; &quot;
-&quot;de notre travail en attendant et &#233;tait programm&#233; pour revenir trois jours &quot;
-&quot;plus tard. Cependant, cela ne suivit pas le bonne voie. Au lieu de cela, &quot;
-&quot;quelque chose d'autre est venu, les cr&#226;nes de nos familles dans leurs &quot;
+&quot;Notre groupe a &#233;t&#233; tr&#232;s affaibli par cette bataille, nous nous sommes donc &quot;
+&quot;retir&#233;s dans le donjon principal de la vall&#233;e. Une autre patrouille s'est &quot;
+&quot;occup&#233; de notre travail en attendant et &#233;tait programm&#233; pour revenir trois &quot;
+&quot;jours plus tard. Cependant, cela ne suivit pas le bonne voie. Au lieu de &quot;
+&quot;cela, quelque chose d'autre est venu, les cr&#226;nes de nos familles dans leurs &quot;
 &quot;banni&#232;res. Ce qui leur &#233;tait arriv&#233; &#233;tait &#233;vident. Je ne suis pas s&#251;r qu'il &quot;
 &quot;me faille remercier ou regretter d'&#234;tre toujours vivant, prot&#233;g&#233; comme je &quot;
 &quot;l'&#233;tais par la for&#234;t et les collines, &#224; l'abri dans le ch&#226;teau. Si j'avais &quot;
@@ -1370,7 +1381,6 @@
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:99
-#, fuzzy
 msgid &quot;&quot;
 &quot;According to Anlind&#235;, he was just a tormented soul. A man who had fought for &quot;
 &quot;a noble cause in an improper way. Anyway, I feel uneasy with undead by our &quot;
@@ -1379,38 +1389,39 @@
 &quot;executed, as the humans do. Now, after traveling with this... man, I wonder &quot;
 &quot;if our actions in the past were just...&quot;
 msgstr &quot;&quot;
-&quot;Selon Analia, il &#233;tait seulement une &#226;me tortur&#233;e. Un homme qui s'&#233;tait &quot;
-&quot;battu pour une cause noble d'une fa&#231;on incorrecte. De toute fa&#231;on, je me &quot;
-&quot;sentais g&#234;n&#233; avec un mort-vivant &#224; notre c&#244;t&#233;. Nous, les elfes, m&#234;me dans &quot;
-&quot;nos plus anciennes histoires, ne nous &#233;tions jamais battues du m&#234;me c&#244;t&#233; que &quot;
-&quot;les n&#233;cromanciens. Nous avions m&#234;me combattu ceux des notres qui avaient &quot;
+&quot;Selon Anlind&#235;, ce n'&#233;tait qu'une &#226;me tortur&#233;e, un homme qui s'&#233;tait battu &quot;
+&quot;pour une noble cause d'une fa&#231;on incorrecte. De toute fa&#231;on, je me sentais &quot;
+&quot;g&#234;n&#233; avec un mort-vivant dans notre camp. Nous, les elfes, m&#234;me dans nos &quot;
+&quot;plus anciennes histoires, ne nous &#233;tions jamais battus du m&#234;me c&#244;t&#233; que les &quot;
+&quot;n&#233;cromanciens. Nous avions m&#234;me combattu ceux qui, parmi nous, avaient &quot;
 &quot;appris les arts sombres, tout comme les humains le font. Maintenant, apr&#232;s &quot;
-&quot;avoir voyag&#233; avec cet homme ..., je me demande si nos actions pass&#233;es &quot;
+&quot;avoir voyag&#233; avec cet... homme... je me demande si nos actions pass&#233;es &quot;
 &quot;&#233;taient justes...&quot;
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:102
-#, fuzzy
 msgid &quot;&quot;
 &quot;Regardless, it seems that this one is not completely evil. He could be a &quot;
 &quot;great help for our cause if he is being honest with us. My people sometimes &quot;
 &quot;say that closest friends may turn into your worst enemies. I have no great &quot;
 &quot;friends, except Anlind&#235;, so I hope that is not true.&quot;
 msgstr &quot;&quot;
-&quot;Il semblait tout de m&#234;me que celui-ci n'&#233;tait pas tout &#224; fait mauvais. Il &quot;
-&quot;pourrait &#234;tre d'une grande aide pour notre cause s'il &#233;tait honn&#234;te avec &quot;
-&quot;nous. Mon peuple dit parfois que les amis les plus proches peuvent se &quot;
-&quot;transformer en vos ennemis les plus implacables. Je n'ai aucun vrai ami, &quot;
-&quot;sauf Analia, j'esp&#232;re donc que ceci n'est pas vrai.&quot;
+&quot;D'ailleurs, celui-ci ne semblait pas tout &#224; fait mauvais. Il pourrait &#234;tre &quot;
+&quot;d'un grand secours s'il se montrait honn&#234;te avec nous. Mon peuple dit &quot;
+&quot;parfois que les amis les plus proches peuvent se transformer en vos ennemis &quot;
+&quot;les plus implacables. Je n'ai aucun vrai ami, sauf Anlind&#235;, j'esp&#232;re donc &quot;
+&quot;que ceci n'est pas vrai.&quot;
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:113
-#, fuzzy
 msgid &quot;&quot;
 &quot;We followed the carved canyon along the southern side. As we traveled we &quot;
 &quot;could see small tributaries coming from the far North feeding into the &quot;
 &quot;river, increasing the speed and depth of the water as we passed.&quot;
-msgstr &quot;Nous avons suivi le canyon ravin&#233; sur son flanc sud.&quot;
+msgstr &quot;&quot;
+&quot;Nous avons suivi le canyon ravin&#233; du c&#244;t&#233; sud. Durant le voyage, nous avons &quot;
+&quot;vu de petits affluents venant du nord lointain grossir le fleuve, augmentant &quot;
+&quot;sa vitesse et la profondeur de l'eau au fur et &#224; mesure.&quot;
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:117
@@ -1543,20 +1554,18 @@
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:179
-#, fuzzy
 msgid &quot;&quot;
 &quot;Only me, Anlind&#235; and the Lich were going to enter the caves, but some of our &quot;
 &quot;people were not willing to stay outside in the safety just sitting for a &quot;
 &quot;day, and instead accompanied us down to the darkness.&quot;
 msgstr &quot;&quot;
-&quot;Seulement Analia, la liche et moi-m&#234;me devions entrer dans les cavernes, &quot;
-&quot;mais quelques uns de nos camarades ne voulurent pas rester en s&#233;curit&#233; &quot;
-&quot;dehors juste pour attendre une journ&#233;e, aussi insist&#232;rent ils pour nous &quot;
-&quot;accompagner dans les t&#233;n&#232;bres.&quot;
+&quot;Seulement Anlind&#235;, la liche et moi-m&#234;me devions entrer dans les cavernes. &quot;
+&quot;Mais quelques-uns de nos camarades qui ne voulaient pas rester en s&#233;curit&#233; &quot;
+&quot;dehors, &#224; attendre toute la journ&#233;e, insist&#232;rent pour nous accompagner dans &quot;
+&quot;les t&#233;n&#232;bres.&quot;
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:182
-#, fuzzy
 msgid &quot;&quot;
 &quot;The cave walls looked strange and artificial, while the floor was covered by &quot;
 &quot;strange tiles, probably manufactured by an ancient civilization that used to &quot;
@@ -1565,12 +1574,12 @@
 &quot;have no experience with magic arts, so I could not tell what exactly they &quot;
 &quot;felt or detected.&quot;
 msgstr &quot;&quot;
-&quot;Les murs de la caverne semblaient &#233;trange et artificiels, autant que le &quot;
-&quot;plancher, couvert de carreaux &#233;tranges, probablement fabriqu&#233;s par une &quot;
-&quot;antique civilisation qui vivait l&#224; auparavant... s'ils n'y vivaient pas &quot;
-&quot;encore. Quoi qu'il en soit, je remarquais qu'Analia et Mal Keshar avaient un &quot;
-&quot;mauvais pressentiment. Je n'ai aucune exp&#233;rience dans les arts magiques &quot;
-&quot;aussi ne puis je dire ce qu'ils avaient exactement senti ou d&#233;tect&#233;.&quot;
+&quot;Les murs de la caverne semblaient &#233;trange et artificiels, le plancher &#233;tait &quot;
+&quot;couvert de carreaux &#233;tranges probablement fabriqu&#233;s par une antique &quot;
+&quot;civilisation qui vivait l&#224; auparavant... s'elle n'y vivait pas encore. Quoi &quot;
+&quot;qu'il en soit, je remarquais qu'Analia et Mal Keshar avaient un mauvais &quot;
+&quot;pressentiment. Je n'ai aucune exp&#233;rience des arts magiques, aussi je ne puis &quot;
+&quot;pr&#233;ciser ce qu'ils avaient exactement senti ou d&#233;tect&#233;.&quot;
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:192
@@ -1885,6 +1894,8 @@
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:347
 msgid &quot;At last, we could see an ominous castle dominating the view.&quot;
 msgstr &quot;&quot;
+&quot;Enfin, nous avons pu apercevoir une citadelle sinistre qui dominait les &quot;
+&quot;alentours.&quot;
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:357
@@ -1901,6 +1912,8 @@
 &quot;When dawn broke, we immediately prepared for our journey in orcish &quot;
 &quot;territory. Leaving our men behind, we headed towards the wildlands...&quot;
 msgstr &quot;&quot;
+&quot;Nous pr&#233;par&#226;mes notre exp&#233;dition en territoire orc d&#232;s l'aurore. Nous nous &quot;
+&quot;dirige&#226;mes vers les terres sauvages, laissant nos hommes en arri&#232;re...&quot;
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:370
@@ -1989,6 +2002,9 @@
 &quot;I was assigned the first watch turn. After completing my duty, sleepiness &quot;
 &quot;sent me immediately to my tent, to fall asleep as soon as I touched floor.&quot;
 msgstr &quot;&quot;
+&quot;Je fus le premier d&#233;sign&#233; pour le tour de garde. Apr&#232;s en avoir termin&#233; avec &quot;
+&quot;mon devoir, la fatigue me fit tout de suite regagner ma tente pour &quot;
+&quot;m'endormir aussit&#244;t que je touchai le sol.&quot;
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:422
@@ -2237,6 +2253,9 @@
 &quot;was desperately in need of help, and they would be close to it, willing to &quot;
 &quot;help as anonymous heroes.&quot;
 msgstr &quot;&quot;
+&quot;Galas, Elynia et Mal Keshar ne furent jamais r&#233;apper&#231;us, sauf si une ville &quot;
+&quot;avait d&#233;sesp&#233;rement besoin d'aide. S'ils &#233;taient proches, ils venaient les &quot;
+&quot;secourir comme des h&#233;ros anonymes.&quot;
 
 #. [part]
 #: Invasion_from_the_Unknown/macros/storytxt.cfg:547
@@ -3161,6 +3180,8 @@
 &quot;I have fallen this day. But, young Galas, you are still a capable warrior. &quot;
 &quot;Please lead our people in my place!&quot;
 msgstr &quot;&quot;
+&quot;Je tombe en ce jour. Mais, jeune Galas, tu es toujours un guerrier de &quot;
+&quot;valeur. Dirige notre peuple &#224; ma place, s'il te pla&#238;t !&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/02_A_Real_Confrontation.cfg:442
@@ -3185,13 +3206,12 @@
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/02_A_Real_Confrontation.cfg:519
-#, fuzzy
 msgid &quot;&quot;
 &quot;We could not protect enough of our civilians. They have been burned alive &quot;
 &quot;with their villages!&quot;
 msgstr &quot;&quot;
-&quot;Nous ne pourrons pas maintenir assez de civils en vie avant d'entrer dans &quot;
-&quot;ces cavernes&#160;!&quot;
+&quot;Nous n'avons pas pu prot&#233;ger assez de civils. Ils ont br&#251;l&#233; vifs dans leurs &quot;
+&quot;demeures&#160;!&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/02_A_Real_Confrontation.cfg:520
@@ -3240,13 +3260,13 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:198
-#, fuzzy
 msgid &quot;&quot;
 &quot;We lost our home... many children and elders... and our lord, at the hands &quot;
 &quot;of those fiends... what will we do now? Where will we go?&quot;
 msgstr &quot;&quot;
-&quot;Nous avons perdu nos maison... dans les pattes de ces d&#233;mons... qu'allons &quot;
-&quot;nous faire maintenant&#160;? O&#249; irons nous&#160;?&quot;
+&quot;Nous avons perdu nos maisons... beaucoup d'enfants et de vieillard... et nos &quot;
+&quot;chefs, dans les pattes de ces d&#233;mons... qu'allons-nous faire maintenant&#160;? O&#249; &quot;
+&quot;irons-nous&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:199
@@ -3261,30 +3281,27 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:200
-#, fuzzy
 msgid &quot;&quot;
 &quot;I profoundly hope so. We must continue down these caves, then. But Anlind&#235;, &quot;
 &quot;you mentioned something about an evil force just before deciding to flee, &quot;
 &quot;what did you mean?&quot;
 msgstr &quot;&quot;
-&quot;Tr&#232;s sinc&#232;rement j'esp&#232;re. Je me doute qu'il nous faut poursuivre dans ces &quot;
-&quot;cavernes maintenant. Mais, Analia, tu as dit quelque chose &#224; propos d'une &quot;
-&quot;force d&#233;moniaque avant de d&#233;cider de fuir, qu'entendiez vous par l&#224;&#160;?&quot;
+&quot;Tr&#232;s sinc&#232;rement, j'esp&#232;re. Nous devons continuer dans ces cavernes, &quot;
+&quot;maintenant. Mais, Anlind&#235;, vous aviez mentionn&#233; une force d&#233;moniaque juste &quot;
+&quot;avant de d&#233;cider de fuir, qu'entendiez-vous par l&#224;&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:201
-#, fuzzy
 msgid &quot;&quot;
 &quot;I meant that these humans had some powerful and evil force supporting them. &quot;
 &quot;Not merely ordinary necromancers and war-beasts, but something worse. &quot;
 &quot;Something I believed we had already vanquished... but now I realize we had &quot;
 &quot;not not, at least not completely...&quot;
 msgstr &quot;&quot;
-&quot;Il me semble que ces humains ont de puissantes forces d&#233;moniaque qui les &quot;
-&quot;assistent; non pas les rares n&#233;cromanciens mal&#233;fiques et leurs brutes de &quot;
-&quot;morts-vivants, mais quelque chose de pire, quelque chose que nous somme &quot;
-&quot;suppos&#233;s avoir d&#233;j&#224; vaincu... Maintenant je r&#233;alise que ce n'&#233;tait pas cela, &quot;
-&quot;enfin, pas tout &#224; fait...&quot;
+&quot;On dirait que de puissantes forces d&#233;moniaques assistent ces humains. Il ne &quot;
+&quot;s'agit pas de n&#233;cromanciens ordinaires ou d'animaux de guerre, mais de &quot;
+&quot;quelque chose de pire, que nous pensions avoir d&#233;j&#224; vaincu... Maintenant, je &quot;
+&quot;r&#233;alise que ce n'&#233;tait pas vrai, enfin pas tout &#224; fait...&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:202
@@ -3311,23 +3328,21 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:208
-#, fuzzy
 msgid &quot;&quot;
 &quot;I suppose so... Let us find an exit. If we but can...this cave system has &quot;
 &quot;never been explored before.&quot;
 msgstr &quot;&quot;
-&quot;Je suppose &#233;galement... Trouvons donc une sortie, mais ces cavernes n'ont &quot;
-&quot;jamais &#233;t&#233; explor&#233;es auparavant.&quot;
+&quot;Je suppose... Trouvons une sortie. Si nous pouvons.... ce reseau de galeries &quot;
+&quot;n'a jamais &#233;t&#233; explor&#233; auparavant.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:209
-#, fuzzy
 msgid &quot;&quot;
 &quot;Would that we had more experience at moving in this darkness. This will be a &quot;
 &quot;long exploration.&quot;
 msgstr &quot;&quot;
-&quot;J'esp&#233;rais que nous aurions plus d'exp&#233;rience du d&#233;placement dans &quot;
-&quot;l'obscurit&#233;. Ce sera une longue exploration.&quot;
+&quot;J'esp&#233;rais que nous saurions mieux nous d&#233;placer dans cette obscurit&#233;. Ce &quot;
+&quot;sera une longue exploration.&quot;
 
 #. [message]: speaker=second_unit
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:223
@@ -3400,13 +3415,12 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:259
-#, fuzzy
 msgid &quot;&quot;
 &quot;We cannot go back, there is no escape way except this one. We must defeat &quot;
 &quot;him before he destroys us!&quot;
 msgstr &quot;&quot;
-&quot;Nous ne pouvons repartir en arri&#232;re, ils n'y a pas d'&#233;chappatoire except&#233; &quot;
-&quot;celle ci. Nous devons le tuer avant qu'il ne nous tue.&quot;
+&quot;Nous ne pouvons pas retourner en arri&#232;re, il n'y a pas d'autre &#233;chappatoire &quot;
+&quot;que celui-ci. Nous devons le vaincre avant qu'il ne nous d&#233;truise&#160;!&quot;
 
 #. [objectives]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:264
@@ -3424,28 +3438,26 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:351
-#, fuzzy
 msgid &quot;&quot;
 &quot;So it is you, Mal Keshar, formerly known as Malin Keshar. The one who fell &quot;
 &quot;to the darkness for a noble cause fought in a tainted way. But then, you are &quot;
 &quot;the living proof that everything left from the Golden Age has died and dried &quot;
 &quot;up.&quot;
 msgstr &quot;&quot;
-&quot;Ainsi c'est vous, Mal Keshar, plus connu sous le nom de Malin Keshar. Celui &quot;
-&quot;qui est tomb&#233; dans l'obscurit&#233; pour une noble cause fourvoy&#233; dans un mauvais &quot;
-&quot;chemin. Mais l&#224;, vous &#234;tes la preuve vivante que quelque chose de l'&#194;ge d'Or &quot;
-&quot;est mort et dess&#233;ch&#233;.&quot;
+&quot;Ainsi c'est vous, Mal Keshar, anciennement appel&#233; Malin Keshar. Celui qui a &quot;
+&quot;sombr&#233; dans les t&#233;n&#232;bres se trompant de voie pour accomplir pour une noble &quot;
+&quot;cause. Vous &#234;tes la preuve vivante que tout ce qui reste de l'&#194;ge d'Or est &quot;
+&quot;mort et dess&#233;ch&#233;.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:352
-#, fuzzy
 msgid &quot;&quot;
 &quot;Ignorant elf! I am no mere shambling revenant, but a lich of power. I still &quot;
 &quot;think, feel, and I am aware of the current situation of Wesnoth.&quot;
 msgstr &quot;&quot;
-&quot;Stupide femme&#160;! Je suis une liche mais j'ai toujours ma propre volont&#233; &quot;
-&quot;contrairement &#224; mes favoris qui ne l'ont plus. Je peux penser, ressentir et &quot;
-&quot;je suis au courant de la situation actuelle de Wesnoth.&quot;
+&quot;Elfe ignorant&#160;! Je suis une liche tr&#232;s puissante, pas un revenant &#233;cervel&#233;. &quot;
+&quot;Je peux toujours r&#233;fl&#233;chir, &#233;prouver des sentiments, et je suis au courant &quot;
+&quot;de la situation actuelle de Wesnoth.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:353
@@ -3454,13 +3466,12 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:354
-#, fuzzy
 msgid &quot;&quot;
 &quot;Long ago, it was the name of the land south of the Swamps of Dread, and west &quot;
 &quot;from the Silver Lands.&quot;
 msgstr &quot;&quot;
-&quot;Le nom utilis&#233; pour d&#233;signer ce que nous appelons Les Terres au sud des &quot;
-&quot;Marais de Terreur, &#224; l'ouest de la Lande d'Argent.&quot;
+&quot;Il y a longtemps, c'&#233;tait le nom utilis&#233; de la contr&#233;e au sud du Marais de &quot;
+&quot;la Terreur, &#224; l'ouest de la Lande d'Argent.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:355
@@ -3470,7 +3481,7 @@
 &quot;forces of Evil.&quot;
 msgstr &quot;&quot;
 &quot;Exact, et je parie que ma soif d'orcs morts ne sera jamais &#233;tanch&#233;e. Car je &quot;
-&quot;ne peux aller &#224; la surface maintenant puisque la terre est sous le contr&#244;le &quot;
+&quot;ne peux aller &#224; la surface maintenant, puisque la terre est sous le contr&#244;le &quot;
 &quot;des forces du mal.&quot;
 
 #. [event]
@@ -3485,7 +3496,7 @@
 #: Invasion_from_the_Unknown/scenarios/16_Arrival_of_the_Battalion.cfg:218
 #: Invasion_from_the_Unknown/scenarios/cutscenes/23Bx.cfg:120
 msgid &quot;What?&quot;
-msgstr &quot;Quoi donc&#160;?&quot;
+msgstr &quot;Comment&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:357
@@ -3505,7 +3516,6 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:358
-#, fuzzy
 msgid &quot;&quot;
 &quot;Some centuries ago, a malign shadow issuing from the vast Ocean covered the &quot;
 &quot;lands, and an evil presence began to swallow every living creature. After &quot;
@@ -3514,13 +3524,12 @@
 &quot;monsters were called, in my time, demons. I suppose you remember them, do &quot;
 &quot;you?&quot;
 msgstr &quot;&quot;
-&quot;Il y a plusieurs si&#232;cles, une ombre mal&#233;fique est venue du Grand Oc&#233;an et a &quot;
+&quot;Il y a plusieurs si&#232;cles, une ombre maligne est venue du Grand Oc&#233;an et a &quot;
 &quot;recouvert les terres, puis une entit&#233; mal&#233;fique a commenc&#233; &#224; engloutir tout &quot;
-&quot;ce qui vivait. Je ne savais pas ce que c'&#233;tait, au d&#233;but, mais apr&#232;s &quot;
-&quot;quelques temps, les cr&#233;atures monstrueuses des basses fosses commenc&#232;rent &quot;
-&quot;leurs razzias et d&#233;truisirent tous les campements que les humains, les elfes &quot;
-&quot;et les orcs avaient laiss&#233;s dans le d&#233;sert. De mon temps on les appelait &quot;
-&quot;D&#233;mons. Je suppose que vous vous en souvenez, n'est-ce pas&#160;?&quot;
+&quot;ce qui vivait. Apr&#232;s quelques temps, des horreurs du monde d'en-dessous ont &quot;
+&quot;commenc&#233; des razzias d&#233;truisant tous les campements humains, elfes, ou orcs &quot;
+&quot;du d&#233;sert. De mon temps, on les appelait ces monstres des d&#233;mons. Je suppose &quot;
+&quot;que vous vous en souvenez, n'est-ce pas&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:359
@@ -3548,12 +3557,12 @@
 &quot;starting with the new landscape and the two burning suns.&quot;
 msgstr &quot;&quot;
 &quot;Ce n'&#233;tait rien, seulement le d&#233;but de notre calvaire. Je suppose que &quot;
-&quot;quelque chose ou quelqu'un a ouvert un portail vers le coeur m&#234;me des &quot;
-&quot;enfers, d&#233;cha&#238;nant les forces du mal, leur permettant de passer la barri&#232;re &quot;
-&quot;et d'entrer dans le monde. Les seuls que je puisse bl&#226;mer, pour leurs &quot;
-&quot;horribles exp&#233;riences, sont les mages wesnothiens. Leur arrogance seule a &quot;
-&quot;permis qu'eux, et par l&#224; m&#234;me nous, soyons plong&#233;s dans ce futur chaos &quot;
-&quot;annonc&#233; par un nouvel horizon, les deux soleils br&#251;lants.&quot;
+&quot;quelque chose ou quelqu'un a ouvert un portail vers le c&#339;ur m&#234;me des enfers, &quot;
+&quot;d&#233;cha&#238;nant les forces du mal, leur permettant de passer la barri&#232;re et &quot;
+&quot;d'entrer dans le monde. Les seuls que je puisse bl&#226;mer, pour leurs horribles &quot;
+&quot;exp&#233;riences, sont les mages wesnothiens. Leur arrogance seule a permis &quot;
+&quot;qu'eux, et par l&#224; m&#234;me nous, soyons plong&#233;s dans ce futur chaos annonc&#233; par &quot;
+&quot;un nouvel horizon, les deux soleils br&#251;lants.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:362
@@ -3672,7 +3681,7 @@
 &quot;possibly necessary to defeat whoever is the master mind of this cruel plot.&quot;
 msgstr &quot;&quot;
 &quot;Actuellement ils vont vers un endroit, un lieu enfonc&#233; tr&#232;s profond&#233;ment &quot;
-&quot;dans le coeur du monde. Je sens leurs pr&#233;sences descendant dans les &quot;
+&quot;dans le c&#339;ur du monde. Je sens leurs pr&#233;sences descendant dans les &quot;
 &quot;profondeurs. En tout cas, l'un d'eux, le Ma&#238;tre des T&#233;n&#232;bres a r&#233;ellement &quot;
 &quot;disparu de ce monde, j'ai perdu sa trace. La Madone de Lumi&#232;re semble &#234;tre &quot;
 &quot;toujours ici, ici m&#234;me, endormie. Si vous pouviez la r&#233;veiller vous &quot;
@@ -3745,20 +3754,19 @@
 &quot;Keep your mouth shut. This is the decision of a high sorceress, we must &quot;
 &quot;respect it.&quot;
 msgstr &quot;&quot;
-&quot;Tiens ta bouche close. Quelque soit la d&#233;cision de la Haute Sorci&#232;re, nous &quot;
-&quot;devons la respecter.&quot;
+&quot;Tais-toi. Quelque soit la d&#233;cision de la Haute Sorci&#232;re, nous devons la &quot;
+&quot;respecter.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:394
-#, fuzzy
 msgid &quot;&quot;
 &quot;Thanks for your kindness. You are the first beings with which I have spoken &quot;
 &quot;words without blood since I arrived here. I place myself and my powers to &quot;
 &quot;your service, elves.&quot;
 msgstr &quot;&quot;
-&quot;Merci pour votre amabilit&#233;. Vous &#234;tes la premi&#232;re personne avec laquelle &quot;
-&quot;j'ai eu un dialogue amical depuis mon arriv&#233;e ici. Je me place d&#233;sormais, &quot;
-&quot;moi et ma puissance, &#224; votre service, elfes.&quot;
+&quot;Merci pour votre amabilit&#233;. Vous &#234;tes les premi&#232;rs avec lesquels je dialogue &quot;
+&quot;amicalement depuis mon arriv&#233;e ici. Ma puissance et moi-m&#234;me sommes &#224; votre &quot;
+&quot;service, elfes.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/03_Horrors_from_the_Depths.cfg:399
@@ -3781,10 +3789,10 @@
 &quot;those damned creatures. I'd rather avoid it while we gather the necessary &quot;
 &quot;power to fight against them.&quot;
 msgstr &quot;&quot;
-&quot;Nous devons faire face &#224; l'ouest. Au nord-est de l'ancien territoire des &quot;
-&quot;elfes de Wesmere sont les montagnes o&#249; vos sauveurs sont all&#233;s, les cavernes &quot;
-&quot;de Knalga, un royaume antique, d&#233;chu. Bien qu'aller &#224; l'endroit o&#249; la for&#234;t &quot;
-&quot;de Wesmere se trouvait devrait nous mener l&#224; bas plus rapidement, c'est &quot;
+&quot;Nous devons aller &#224; l'ouest. Au nord-est de l'ancien territoire des elfes de &quot;
+&quot;Wesmere sont les montagnes o&#249; vos sauveurs sont all&#233;s, les cavernes de &quot;
+&quot;Knalga, un royaume antique, d&#233;chu. Bien qu'aller &#224; l'endroit o&#249; la for&#234;t de &quot;
+&quot;Wesmere se trouvait devrait nous mener l&#224; bas plus rapidement, c'est &quot;
 &quot;actuellement infest&#233; par ces damn&#233;es cr&#233;atures, donc Je pr&#233;f&#233;rerais l'&#233;viter &quot;
 &quot;tant que nous chercherons la puissance n&#233;cessaire pour se battre contre eux.&quot;
 
@@ -4062,6 +4070,8 @@
 &quot;Indeed. Let's go. The faster we find a new oasis, the better. We cannot just &quot;
 &quot;stay here for the rest of our lives.&quot;
 msgstr &quot;&quot;
+&quot;Tout &#224; fait. Allons-y. Plus vite nous trouverons une oasis, mieux ce sera. &quot;
+&quot;Nous ne pouvons pas nous &#233;terniser ici.&quot;
 
 #. [event]: (type=Ghost)}
 #: Invasion_from_the_Unknown/scenarios/04_Over_the_Sands.cfg:500
@@ -4079,6 +4089,8 @@
 &quot;No. These ghosts have free will, and roam about these sands due to their &quot;
 &quot;sudden death.&quot;
 msgstr &quot;&quot;
+&quot;Non. Ces fant&#244;mes ont une volont&#233; propre et hantent les sables &#224; cause de &quot;
+&quot;leur mort brutale.&quot;
 
 #. [event]: (type=Ghost)}
 #: Invasion_from_the_Unknown/scenarios/04_Over_the_Sands.cfg:503
@@ -4092,11 +4104,14 @@
 &quot;of the Empire of Wesnoth after the cataclysm when the third sun, Gaia, fell &quot;
 &quot;over the land.&quot;
 msgstr &quot;&quot;
+&quot;&#201;cras&#233;s vivant par leur propres maisons, par des roches, par des &quot;
+&quot;montagnes... C'est ce qui reste de l'Empire de Wesnoth apr&#232;s le cataclysme, &quot;
+&quot;quand le troisi&#232;me soleil, Gaia, est tomb&#233; sur terre.&quot;
 
 #. [event]: (type=Ghost)}
 #: Invasion_from_the_Unknown/scenarios/04_Over_the_Sands.cfg:505
 msgid &quot;A third sun? How could that happen...&quot;
-msgstr &quot;Un troisi&#232;me soleil&#160;? Comment cela peut-il arriver...&quot;
+msgstr &quot;Un troisi&#232;me soleil&#160;? Comment cela a-t-il pu arriver...&quot;
 
 #. [event]: (type=Ghost)}
 #: Invasion_from_the_Unknown/scenarios/04_Over_the_Sands.cfg:506
@@ -4104,6 +4119,8 @@
 &quot;(sighs) Galas, again, it is something that you should not, nor would ever &quot;
 &quot;need to know.&quot;
 msgstr &quot;&quot;
+&quot;(soupirs) Galas, encore une fois, c'est quelque chose que vous ne devriez &quot;
+&quot;jamais savoir.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/04_Over_the_Sands.cfg:513
@@ -4168,6 +4185,9 @@
 &quot;those that you see close to you, strange things happen and can be seen at &quot;
 &quot;night.&quot;
 msgstr &quot;&quot;
+&quot;Je vous recommande de ne pas aller au sud-ouest. Les loyalistes y occupent &quot;
+&quot;de grandes zones, et on dit que dans les montagnes qui les bordent, que vous &quot;
+&quot;voyez l&#224;-bas, des choses &#233;tranges se passent et peuvent &#234;tre vues de nuit.&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/04_Over_the_Sands.cfg:548
@@ -4175,6 +4195,8 @@
 &quot;Thanks for the tip. But, why don't you abandon this oasis then? There are &quot;
 &quot;others further to the north and east.&quot;
 msgstr &quot;&quot;
+&quot;Merci pour le conseil. Mais pourquoi n'abandonnez-vous pas l'oasis, alors ? &quot;
+&quot;Il y en a d'autre, plus au nord et &#224; l'est.&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/04_Over_the_Sands.cfg:549
@@ -4183,6 +4205,10 @@
 &quot;the forces to fight them yet, so we prefer to struggle for surviving in this &quot;
 &quot;small valley where we know exactly what threathens our lives.&quot;
 msgstr &quot;&quot;
+&quot;Parce que la plupart sont contr&#244;l&#233;es par des orcs ou des sauvages hostiles. &quot;
+&quot;Nous n'avons pas la puissance pour les combattre, alors nous pr&#233;f&#233;rons &quot;
+&quot;survivre dans cette petite vall&#233;e o&#249; nous savons parfaitement ce qui nous &quot;
+&quot;menace.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/04_Over_the_Sands.cfg:568
@@ -4561,7 +4587,6 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/04_Over_the_Sands.cfg:1244
-#, fuzzy
 msgid &quot;&quot;
 &quot;This, my 'friend', is a he, one of your kinsmen. In contrast with most of my &quot;
 &quot;minions, this elvish spirit does not fight unwillingly; he has been &quot;
@@ -4569,11 +4594,11 @@
 &quot;by himself, he has been waiting for the oportunity to fight for you once &quot;
 &quot;again; he just needed a little help from an expert like me.&quot;
 msgstr &quot;&quot;
-&quot;Ceci, mon ami, est appel&#233; $unit.unit_description et est un de vos parents. &quot;
-&quot;Contrairement &#224; la plupart de mes favoris, cet esprit elfe ne se bat pas &#224; &quot;
-&quot;contrecoeur; il vous a suivi tout le temps et n'ayant pas le pouvoir de se &quot;
-&quot;mat&#233;rialiser tout seul, il a attendu l'opportunit&#233; de se battre pour vous &quot;
-&quot;une nouvelle fois; il a juste eu besoin de l'aide d'un expert comme moi. &quot;
+&quot;Ceci, mon &#171;&#160;ami&#160;&#187;, est l'un de vos parents. Contrairement &#224; la plupart de &quot;
+&quot;mes mignons, cet esprit elfe ne se bat pas &#224; contrec&#339;ur&#160;; il vous a suivi &quot;
+&quot;tout le temps et, n'ayant pas le pouvoir de se mat&#233;rialiser tout seul, il a &quot;
+&quot;attendu l'opportunit&#233; de se battre pour vous une nouvelle fois&#160;; il a juste &quot;
+&quot;eu besoin de l'aide d'un expert comme moi.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/04_Over_the_Sands.cfg:1245
@@ -4611,6 +4636,9 @@
 &quot;weapon against most living units, keep in mind that he is weak against &quot;
 &quot;impact, arcane and fire attacks.&quot;
 msgstr &quot;&quot;
+&quot;Mal Keshar est une ancienne liche. M&#234;me si des armes conventionnelles ne &quot;
+&quot;peuvent quasiment pas l'arr&#234;ter, rappelez-vous qu'elle est sensible aux &quot;
+&quot;attaques sacr&#233;es et enflamm&#233;es.&quot;
 
 #. [message]: speaker=Mal Keshar
 #: Invasion_from_the_Unknown/scenarios/04_Over_the_Sands.cfg:1292
@@ -4659,6 +4687,8 @@
 &quot;The darkness of it probably grants shelter to many foes. I'd prefer to avoid &quot;
 &quot;it if possible.&quot;
 msgstr &quot;&quot;
+&quot;L'obscurit&#233; dissimule probablement beaucoup d'ennemis. Je pr&#233;f&#233;rerais &#233;viter &quot;
+&quot;cela si possible.&quot;
 
 #. [message]: speaker=Mal Keshar
 #: Invasion_from_the_Unknown/scenarios/04_Over_the_Sands.cfg:1354
@@ -4813,14 +4843,13 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:199
-#, fuzzy
 msgid &quot;&quot;
 &quot;It's your fault for leaving them alone for going hunting. Now they are quite &quot;
 &quot;voiceless, but well, you are next if you don't get away now.&quot;
 msgstr &quot;&quot;
-&quot;C'est de votre faute, vous les avez laiss&#233;s seuls pour aller chasser. &quot;
-&quot;Maintenant ils sont sans voix, mais vous serez le prochain si vous ne &quot;
-&quot;d&#233;guerpissez pas tout de suite.&quot;
+&quot;C'est de votre faute, vous les avez laiss&#233;s seuls pour aller chasser. Ils &quot;
+&quot;sont muets &#224; pr&#233;sent, mais vous serez le prochain si vous ne d&#233;guerpissez &quot;
+&quot;pas tout de suite.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:200
@@ -4905,14 +4934,14 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:212
-#, fuzzy
 msgid &quot;&quot;
 &quot;I just hope those fiends are easier to defeat than what they proved to be in &quot;
 &quot;our valley. We are in worse conditions now, and recruiting new fighters will &quot;
 &quot;be very difficult.&quot;
 msgstr &quot;&quot;
-&quot;J'esp&#232;re juste que ces d&#233;mons sont plus facile &#224; battre que ceux que nous &quot;
-&quot;avons eu dans notre vall&#233;e.&quot;
+&quot;J'esp&#232;re juste que ces d&#233;mons sont plus faciles &#224; battre que ceux qui &quot;
+&quot;&#233;taient dans notre vall&#233;e. Nous sommes plus mal en point maintenant, et &quot;
+&quot;embaucher de nouveaux soldats sera tr&#232;s difficile.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:213
@@ -4921,23 +4950,23 @@
 &quot;sent to their valley! Never mind, we shall take care of them easily.&quot;
 msgstr &quot;&quot;
 &quot;Oh, mais qu'est-ce qu'on a ici&#160;? Les sales elfes qui ont fui les troupes &quot;
-&quot;d'assaut envoy&#233; contre leur vall&#233;e&#160;! C'est sans importance, nous allons &quot;
+&quot;d'assaut envoy&#233;es contre leur vall&#233;e&#160;! C'est sans importance, nous allons &quot;
 &quot;facilement nous occuper d'eux.&quot;
 
 #. [message]: speaker=Mal Keshar
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:219
 msgid &quot;There is still the fugitive leader left. What should we do?&quot;
-msgstr &quot;Il reste juste le chef des fugitifs. Qu'en faisons nous&#160;?&quot;
+msgstr &quot;Il reste juste le chef des fugitifs. Que fait-on&#160;?&quot;
 
 #. [option]: speaker=Galas
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:225
 msgid &quot;Let's finish with them now!&quot;
-msgstr &quot;Finissons en avec eux maintenant&#160;!&quot;
+msgstr &quot;Finissons-en avec eux maintenant&#160;!&quot;
 
 #. [option]: speaker=Galas
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:239
 msgid &quot;Ignore them for now and let them flee away.&quot;
-msgstr &quot;Ignorez les pour le moment et laissez les fuir loin.&quot;
+msgstr &quot;Ignorez-les pour le moment et laissez-les fuir.&quot;
 
 #. [message]
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:253
@@ -4959,8 +4988,8 @@
 &quot;It is said that these beasts are impossible to kill. Let us see whether that &quot;
 &quot;is true or not.&quot;
 msgstr &quot;&quot;
-&quot;On raconte que ces b&#234;tes sont impossible &#224; tuer. Allons voir si c'est vrai &quot;
-&quot;ou non.&quot;
+&quot;On raconte que ces b&#234;tes sont impossible &#224; tuer. V&#233;rifions si c'est vrai ou &quot;
+&quot;non.&quot;
 
 #. [message]: speaker=Galas
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:289
@@ -4985,7 +5014,7 @@
 #. [message]: speaker=second_unit
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:326
 msgid &quot;We shall see who dies first!&quot;
-msgstr &quot;Nous vous verrons p&#233;rir tout d'abord.&quot;
+msgstr &quot;Nous allons voir qui meurt le premier&#160;!&quot;
 
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:343
@@ -5001,7 +5030,7 @@
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:363
 msgid &quot;Begone, foul undead! I shall not be your servant - Ugh.&quot;
 msgstr &quot;&quot;
-&quot;Hors d'ici, stupide mort-vivant&#160;! Je ne serai pas votre serviteur - Beurk.&quot;
+&quot;Hors d'ici, stupide mort-vivant&#160;! Je ne serai pas votre serviteur. Beurk.&quot;
 
 #. [message]: speaker=Jala Nekhar
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:369
@@ -5011,7 +5040,7 @@
 #. [message]: speaker=second_unit
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:384
 msgid &quot;Die now!&quot;
-msgstr &quot;Mourrez maintenant&#160;!&quot;
+msgstr &quot;Mourez maintenant&#160;!&quot;
 
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:389
@@ -5020,7 +5049,7 @@
 &quot;don't kill me or the rest of my people!&quot;
 msgstr &quot;&quot;
 &quot;Non&#160;! Attendez&#160;! J'ai quelque chose, quelque chose qui pourrait vous aider &quot;
-&quot;dans votre voyage&#160;! Juste ne me tuez pas, ni moi ni le reste de mes gens&#160;!&quot;
+&quot;dans votre voyage&#160;! Ne me tuez pas, ni moi, ni le reste de mon peuple&#160;!&quot;
 
 #. [then]
 #. [message]: speaker=second_unit
@@ -5032,7 +5061,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:397
 msgid &quot;He does not seem to be lying. What do you think, master Galas?&quot;
-msgstr &quot;Il ne semble pas mentir&#160;! Qu'en pensez vous, ma&#238;tre Galas&#160;?&quot;
+msgstr &quot;Il ne semble pas mentir&#160;! Qu'en pensez-vous, ma&#238;tre Galas&#160;?&quot;
 
 #. [message]: speaker=Galas
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:401
@@ -5050,7 +5079,7 @@
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:411
 msgid &quot;I swear. Now, take my reserve, 95 gold pieces.&quot;
-msgstr &quot;Je le jure. Maintenant prenez mon butin, 95 pi&#232;ces d'or.&quot;
+msgstr &quot;Je le jure. Prenez d&#232;s &#224; pr&#233;sent mon butin, 95 pi&#232;ces d'or.&quot;
 
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:416
@@ -5083,9 +5112,9 @@
 &quot;that keeps the bearer healthy and strong. They are rare, though, so we &quot;
 &quot;should carefully choose who should take it.&quot;
 msgstr &quot;&quot;
-&quot;Oui, je sais. Il est dit que cette sorte d'artefacts poss&#232;de quelque magie &quot;
+&quot;Oui, je sais. Il est dit que cette sorte d'art&#233;facts poss&#232;de quelque magie &quot;
 &quot;de soin qui maintient le porteur fort et en bonne sant&#233;. Ils sont rares, &quot;
-&quot;aussi devons nous choisir avec soin qui le portera.&quot;
+&quot;aussi devons nous choisir avec intelligence qui le portera.&quot;
 
 #. [message]: speaker=narrator
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:461
@@ -5114,8 +5143,8 @@
 &quot;The Ring of Regeneration may only be used by living creatures, that are not &quot;
 &quot;bats or suchlike.&quot;
 msgstr &quot;&quot;
-&quot;L'anneau de r&#233;g&#233;n&#233;ration ne peut &#234;tre utilis&#233; que par un vivant, mais pas &quot;
-&quot;des chauves-souris ou apparent&#233;es.&quot;
+&quot;L'anneau de r&#233;g&#233;n&#233;ration ne peut &#234;tre utilis&#233; que par un &#234;tre vivant, mais &quot;
+&quot;pas par des chauves-souris ou des &#234;tres apparent&#233;s.&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:490
@@ -5126,8 +5155,8 @@
 &quot;the ring's power.&quot;
 msgstr &quot;&quot;
 &quot;Lorsque vous enfilez l'anneau &#224; votre doigt, une sensation de soins et de &quot;
-&quot;force vous &#233;crase. Bient&#244;t toutes vos blessures gu&#233;rissent magiquement par &quot;
-&quot;le pouvoir de l'anneau.&quot;
+&quot;force vous envahi. Vos blessures gu&#233;rissent magiquement gr&#226;ce au pouvoir de &quot;
+&quot;l'objet.&quot;
 
 #. [option]: speaker=Galas
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:545
@@ -5142,14 +5171,14 @@
 #. [command]
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:555
 msgid &quot;I do not think so. Quickly, get him!&quot;
-msgstr &quot;Je ne pense pas. Vite, prenez le&#160;!&quot;
+msgstr &quot;Je ne pense pas. Vite, capturez-le&#160;!&quot;
 
 #. [message]: role=killer
 #. [message]: speaker=killer
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:581
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:603
 msgid &quot;As you command, master.&quot;
-msgstr &quot;&#192; vos ordres, Ma&#238;tre.&quot;
+msgstr &quot;&#192; vos ordres, ma&#238;tre.&quot;
 
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:589
@@ -5160,7 +5189,7 @@
 #. [message]: speaker=second_unit
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:627
 msgid &quot;At least he left some of his gold behind.&quot;
-msgstr &quot;Au moins il a laiss&#233; de l'or derri&#232;re lui.&quot;
+msgstr &quot;Au moins, il a laiss&#233; de l'or derri&#232;re lui.&quot;
 
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:666
@@ -5230,15 +5259,14 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:869
-#, fuzzy
 msgid &quot;&quot;
 &quot;No, it is not. It's just the end of the desert. Looks like plants have &quot;
 &quot;managed to survive and evolve under the harsh suns after the Fall. Not all &quot;
 &quot;is dried up then. (looks at Anlind&#235;)&quot;
 msgstr &quot;&quot;
-&quot;Non, c'est juste la fin du d&#233;sert. Il semble que les plantes aient r&#233;ussi &#224; &quot;
-&quot;survivre et &#233;voluer sous les ardents rayons du soleil apr&#232;s le Chute. Tout &quot;
-&quot;n'est dont pas sec. (regard vers Analia)&quot;
+&quot;Non. C'est juste la fin du d&#233;sert. Les plantes semblent avoir r&#233;ussi &#224; &quot;
+&quot;survivre et &#224; &#233;voluer sous les rayons ardents du soleil apr&#232;s la Chute. Tout &quot;
+&quot;n'est pas dess&#233;ch&#233; (regard vers Anlind&#235;).&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/05a_Crossfire.cfg:870
@@ -5360,7 +5388,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/05b_Cursed_Plateau.cfg:133
 msgid &quot;Alright. Let's replenish our supplies and continue traveling...&quot;
-msgstr &quot;&quot;
+msgstr &quot;D'accord. Refaisons le plein de provisions et continuons le voyage...&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/05b_Cursed_Plateau.cfg:134
@@ -5500,18 +5528,22 @@
 &quot;be blessed by the Lords of Light; bear it and it shall grant you strength &quot;
 &quot;and heal your wounds'.&quot;
 msgstr &quot;&quot;
+&quot;Je devrais pouvoir traduire &#231;a. On dirait un ancien langage, parl&#233; par les &quot;
+&quot;hommes de Wesnoth. L'inscription dit&#160;: &#171;&#160;vous qui avez trouv&#233; cet anneau, &quot;
+&quot;soyez b&#233;nis par les Seigneurs de la Lumi&#232;re&#160;; passez le &#224; votre doigt et &quot;
+&quot;vous verrez votre vigueur augment&#233; et vos blessures se refermer.&#160;&#187;&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/05b_Cursed_Plateau.cfg:262
-#, fuzzy
 msgid &quot;&quot;
 &quot;It is a ring of regeneration. It is said that this kind of artifacts have &quot;
 &quot;some healing magic that keeps the bearer healthy and strong. They are rare, &quot;
 &quot;though, so we should carefully choose who should take it.&quot;
 msgstr &quot;&quot;
-&quot;Oui, je sais. Il est dit que cette sorte d'artefacts poss&#232;de quelque magie &quot;
-&quot;de soin qui maintient le porteur fort et en bonne sant&#233;. Ils sont rares, &quot;
-&quot;aussi devons nous choisir avec soin qui le portera.&quot;
+&quot;C'est un anneau de r&#233;g&#233;n&#233;ration. On pr&#233;tend que cette sorte d'art&#233;fact &quot;
+&quot;poss&#232;de quelque magie de soin qui maintient le porteur fort et en bonne &quot;
+&quot;sant&#233;. Ils sont rares, nous devons donc choisir avec intelligence qui le &quot;
+&quot;portera.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/05b_Cursed_Plateau.cfg:263
@@ -5625,15 +5657,14 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/06_The_Moon_Valley.cfg:261
-#, fuzzy
 msgid &quot;&quot;
 &quot;How foolish words! I could have killed you all while you were sleeping if I &quot;
 &quot;really wanted to! Don't think you are the first one to misunderstand my &quot;
 &quot;actions...&quot;
 msgstr &quot;&quot;
-&quot;Imb&#233;cile&#160;! J'aurai pu tous vous tuer durant votre sommeil si je l'avais &quot;
-&quot;vraiment voulu. Ne croyez pas que vous &#234;tes les premiers &#224; mal interpr&#233;ter &quot;
-&quot;mes actes...&quot;
+&quot;Quels mots imb&#233;ciles&#160;! J'aurais pu tous vous tuer durant votre sommeil si je &quot;
+&quot;l'avais vraiment voulu ! Ne croyez pas que vous &#234;tes les premiers &#224; mal &quot;
+&quot;interpr&#233;ter mes actes...&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/06_The_Moon_Valley.cfg:262
@@ -5703,14 +5734,12 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/06_The_Moon_Valley.cfg:270
-#, fuzzy
 msgid &quot;&quot;
 &quot;I am not really sure where we must search first! The presence of your sage &quot;
 &quot;is too weak. If I could go in and concentrate a little...&quot;
 msgstr &quot;&quot;
-&quot;Je ne suis pas vraiment s&#251;r d'o&#249; nous devons chercher d'abord. La pr&#233;sence &quot;
-&quot;de votre sage est trop faible. Si je pouvais entrer et me concentrer un &quot;
-&quot;peu... &quot;
+&quot;Je ne suis pas vraiment s&#251;r de l'endroit o&#249; chercher d'abord. La pr&#233;sence de &quot;
+&quot;votre sage est trop faible. Si je pouvais entrer et me concentrer un peu... &quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/06_The_Moon_Valley.cfg:271
@@ -5965,6 +5994,9 @@
 &quot;I have heard and read old stories of creatures big as that one, but I &quot;
 &quot;thought they were mere myths, not that they were this true!&quot;
 msgstr &quot;&quot;
+&quot;J'avais d&#233;j&#224; lu et entendu des histoires sur des cr&#233;atures aussi imposantes &quot;
+&quot;que celle-l&#224;, mais j'ai toujours cru qu'il s'agissait de fables et non pas &quot;
+&quot;que c'&#233;tait vrai !&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/06_The_Moon_Valley.cfg:491
@@ -5972,6 +6004,8 @@
 &quot;Retreat! We must lurk the creature out of there, surround it and strike it &quot;
 &quot;down, quickly!&quot;
 msgstr &quot;&quot;
+&quot;Retraite ! Nous devons attirer la cr&#233;ature hors d'ici, l'entourer et &quot;
+&quot;l'abattre, vite !&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/06_The_Moon_Valley.cfg:492
@@ -5982,7 +6016,7 @@
 #: Invasion_from_the_Unknown/scenarios/06_The_Moon_Valley.cfg:497
 msgid &quot;&quot;
 &quot;The Short Darkness starts to cover the land, giving the orcs a new advantage.&quot;
-msgstr &quot;&quot;
+msgstr &quot;La courte nuit commence &#224; tomber, redonnant l'avantage aux orcs.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/06_The_Moon_Valley.cfg:498
@@ -5995,6 +6029,8 @@
 &quot;The combination of the might of the undead and the effectiveness of our &quot;
 &quot;hunters will be a great help to survive the darkness in this valley.&quot;
 msgstr &quot;&quot;
+&quot;La combinaison de la puissance des morts-vivants et de l'efficacit&#233; de nos &quot;
+&quot;chasseurs sera tr&#232;s utile pour survivre dans les t&#233;n&#232;bres de cette vall&#233;e.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/06_The_Moon_Valley.cfg:504
@@ -6003,6 +6039,9 @@
 &quot;species a lesson to remember. May the undead hordes rise and swallow their &quot;
 &quot;attack forces!&quot;
 msgstr &quot;&quot;
+&quot;Ah, la longue nuit, enfin ! C'est l'occasion de donner aux orcs une le&#231;on &quot;
+&quot;dont ils se souviendront. Que les forces des morts-vivants s'&#233;l&#232;vent pour &quot;
+&quot;&#233;touffer leurs forces&#160;!&quot;
 
 #. [scenario]
 #: Invasion_from_the_Unknown/scenarios/07_The_Elf_and_Goliath.cfg:4
@@ -6118,8 +6157,8 @@
 #: Invasion_from_the_Unknown/scenarios/07_The_Elf_and_Goliath.cfg:544
 msgid &quot;This potion can only be used by living beings. Let other take it.&quot;
 msgstr &quot;&quot;
-&quot;Cette potion peut &#234;tre utilis&#233;e exclusivement par un vivant. Laissez &quot;
-&quot;quelqu'un d'autre la prendre.&quot;
+&quot;Cette potion ne peut &#234;tre utilis&#233;e que par un vivant. Laissez quelqu'un &quot;
+&quot;d'autre la prendre.&quot;
 
 #. [else]
 #. [event]
@@ -6131,21 +6170,20 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/07_The_Elf_and_Goliath.cfg:618
 msgid &quot;Colossal Automaton&quot;
-msgstr &quot;Auto-maton colossal&quot;
+msgstr &quot;Automate colossal&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/07_The_Elf_and_Goliath.cfg:625
-#, fuzzy
 msgid &quot;&quot;
 &quot;You find yourself before a giant creature of metallic shield, whose &quot;
 &quot;appearance hardly would resemble a normal human's. Its deep metallic &quot;
 &quot;breathing, and uncanny noises coming from inside its body, make you wonder &quot;
 &quot;about its origin.&quot;
 msgstr &quot;&quot;
-&quot;Vous vous trouvez devant une cr&#233;ature g&#233;ante tel un bouclier m&#233;tallique dont &quot;
-&quot;l'apparence ressemble quelque peu &#224; un humain normal. Son souffle m&#233;tallique &quot;
-&quot;profond et les &#233;tranges bruits issus de de l'int&#233;rieur de son corps vous &quot;
-&quot;font vous poser des questions sur son origine.&quot;
+&quot;Vous vous trouvez devant une cr&#233;ature g&#233;ante bard&#233;e de m&#233;tal, dont &quot;
+&quot;l'apparence est bien peu humaine. Sa respiration m&#233;tallique profonde, et les &quot;
+&quot;&#233;tranges bruits &#224; l'int&#233;rieur de son corps vous font vous poser des &quot;
+&quot;questions sur son origine.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/07_The_Elf_and_Goliath.cfg:626
@@ -6191,7 +6229,7 @@
 msgid &quot;&quot;
 &quot;Look, this wall opened after we killed that beast. Should we go this way?&quot;
 msgstr &quot;&quot;
-&quot;Regardez, ce mur s'est ouvert apr&#232;s la mort de la b&#234;te. Suivrons nous cette &quot;
+&quot;Regardez, ce mur s'est ouvert apr&#232;s la mort de la b&#234;te. Suivrons-nous cette &quot;
 &quot;voie&#160;?&quot;
 
 #. [event]
@@ -6202,7 +6240,7 @@
 #. [event]: (race=shaxthal)}
 #: Invasion_from_the_Unknown/scenarios/07_The_Elf_and_Goliath.cfg:720
 msgid &quot;I thought I had seen everything, but what is that thing?!&quot;
-msgstr &quot;Je croyais avoir d&#233;j&#224; tout vu, mais quelle est ce truc&#160;?&quot;
+msgstr &quot;Je croyais avoir d&#233;j&#224; tout vu, mais quel est ce truc&#160;?&quot;
 
 #. [event]: (race=shaxthal)}
 #: Invasion_from_the_Unknown/scenarios/07_The_Elf_and_Goliath.cfg:721
@@ -6242,7 +6280,7 @@
 #. [objectives]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:275
 msgid &quot;Explore the caves and defeat any enemies you find&quot;
-msgstr &quot;Explorez les cavernes et d&#233;truisez tous les ennemis rencontr&#233;s&quot;
+msgstr &quot;Explorer les cavernes et d&#233;truire tous les ennemis rencontr&#233;s&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:285
@@ -6255,8 +6293,8 @@
 &quot;It used to be called Knalga, the Dwarven Kingdom. I am not sure if there are &quot;
 &quot;any dwarves left to justify its name in this era.&quot;
 msgstr &quot;&quot;
-&quot;Il est appel&#233; habituellement Knalga, le royaume des nains. Je ne suis pas &quot;
-&quot;certain qu'il reste encore des nains pour justifier du nom de ces lieux.&quot;
+&quot;Il s'appelait Knalga, le royaume des nains. Je ne suis pas certain qu'il &quot;
+&quot;reste encore des nains pour justifier du nom de ces lieux.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:287
@@ -6286,7 +6324,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:332
 msgid &quot;Roar!!!&quot;
-msgstr &quot;Roar!!!&quot;
+msgstr &quot;Roar&#160;!!!&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:367
@@ -6296,7 +6334,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:373
 msgid &quot;Exactly... uhm... Alright.&quot;
-msgstr &quot;Exactement... hum... d'accord&#160;!&quot;
+msgstr &quot;Exactement... hum... D'accord.&quot;
 
 #. [unit]: description=Troll's Corpse
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:383
@@ -6317,7 +6355,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:401
 msgid &quot;Why are you looking at me in that manner?&quot;
-msgstr &quot;Pourquoi me d&#233;visagez vous ainsi&#160;?&quot;
+msgstr &quot;Pourquoi me d&#233;visagez-vous ainsi&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:402
@@ -6325,9 +6363,8 @@
 &quot;So, there must be dwarves left, unless we had the luck of witnessing the &quot;
 &quot;death... and rising as undead, of the last one.&quot;
 msgstr &quot;&quot;
-&quot;Enfin, ils doivent rester des nains, &#224; moins que nous n'ayons la chance de &quot;
-&quot;rencontrer la mort... et de nous relever comme mort-vivant, une derni&#232;re &quot;
-&quot;fois.&quot;
+&quot;Enfin, il doit rester des nains, sauf si nous venons d'assister &#224; la mort du &quot;
+&quot;dernier... qui pourra toujours &#234;tre relev&#233; comme mort-vivant.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:404
@@ -6336,13 +6373,12 @@
 &quot;these caves without help of experts in these... cavey bussiness.&quot;
 msgstr &quot;&quot;
 &quot;Cherchez leur chef et demandez-lui de l'aide. Nous ne r&#233;sisterons pas &quot;
-&quot;longtemps dans ces cavernes sans l'aide des experts dans ce... travail &quot;
-&quot;cavernicole.&quot;
+&quot;longtemps dans ces cavernes sans l'aide d'experts en... travaux souterrains.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:405
 msgid &quot;Dwarves and elves were never friends in my time.&quot;
-msgstr &quot;De mon temps les nains et les elfes n'ont jamais &#233;t&#233; amis.&quot;
+msgstr &quot;De mon temps, les nains et les elfes n'&#233;taient jamais amis.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:406
@@ -6351,14 +6387,14 @@
 &quot;Those greedy cave-dwellers would not refuse some gold and help, do you think &quot;
 &quot;so Galas?&quot;
 msgstr &quot;&quot;
-&quot;C'est vrai, mais ils pourraient &#234;tre d'accord si nous leur offrons quelque &quot;
-&quot;chose en &#233;change. Ces troglodytes avides ne refuseraient pas un peu d'or et &quot;
-&quot;nous aideraient, qu'en pense tu Galas&#160;?&quot;
+&quot;C'est vrai, mais ils pourraient l'&#234;tre si nous leur offrons quelque chose en &quot;
+&quot;&#233;change. Ces troglodytes avides ne refuseraient pas un peu d'or et &quot;
+&quot;d'assistance, n'est-ce pas Galas&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:407
 msgid &quot;I guess so. But help with what?&quot;
-msgstr &quot;J'esp&#232;re aussi. Mais de l'aide contre quoi&#160;?&quot;
+msgstr &quot;C'est probable. Mais de l'aide avec quoi&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:408
@@ -6366,13 +6402,13 @@
 &quot;Their natural enemies: Trolls. We'd better rid these tunnels of them before &quot;
 &quot;asking the dwarves anything.&quot;
 msgstr &quot;&quot;
-&quot;Leur ennemi naturel, les trolls. Nous ferions mieux de d'en d&#233;barrasser les &quot;
+&quot;Leur ennemi naturel, les trolls. Nous ferions mieux d'en d&#233;barrasser les &quot;
 &quot;tunnels avant de demander quoique ce soit aux nains.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:410
 msgid &quot;They'll make interesting additions to my collection.&quot;
-msgstr &quot;Ils feront un amusant ajout &#224; ma collection.&quot;
+msgstr &quot;Ils compl&#233;teront bien &#224; ma collection.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:423
@@ -6388,9 +6424,9 @@
 &quot;on, thus falling off to the depths of the world. Who knows what fate awaits &quot;
 &quot;them at the chasm's bottom.&quot;
 msgstr &quot;&quot;
-&quot;Le sol de la caverne s'effondra, laissant le pauvre personnage sans support &quot;
-&quot;pour se d&#233;placer et le pr&#233;cipitant dans les profondeurs du monde.Qui sait le &quot;
-&quot;destin qui l'attendrait au fond de la crevasse.&quot;
+&quot;Le sol de la caverne s'effondra, laissant le pauvre personnage sans rien &quot;
+&quot;pour le soutenir et le pr&#233;cipitant dans les profondeurs de la terre.Qui sait &quot;
+&quot;le destin qui l'attendait au fond de la crevasse.&quot;
 
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:467
@@ -6400,12 +6436,14 @@
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:495
 msgid &quot;Uh, the cave's floor here looks particularily weak.&quot;
-msgstr &quot;Oh-oh, le sol de cette cave semble particuli&#232;rement faible ici.&quot;
+msgstr &quot;Oh oh, le sol de cette grotte semble particuli&#232;rement fragile ici.&quot;
 
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:501
 msgid &quot;Neep, neep, neeeeep! (translated: 'Cave floor weak, cave floor weak!')&quot;
-msgstr &quot;Plancher faible, plancher faible, plancher faible...&quot;
+msgstr &quot;&quot;
+&quot;Neep, neep, neeeeep&#160;! (Traduction&#160;: &#171;&#160;Plancher faible, plancher faible, &quot;
+&quot;plancher faible&#160;!&#160;&#187;)&quot;
 
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:524
@@ -6436,6 +6474,9 @@
 &quot;Boy, you don't need to see it as an assassination. Just think of it as the &quot;
 &quot;evolution of that poor useless beast into a powerful force that can serve us.&quot;
 msgstr &quot;&quot;
+&quot;Mon gar&#231;on, ce n'est pas la peine de voir &#231;a comme un assassinat. Prenez-le &quot;
+&quot;comme une &#233;volution d'une pauvre b&#234;te inutile en puissance qui pourrait nous &quot;
+&quot;servir.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:574
@@ -6488,7 +6529,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:771
 msgid &quot;We defeated the Colossal Automaton, if that is what you're asking.&quot;
-msgstr &quot;&quot;
+msgstr &quot;Nous avons d&#233;fait l'automate colossal, si c'est ce que vous demandez.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:775
@@ -6534,13 +6575,12 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:792
-#, fuzzy
 msgid &quot;&quot;
 &quot;We? I don't understand, actually. Our people have never been out of our &quot;
 &quot;valley since the Fall!&quot;
 msgstr &quot;&quot;
-&quot;Nos parents&#160;? Je ne pense pas. notre peuple n'a jamais quitt&#233; sa vall&#233;e &quot;
-&quot;depuis la Chute.&quot;
+&quot;Nous&#160;? Je ne comprends pas, vraiment. Notre peuple n'a jamais quitt&#233; sa &quot;
+&quot;vall&#233;e depuis la Chute !&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:793
@@ -6574,20 +6614,18 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:803
-#, fuzzy
 msgid &quot;What is going on? Elves from the desert? Anlind&#235;, might them have...&quot;
 msgstr &quot;&quot;
-&quot;Que se passe-t-il&#160;? Des elfes du d&#233;sert&#160;? Analia, pourrait il s'agir...&quot;
+&quot;Que se passe-t-il&#160;? Des elfes du d&#233;sert&#160;? Anlind&#235;, pourraient-ils avoir...&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:804
-#, fuzzy
 msgid &quot;&quot;
 &quot;I think that would be a discussion for a better moment, when we have &quot;
 &quot;finished our new job here.&quot;
 msgstr &quot;&quot;
-&quot;Je pense que nous devrions bavarder &#224; un meilleur moment. Nous en parlerons &quot;
-&quot;plus tard, lorsque nous aurons termin&#233; notre travail ici.&quot;
+&quot;Nous devrions bavarder &#224; un moment plus propice, lorsque nous aurons termin&#233; &quot;
+&quot;notre nouveau travail ici.&quot;
 
 #. [event]
 #. [then]
@@ -6635,6 +6673,9 @@
 &quot;injured, but I guess I'll make it there. Please stand fast, friend elves. I &quot;
 &quot;shall be back with you soon.&quot;
 msgstr &quot;&quot;
+&quot;Argh... je dois... je dois informer le roi de ces nouvelles. Je suis &quot;
+&quot;gravement bless&#233;, mais je crois que je pourrai y arriver. De gr&#226;ce, d&#233;p&#234;chez-&quot;
+&quot;vous, amis elfes. Je vous rejoindrai bient&#244;t.&quot;
 
 #. [unit]: type=Dwarvish Fighter, description=FAKEDWARFLEADER
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:880
@@ -6708,12 +6749,11 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/08a_Errand_of_Hope.cfg:1090
-#, fuzzy
 msgid &quot;&quot;
 &quot;NOTE FOR TRANSLATORS: Eela is a female nagini name derivated from 'eel', &quot;
 &quot;that I invented IIRC :) Use it as you desire in your target language.&quot;
 msgstr &quot;&quot;
-&quot;NOTE AUX TRADUCTEURS&#160;: Eela est une femelle naga (nagini) dont le nom &quot;
+&quot;Note aux traducteurs&#160;: Eela est une femelle naga (nagini) dont le nom &quot;
 &quot;provient de anguille. Transcrivez-le comme vous voulez.&quot;
 
 #. [unit]: type=Naga Fighter, description=Eela
@@ -6996,14 +7036,12 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/09_The_Library.cfg:294
-#, fuzzy
 msgid &quot;&quot;
 &quot;I think we ought to investigate the place. Perhaps we can find valuable &quot;
 &quot;information on the location of our sages.&quot;
 msgstr &quot;&quot;
-&quot;Je pense que nous devons fouiller l'endroit. &#199;a ressemble &#224; une &quot;
-&quot;biblioth&#232;que, peut-&#234;tre que nous trouverons des informations int&#233;ressantes. &quot;
-&quot;C'est seulement mon avis.&quot;
+&quot;Nous devrions fouiller cet endroit. Peut-&#234;tre que nous y trouverons des &quot;
+&quot;informations int&#233;ressantes pour localiser nos &#233;rudits.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/09_The_Library.cfg:295
@@ -7023,6 +7061,8 @@
 &quot;Note: Galas is getting used to moving in caves, so his movement cost in &quot;
 &quot;caves is reduced 1 unit .&quot;
 msgstr &quot;&quot;
+&quot;Remarque : Galas s'habitue &#224; se d&#233;placer dans les souterrains&#160;; il lui faut &quot;
+&quot;donc un point de mouvement de moins pour s'y d&#233;placer.&quot;
 
 #. [objectives]
 #: Invasion_from_the_Unknown/scenarios/17_Dawn_of_the_Great_War.cfg:540
@@ -7288,6 +7328,8 @@
 &quot;I could swear that thing is a reptilian that was rid of its eyes, somehow. &quot;
 &quot;Awful.&quot;
 msgstr &quot;&quot;
+&quot;Je jurerais que cette chose est un reptile auquel on a &#244;t&#233; les yeux, d'une &quot;
+&quot;fa&#231;on ou d'une autre. C'est atroce.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/09_The_Library.cfg:528
@@ -7296,6 +7338,9 @@
 &quot;experiments with them. I can't help but wonder what other kinds of &quot;
 &quot;abominations hide in here.&quot;
 msgstr &quot;&quot;
+&quot;Je parie que la civilisation qui habitait ses cavernes a fait d'horribles &quot;
+&quot;exp&#233;riences sur eux. Je me demande quelles autres abominations se cachent &quot;
+&quot;ici.&quot;
 
 #. [message]: speaker=second_unit
 #: Invasion_from_the_Unknown/scenarios/09_The_Library.cfg:542
@@ -7307,6 +7352,8 @@
 msgid &quot;&quot;
 &quot;Surely the spears of our guardsmen would do no harm to these rocky beings.&quot;
 msgstr &quot;&quot;
+&quot;Les lances de nos gardes ne pourront s&#251;rement pas blesser ces &#234;tres de &quot;
+&quot;pierre.&quot;
 
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/scenarios/09_The_Library.cfg:551
@@ -7437,6 +7484,8 @@
 &quot;I feel it. It is the Source of Light. Her presence is weak in comparison to &quot;
 &quot;when she was in the surface, but strong anyway.&quot;
 msgstr &quot;&quot;
+&quot;Je la sens. C'est la Source de Lumi&#232;re. Sa pr&#233;sence est faible compar&#233; &#224; ce &quot;
+&quot;qu'elle &#233;tait &#224; la surface, mais demeure imposante n&#233;anmoins.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/10_The_Source_of_Light.cfg:364
@@ -7631,15 +7680,14 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/10_The_Source_of_Light.cfg:841
-#, fuzzy
 msgid &quot;&quot;
 &quot;Yes, runic glyphs! They activate on contact, and most important chambers, &quot;
 &quot;gates and tunnels are designed to be opened via this sort of glyphs. But, &quot;
 &quot;where are them?&quot;
 msgstr &quot;&quot;
-&quot;Oui, les glyphes runiques&#160;! Elles s'activent par contact et sont &quot;
-&quot;habituellement utilis&#233;es pour ouvrir des portes et des tunnels. Mais, o&#249; &quot;
-&quot;sont elles&#160;?&quot;
+&quot;Oui, des glyphes runiques&#160;! Ils s'activent par contact et sont &quot;
+&quot;habituellement utilis&#233;s pour ouvrir des portes, des tunnels, des salles &quot;
+&quot;importantes. Mais, o&#249; sont-elles&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/10_The_Source_of_Light.cfg:842
@@ -7775,7 +7823,6 @@
 
 #. [event]: (description=Mal Keshar)}
 #: Invasion_from_the_Unknown/scenarios/10_The_Source_of_Light.cfg:1244
-#, fuzzy
 msgid &quot;&quot;
 &quot;As Anlind&#235; pronounced the spell, the great tree at the center of the chamber &quot;
 &quot;disappeared, and a beautiful elven lady materialized in its place, laying in &quot;
@@ -7784,13 +7831,12 @@
 &quot;asleep, her powers were still enough to illuminate the surroundings without &quot;
 &quot;requiring any minimal effort from her.&quot;
 msgstr &quot;&quot;
-&quot;Tandis qu'Analia prononcait l'incantation, le grand arbre du centre de la &quot;
-&quot;chambre disparaissait et une belle dame elfe se mat&#233;rialisit &#224; sa place, &quot;
-&quot;gisant sur le sol herbeux. Des grandes ailes de libellule sur son dos, son &quot;
-&quot;cheveux et ses yeux roux p&#226;le montraient &#224; l'&#233;vidence qu'elle n'&#233;tais pas &quot;
-&quot;une elfe mais la Madone de Lumi&#232;re. M&#234;me semi-endormie, ses pouvoirs &#233;taient &quot;
-&quot;fsuffisants pour illuminer les alentours sans exiger plus qu'un effort &quot;
-&quot;minimal de sa part.&quot;
+&quot;Tandis qu'Anlind&#235; prononcait l'incantation, l'arbre v&#233;n&#233;rable du centre de &quot;
+&quot;la salle disparaissait et une belle dame elfe se mat&#233;rialisait &#224; la place, &quot;
+&quot;gisant sur le sol herbeux. Des grandes ailes de libellule sur son dos, ses &quot;
+&quot;cheveux roux et ses yeux rouges p&#226;les montraient &#224; l'&#233;vidence qu'elle &quot;
+&quot;n'&#233;tait pas une elfe mais la Madone de Lumi&#232;re. M&#234;me &#224; moiti&#233; endormie, ses &quot;
+&quot;pouvoirs suffisaient &#224; illuminer les alentours sans effort de sa part.&quot;
 
 #. [unit]: type=Lady of Light, description=Elynia
 #. [unit]: type=Sylvan Faerie, description=Elynia
@@ -7808,15 +7854,13 @@
 
 #. [event]: (description=Mal Keshar)}
 #: Invasion_from_the_Unknown/scenarios/10_The_Source_of_Light.cfg:1270
-#, fuzzy
 msgid &quot;&quot;
 &quot;Note for translators: Galas is supposed to be saying 'we', so the 'W' here &quot;
 &quot;stands for the first syllabe or half of it, depending on the target &quot;
 &quot;translation language.&quot;
 msgstr &quot;&quot;
-&quot;Note for translators: Galas is supposed to be saying 'we', so the 'W' here &quot;
-&quot;stands for the first syllabe or half of it, depending on the target &quot;
-&quot;translation language.&quot;
+&quot;Note aux traducteurs&#160;: Galas est suppos&#233; dire 'nous'. 'W' remplace la &quot;
+&quot;premi&#232;re syllabe.&quot;
 
 #. [message]: description=Galas
 #: Invasion_from_the_Unknown/scenarios/10_The_Source_of_Light.cfg:1273
@@ -7833,15 +7877,13 @@
 
 #. [event]: (description=Mal Keshar)}
 #: Invasion_from_the_Unknown/scenarios/10_The_Source_of_Light.cfg:1276
-#, fuzzy
 msgid &quot;&quot;
 &quot;Note for translators: Mal Keshar is supposed to be saying 'actually', so &quot;
 &quot;whatever thing you put here in the target language, must be phonetically ~3 &quot;
 &quot;syllabes long. Only a suggestion anyway.&quot;
 msgstr &quot;&quot;
-&quot;Note for translators: Mal Keshar is supposed to be saying 'actually', so &quot;
-&quot;whatever thing you put here in the target language, must be phonetically ~3 &quot;
-&quot;syllabes long. Only a suggestion anyway.&quot;
+&quot;Note aux traducteurs&#160;: Mal Keshar est suppos&#233; dire 'vraiment'. Le langage de &quot;
+&quot;traduction devrait de pr&#233;f&#233;rence avoir ~3 syllabes de long.&quot;
 
 #. [message]: description=Mal Keshar
 #: Invasion_from_the_Unknown/scenarios/10_The_Source_of_Light.cfg:1279
@@ -7937,8 +7979,8 @@
 msgstr &quot;&quot;
 &quot;J'ai peut-&#234;tre &#233;t&#233; endormie tout ce temps, mais ma m&#233;moire est toujours &quot;
 &quot;intacte. Galas, petit-fils d'Alduil. Vous &#233;tiez du c&#244;t&#233; de nos pires ennemis &quot;
-&quot;tout ce temps et vous ne le saviez m&#234;me pas. Mais bon, nous pourrions mettre &quot;
-&quot;de c&#244;t&#233; nos diff&#233;rences et discuter, pourquoi &#234;tes-vous venus ici, me &quot;
+&quot;durant tout ce temps et vous ne le saviez m&#234;me pas. Mais bon, nous pourrions &quot;
+&quot;oublier nos diff&#233;rents et discuter&#160;; pourquoi &#234;tes-vous venus ici me &quot;
 &quot;r&#233;veiller&#160;?&quot;
 
 #. [event]: (description=Mal Keshar)}
@@ -7950,10 +7992,10 @@
 &quot;find a new home. That is where we met Keshar...&quot;
 msgstr &quot;&quot;
 &quot;Apr&#232;s que vous ayez chang&#233; de chemin avec notre peuple, maintenant les elfes &quot;
-&quot;du d&#233;sert, nous avons &#233;tablit notre patrie dans une vall&#233;e loin &#224; l'est, &quot;
-&quot;vall&#233;e qui fut d&#233;nomm&#233;e en votre honneur et dans laquelle nous v&#233;c&#251;mes &quot;
-&quot;longtemps. N&#233;anmoins, de r&#233;cents &#233;v&#232;nements nous ont forc&#233; &#224; fuir et &#224; &quot;
-&quot;trouver un nouveau g&#238;te.. C'est ainsi que nous avons rencontr&#233; Keshar...&quot;
+&quot;du d&#233;sert, nous avons &#233;tabli notre patrie dans une vall&#233;e loin &#224; l'est qui &quot;
+&quot;fut nomm&#233;e en votre honneur et dans laquelle nous v&#233;c&#251;mes longtemps. &quot;
+&quot;N&#233;anmoins, de r&#233;cents &#233;v&#232;nements nous ont forc&#233;s &#224; fuir et &#224; trouver un &quot;
+&quot;nouveau g&#238;te. C'est ainsi que nous avons rencontr&#233; Keshar...&quot;
 
 #. [event]: (description=Mal Keshar)}
 #: Invasion_from_the_Unknown/scenarios/10_The_Source_of_Light.cfg:1339
@@ -7964,8 +8006,8 @@
 #: Invasion_from_the_Unknown/scenarios/10_The_Source_of_Light.cfg:1340
 msgid &quot;And he led us here to ask you for help in our war against the demons...&quot;
 msgstr &quot;&quot;
-&quot;Et il nous a accompagn&#233; ici pour vous demander votre aide dans notre guerre &quot;
-&quot;contre les d&#233;mons.&quot;
+&quot;Et il nous a accompagn&#233;s ici pour vous demander votre aide dans notre guerre &quot;
+&quot;contre les d&#233;mons...&quot;
 
 #. [event]: (description=Mal Keshar)}
 #: Invasion_from_the_Unknown/scenarios/10_The_Source_of_Light.cfg:1341
@@ -7976,7 +8018,7 @@
 msgstr &quot;&quot;
 &quot;Les quoi&#160;? Des d&#233;mons&#160;? Mais... mais... c'est impossible, j'ai fais en sorte &quot;
 &quot;qu'ils ne reviennent jamais, j'ai emprisonn&#233; Yanqui et verrouill&#233; le &quot;
-&quot;portail. Personne ne pouvait imaginer comment le r&#233;-ouvrir, je pense.&quot;
+&quot;portail. Personne ne pouvait imaginer comment le r&#233;-ouvrir, je crois.&quot;
 
 #. [event]: (description=Mal Keshar)}
 #: Invasion_from_the_Unknown/scenarios/10_The_Source_of_Light.cfg:1342
@@ -7990,7 +8032,7 @@
 &quot;the current circumstances we could make an exception. I can feel... I can &quot;
 &quot;feel your suffering for what has happened.&quot;
 msgstr &quot;&quot;
-&quot;Ce morceau de l'histoire a &#233;t&#233; interdit durant des si&#232;cles, mais je devine &quot;
+&quot;Ce morceau de l'histoire a &#233;t&#233; censur&#233; durant des si&#232;cles, mais je devine &quot;
 &quot;que dans les circonstances actuelles nous pouvons faire exception. Je peux &quot;
 &quot;sentir... je peux sentir que vous souffrez de ce qui est arriv&#233;.&quot;
 
@@ -8274,7 +8316,7 @@
 #. [event]: (description=Mal Keshar)}
 #: Invasion_from_the_Unknown/scenarios/10_The_Source_of_Light.cfg:1401
 msgid &quot;But then, why the elves parted ways?&quot;
-msgstr &quot;&quot;
+msgstr &quot;Mais alors, pourquoi les elfes se sont-ils divis&#233;s&#160;?&quot;
 
 #. [event]: (description=Mal Keshar)}
 #: Invasion_from_the_Unknown/scenarios/10_The_Source_of_Light.cfg:1402
@@ -8840,15 +8882,14 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:296
-#, fuzzy
 msgid &quot;&quot;
 &quot;Anlind&#235;, you should have already learned that there are things more &quot;
 &quot;important than life itself, and things worse than death. We won't let &quot;
 &quot;ourselves fall before the demons, no matter what should happen.&quot;
 msgstr &quot;&quot;
-&quot;Analia, tu devrais d&#233;j&#224; avoir appris qu'il y a des choses plus importantes &quot;
-&quot;que la vie elle m&#234;me et des choses pires que la mort. Nous ne laisserons &quot;
-&quot;personne tomber devant les d&#233;mons, peut importe ce qui peut advenir.&quot;
+&quot;Anlind&#235;, tu devrais d&#233;j&#224; avoir appris qu'il y a des choses plus importantes &quot;
+&quot;que la vie, et des choses pires que la mort. Nous ne nous soumettrons pas &quot;
+&quot;aux les d&#233;mons, peu importe ce qui peut advenir.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:297
@@ -8868,13 +8909,12 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:299
-#, fuzzy
 msgid &quot;&quot;
 &quot;Indeed. Also, you now have me by your side; there are no real reasons for &quot;
 &quot;declaring the battle lost before fighting.&quot;
 msgstr &quot;&quot;
-&quot;Bien s&#251;r. Vous avez &#233;galement mon pouvoir de votre c&#244;t&#233;, auss'il n'y a &quot;
-&quot;aucune raison de d&#233;clarer la bataille perdue avant m&#234;me qu'elle ait commenc&#233;.&quot;
+&quot;Bien s&#251;r. Et je suis &#224; vos c&#244;t&#233;s. Il n'y a donc aucune raison de se d&#233;clarer &quot;
+&quot;vaincus avant m&#234;me que la bataille n'ait commenc&#233;.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:304
@@ -8984,15 +9024,15 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:319
-#, fuzzy
 msgid &quot;&quot;
 &quot;Indeed. I would suggest defending ourselves with corpse barriers, that would &quot;
 &quot;delay their attack waves enough to let the best fighters and archers do &quot;
 &quot;their duty with safety.&quot;
 msgstr &quot;&quot;
-&quot;En effet. Je propose de nous prot&#233;ger avec une barri&#232;re de cadavre, ce qui &quot;
-&quot;ralentira suffisamment leur attaque pour permettre aux meilleurs combattants &quot;
-&quot;et arches de faire leur travail en s&#233;curit&#233;.&quot;
+&quot;En effet. Je proposerai d'&#233;riger une barri&#232;re avec les d&#233;pouilles, ce qui &quot;
+&quot;ralentira suffisamment leurs offensives et permettra aux meilleurs &quot;
+&quot;combattants et aux archers les plus habiles de faire leur devoir en toute &quot;
+&quot;s&#233;curit&#233;.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:325
@@ -9033,7 +9073,7 @@
 &quot;weakened their forces enough yet.&quot;
 msgstr &quot;&quot;
 &quot;&#199;a ne semble pas bon. Ils doivent pr&#233;pare leur revanche. Nous n'avons pas &quot;
-&quot;suffisamment affaiblis leurs forces.&quot;
+&quot;suffisamment affaibli leurs forces.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:345
@@ -9041,8 +9081,8 @@
 &quot;In that case, I do not see any option other than leaving these mountains. &quot;
 &quot;We, elves, and dwarves alike.&quot;
 msgstr &quot;&quot;
-&quot;Dans ce cas je ne vois pas d'autre solution que de quitter ces montagnes. &quot;
-&quot;Nous les elfes et pareillement les nains.&quot;
+&quot;Dans ce cas nous n'avons pas d'autre solution que de quitter ces montagnes. &quot;
+&quot;Nous les elfes, et pareillement les nains.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:346
@@ -9062,9 +9102,9 @@
 &quot;worse. The loyalists are already aware of our presence, and shall not stop &quot;
 &quot;until taking over Knalga and our lives.&quot;
 msgstr &quot;&quot;
-&quot;Si vous me permettez de parler ainsi, Mon Sieur, rester ici signifie notre &quot;
-&quot;mort ou pire encore. Les loyalistes sont d&#233;sormais pr&#233;venus de notre &quot;
-&quot;pr&#233;sence et n'auront de cesse de prendre Knalga et nos vies avec.&quot;
+&quot;Si vous me permettez, monseigneur, rester ici signifie mourir, voire pire &quot;
+&quot;encore. Les loyalistes sont d&#233;sormais conscients de notre pr&#233;sence et &quot;
+&quot;n'auront de cesse de prendre Knalga, et nos vies avec.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:348
@@ -9073,9 +9113,9 @@
 &quot;if what you say is true, there are humans who still oppose them in the &quot;
 &quot;northlands, right?&quot;
 msgstr &quot;&quot;
-&quot;C'est assez vrai. Ils ont fait de m&#234;me dans notre vall&#233;e. Mais, en tout cas, &quot;
-&quot;si ce que vous dites est vrai il y aurait des humains qui s'oppose d&#233;j&#224; &#224; &quot;
-&quot;eux dans le nord, exact&#160;?&quot;
+&quot;C'est assez exact. Ils ont agit de m&#234;me dans notre vall&#233;e d'origine. Mais, &quot;
+&quot;dans tous les cas, si ce que vous dites est vrai, il y aurait des humains &quot;
+&quot;qui s'opposent d&#233;j&#224; &#224; eux dans le nord, non&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:349
@@ -9086,11 +9126,11 @@
 &quot;technology, there is no possibility that the less-advanced outsiders manage &quot;
 &quot;to do it.&quot;
 msgstr &quot;&quot;
-&quot;Affirmatif, bien que je n'aie aucun espoir de les voir gagner dans une &quot;
-&quot;guerre r&#233;elle contre l'Empire du Chaos. Il y a beaucoup de combattant &quot;
-&quot;habill&#233;s et &#233;quip&#233; de leur c&#244;t&#233; mais ce ne sera jamais assez. Si nous, les &quot;
-&quot;nains, avec notre technologie &#224; la pointe du progr&#232;s, n'y arrivons pas, il &quot;
-&quot;n'y a aucune possibilit&#233; que des technologies moins avanc&#233;es y parviennent.&quot;
+&quot;Absolument, m&#234;me si je n'ai aucun espoir de les voir gagner dans une guerre &quot;
+&quot;contre l'Empire du Chaos. Il y a beaucoup de combattant dou&#233;s et &quot;
+&quot;intelligents de leur c&#244;t&#233;, mais ce ne sera jamais assez. Si nous, les nains, &quot;
+&quot;avec notre technologie la plus avanc&#233;e, nous n'y arrivons pas, il est &quot;
+&quot;impossible que des technologies moins avanc&#233;es y parviennent.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:350
@@ -9098,7 +9138,7 @@
 &quot;Not alone, at least. I mean, what if we can contact them and build a &quot;
 &quot;stronger army, of dwarves, elves, and humans, to defeat the Empire?&quot;
 msgstr &quot;&quot;
-&quot;Pas seuls tout au moins. Je me demande, que se passerait il si nous les &quot;
+&quot;Pas seuls tout au moins. Je me demande ce qui se passerait si nous les &quot;
 &quot;contactions et formions une arm&#233;e plus puissante, nains, elfes et humains &quot;
 &quot;r&#233;unis pour combattre l'Empire&#160;?&quot;
 
@@ -9108,8 +9148,8 @@
 &quot;That is far from possible. Dwarves, Elves and Humans have never allied under &quot;
 &quot;a single banner. Never.&quot;
 msgstr &quot;&quot;
-&quot;C'est loin d'&#234;tre envisageable. Nains, elfes et humains ne se sont jamais &quot;
-&quot;ralli&#233;s sous la m&#234;me banni&#232;re. Jamais.&quot;
+&quot;C'est difficilement envisageable. Les Nains, les elfes et les humains ne se &quot;
+&quot;sont jamais ralli&#233;s sous la m&#234;me banni&#232;re. Jamais.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:352
@@ -9121,15 +9161,14 @@
 msgstr &quot;&quot;
 &quot;C'est vrai, mais r&#233;fl&#233;chissez une minute. Nains et elfes, ici, sont alli&#233;s &quot;
 &quot;pour une simple raison. Si c'est possible maintenant, pourquoi pas avec les &quot;
-&quot;humains &#233;galement&#160;? Les temps ont chang&#233; ainsi que nos priorit&#233;s. Nous &quot;
+&quot;humains &#233;galement&#160;? Les temps ont chang&#233;, tout comme nos priorit&#233;s. Nous &quot;
 &quot;n'aurons jamais la paix, ou du temps pour nos guerres intestines, si nous ne &quot;
 &quot;stoppons pas cette menace tr&#232;s bient&#244;t.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:353
 msgid &quot;Well then, so your idea is that we escape to the Northlands?&quot;
-msgstr &quot;&quot;
-&quot;Bien, bien, ainsi votre id&#233;e est que nous fuyions vers les Terres du Nord&#160;?&quot;
+msgstr &quot;Bien, bien, vous sugg&#233;rez donc de fuir vers les Terres du Nord&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:354
@@ -9137,9 +9176,9 @@
 &quot;Yes. Elves can go to look for help from the midlands, and you dwarves can &quot;
 &quot;explore the hills and mountains, to stablish a new home if necessary.&quot;
 msgstr &quot;&quot;
-&quot;Oui. les elfes peuvent aller chercher de l'aide dans les Basses Terres et &quot;
-&quot;vous, les nains, pouvez explorer les collines et les montagnes pour &#233;tablir &quot;
-&quot;de nouvelles demeures si n&#233;cessaire.&quot;
+&quot;Oui. Des elfes peuvent aller chercher de l'aide dans les Milandes et vous, &quot;
+&quot;les nains, pouvez explorer les collines et les montagnes pour &#233;tablir de &quot;
+&quot;nouvelles demeures si n&#233;cessaire.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:355
@@ -9148,7 +9187,7 @@
 &quot;us? We need a distraction, a decoy.&quot;
 msgstr &quot;&quot;
 &quot;Je comprends, mais, comment allons-nous nous assurer que les d&#233;mons ne nous &quot;
-&quot;suivent pas&#160;? Nous avons besoin de les distraire, d'un leurre.&quot;
+&quot;suivent pas&#160;? Nous avons besoin de les distraire, avec un leurre.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:356
@@ -9157,13 +9196,12 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:357
-#, fuzzy
 msgid &quot;&quot;
 &quot;What? But Anlind&#235;, you'll be trapped in this castle, to fight them alone. &quot;
 &quot;Odds are you will not get out of here, ever.&quot;
 msgstr &quot;&quot;
-&quot;Quoi&#160;? Mais, Analia, vous seriez prise au pi&#232;ge dans ce ch&#226;teau pour vous &quot;
-&quot;battre seule contre eux. Vos chances de sortir de l&#224; sont nulles.&quot;
+&quot;Quoi&#160;? Mais, Anlind&#235;, vous serez prise au pi&#232;ge dans ce ch&#226;teau et les &quot;
+&quot;combattrez toute seule. Vos chances de sortir de l&#224; sont nulles.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:358
@@ -9186,7 +9224,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:359
 msgid &quot;I see then, that I cannot convince you of the opposite.&quot;
-msgstr &quot;Je vois que je ne pourrais pas te convaincre du contraire.&quot;
+msgstr &quot;Je vois que je ne pourrais pas vous convaincre du contraire.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:360
@@ -9234,8 +9272,8 @@
 &quot;You are really brave. Surprising, for an Elvish lady. I think I have &quot;
 &quot;underestimated the elven lores then.&quot;
 msgstr &quot;&quot;
-&quot;Vous &#234;tes vraiment courageuse. Surprenant pour une Dame elfe. Je pense que &quot;
-&quot;j'ai sous-estim&#233; les l&#233;gendes elfes.&quot;
+&quot;Vous &#234;tes vraiment courageuse. Surprenant pour une dame elfe. Je pense que &quot;
+&quot;j'ai sous-estim&#233; leurs exploits.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:364
@@ -9243,9 +9281,9 @@
 &quot;In that case, I'll put some of my minions to aid you. And I wish you the &quot;
 &quot;best of lucks, may your soul rest in peace when all this is over.&quot;
 msgstr &quot;&quot;
-&quot;Dans ce cas, je vous laisse quelques uns de mes mignons pour vous aider. Et &quot;
-&quot;je vous souhaite bonne chance. Puisse votre &#226;me reposer en paix quand tout &quot;
-&quot;cela sera termin&#233;.&quot;
+&quot;Dans ce cas, je laisse quelques-uns de mes mignons vous aider. Et je vous &quot;
+&quot;souhaite bonne chance. Puisse votre &#226;me reposer en paix quand tout cela sera &quot;
+&quot;termin&#233;.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:365
@@ -9254,7 +9292,7 @@
 &quot;that I'll not rest until the last of those fiends is turned to ashes in the &quot;
 &quot;ground.&quot;
 msgstr &quot;&quot;
-&quot;Cela m'attriste de voir ce qu'il doit advenir pour que notre peuple survive. &quot;
+&quot;Cela m'attriste de voir ce qui doit arriver pour la survie de notre peuple. &quot;
 &quot;Je jure de ne pas prendre de repos tant que le dernier d&#233;mon ne sera pas &quot;
 &quot;retourn&#233;, en cendres, &#224; la terre.&quot;
 
@@ -9294,23 +9332,23 @@
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:416
 msgid &quot;Apologies, my lord. I could not...&quot;
-msgstr &quot;Mes excuses, Monsieur. Je ne pourrais...&quot;
+msgstr &quot;Mes excuses, messire. Je ne pourrais...&quot;
 
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:427
 msgid &quot;You may crush my corpse, but my brethren's hearts will stand!&quot;
 msgstr &quot;&quot;
-&quot;Vous pouvez broyer mon corps mais le coeur de mes fr&#232;res restera vaillant.&quot;
+&quot;Vous pouvez broyer mon corps, mais le c&#339;ur de mes fr&#232;res restera vaillant.&quot;
 
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:438
 msgid &quot;A curse upon you, heretics!&quot;
-msgstr &quot;Soyez maudis, h&#233;r&#233;tiques&#160;!&quot;
+msgstr &quot;Soyez maudits, h&#233;r&#233;tiques&#160;!&quot;
 
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:449
 msgid &quot;May Yechnagoth swallow your souls!&quot;
-msgstr &quot;Que Yechnagoth engloutisse vos &#226;mes.&quot;
+msgstr &quot;Que Yechnagoth engloutisse vos &#226;mes&#160;!&quot;
 
 #. [message]: speaker=second_unit
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:453
@@ -9349,11 +9387,13 @@
 &quot;I never thought such a pretty and innocent-looking faerie could have that &quot;
 &quot;mastery and skill at fighting.&quot;
 msgstr &quot;&quot;
+&quot;Je n'aurais jamais pens&#233; qu'une f&#233;e si gracieuse &#224; l'air innocent pourrait &quot;
+&quot;se battre aussi bien.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/11_Strike_on_New_Knalga.cfg:507
 msgid &quot;Neither did I. We obviously underestimated the girl.&quot;
-msgstr &quot;&quot;
+msgstr &quot;Moi non plus. Nous avons manifestement sous-estim&#233; la fille.&quot;
 
 #. [scenario]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:4
@@ -9386,8 +9426,8 @@
 &quot;The exit is to the north. It has been a long time, though, since the last on &quot;
 &quot;which this caves were explored.&quot;
 msgstr &quot;&quot;
-&quot;La sortie est vers le nord. Cela fait longtemps depuis la derni&#232;re fois que &quot;
-&quot;ces caves ont &#233;t&#233; explor&#233;es.&quot;
+&quot;La sortie est vers le nord. Mais &#231;a fait longtemps que ces galeries n'ont &quot;
+&quot;pas &#233;t&#233; explor&#233;es.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:162
@@ -9395,31 +9435,30 @@
 &quot;You mean that we cannot be sure what awaits in our path? We have got quite &quot;
 &quot;accustomed to that.&quot;
 msgstr &quot;&quot;
-&quot;Vous voulez dire que nous ne pouvons pas &#234;tre certains de ce qui se passera &quot;
-&quot;sur le chemin&#160;? Nous avons quelque habitude de cet &#233;tat.&quot;
+&quot;Vous voulez dire que nous ne pouvons pas &#234;tre certains de ce qui nous attend &quot;
+&quot;en chemin&#160;? Nous commen&#231;ons &#224; en avoir l'habitude.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:163
-#, fuzzy
 msgid &quot;&quot;
 &quot;We must make haste. We cannot be sure during how much time Anlind&#235; will be &quot;
 &quot;able to distract our enemies. I just hope that her sacrifice is not in vain.&quot;
 msgstr &quot;&quot;
-&quot;Nous devons faire vite. Nous ne pouvons pas savoir durant combien de temps &quot;
-&quot;Analia sera capable de distraire nos ennemis. J'esp&#232;re juste que son &quot;
-&quot;sacrifice ne soit pas vain.&quot;
+&quot;Nous devons faire vite. Nous ne pouvons pas savoir combien de temps Anlind&#235; &quot;
+&quot;sera capable de distraire nos ennemis. J'esp&#232;re seulement que son sacrifice &quot;
+&quot;ne sera pas inutile.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:164
 msgid &quot;We shall make sure it is not. Now, let's go.&quot;
-msgstr &quot;Nous pouvons &#234;tre s&#251;r qu'il ne le sera pas. Maintenant, allons-y.&quot;
+msgstr &quot;Nous devons nous assurer qu'il ne le sera pas. Maintenant, allons-y.&quot;
 
 #. [event]
 #. [unit]: race=monster
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:183
 #: Invasion_from_the_Unknown/units/monsters/Mother_Mudcrawler.cfg:5
 msgid &quot;Mother Mudcrawler&quot;
-msgstr &quot;Colosse de boue&quot;
+msgstr &quot;G&#233;nitrice de colosses de boue&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:184
@@ -9432,7 +9471,7 @@
 #. [message]: description=Mother Mudcrawler
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:191
 msgid &quot;Groaaaar!!&quot;
-msgstr &quot;Groaaaar!!&quot;
+msgstr &quot;Groaaaar&#160;!!&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:193
@@ -9442,7 +9481,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:194
 msgid &quot;I was not aware of this kind of things roaming about this zone.&quot;
-msgstr &quot;Je n'avais pas connaissance de cette sorte de chose errant par ici.&quot;
+msgstr &quot;Je ne savais qu'il y avait ce genre de chose par ici.&quot;
 
 #. [unit]: type=Troll Warrior, description=Karshas
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:229
@@ -9465,17 +9504,17 @@
 &quot;Damned creatures, you slaughtered our children and women! You'll pay with &quot;
 &quot;your blood!&quot;
 msgstr &quot;&quot;
-&quot;Maudites cr&#233;atures, vous avez massacr&#233; nos femmes et nos enfants&#160;! Vous &quot;
+&quot;Maudites cr&#233;atures, vous avez massacr&#233; nos femmes et nos enfants&#160;! Vous le &quot;
 &quot;paierez de votre sang&#160;!&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:258
 msgid &quot;Not if we crush you to dirt first. Attack, underlings!&quot;
-msgstr &quot;Pas si nous vous r&#233;duisons en poussi&#232;re avant. &#192; l'attaque les gars&#160;!&quot;
+msgstr &quot;&quot;
+&quot;Pas si nous vous r&#233;duisons en poussi&#232;re avant. &#192; l'attaque, mis&#233;rables&#160;!&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:259
-#, fuzzy
 msgid &quot;&quot;
 &quot;Hey, hey, what do we have here? Da elfses and dwarfses are trying to escape &quot;
 &quot;thru da backdoor!&quot;
@@ -9485,14 +9524,12 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:261
-#, fuzzy
 msgid &quot;&quot;
 &quot;They are tough rats, but we can deal with them. The assault chieftain will &quot;
 &quot;be really pleased to see their heads impaled in our banners.&quot;
 msgstr &quot;&quot;
-&quot;Ce sont des rats costauds mais on peut leur faire leur affaire. Le &quot;
-&quot;commandant en chef sera content de voir leurs t&#234;tes empal&#233;es sur nos &quot;
-&quot;banni&#232;res.&quot;
+&quot;Ce sont des rats costauds, mais on peut leur faire leur affaire. Le &quot;
+&quot;commandant en chef sera ravi de voir leurs t&#234;tes empal&#233;es sur nos &#233;tendards.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:262
@@ -9512,7 +9549,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:280
 msgid &quot;Defeated... by rats!&quot;
-msgstr &quot;Vaincus&#160;? Par des rats&#160;?&quot;
+msgstr &quot;Vaincu...&#160;par des rats&#160;!&quot;
 
 #. [message]: type=Goliath
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:320
@@ -9527,7 +9564,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:323
 msgid &quot;This starts to be more difficult than it was supposed to be.&quot;
-msgstr &quot;&#199;a commence &#224; &#234;tre plus difficile que c'&#233;tait suppos&#233;.&quot;
+msgstr &quot;&#199;a commence &#224; &#234;tre plus difficile que pr&#233;vu.&quot;
 
 #. [objectives]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:326
@@ -9652,7 +9689,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:431
 msgid &quot;Ugh, it is drooling, and it stinks.&quot;
-msgstr &quot;&quot;
+msgstr &quot;Beurk, &#231;a bave et &#231;a pue.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:432
@@ -9667,17 +9704,17 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:449
 msgid &quot;How could I fail? Forgive me, Master...&quot;
-msgstr &quot;Comment ais je pu faillir&#160;? Pardonnez moi, Ma&#238;tre...&quot;
+msgstr &quot;Comment ai-je pu faillir&#160;? Pardonnez-moi, ma&#238;tre...&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:450
 msgid &quot;Its body tears apart and dissolves into slime!&quot;
-msgstr &quot;Les larmes de son corps se transforment en bave.&quot;
+msgstr &quot;Son corps se morcelle et se transforme en g&#233;latine !&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:451
 msgid &quot;Disgusting... I feel like vomiting.&quot;
-msgstr &quot;D&#233;go&#251;tant... je me sens naus&#233;eux.&quot;
+msgstr &quot;D&#233;go&#251;tant... j'ai envie de vomir.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:452
@@ -9694,12 +9731,12 @@
 &quot;will report of our position to their leaders!&quot;
 msgstr &quot;&quot;
 &quot;Attendez, nous devons vaincre ces b&#234;tes qui nous poursuivent sinon elles &quot;
-&quot;rapporteront notre position &#224; leur chef.&quot;
+&quot;r&#233;v&#232;leront notre position &#224; leurs chefs.&quot;
 
 #. [message]: speaker=unit
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:511
 msgid &quot;The outsides. This way it is, people!&quot;
-msgstr &quot;L'ext&#233;rieur. Voici la sortie, mes amis&#160;!&quot;
+msgstr &quot;L'ext&#233;rieur. Voici la sortie, les gars&#160;!&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:522
@@ -9707,8 +9744,8 @@
 &quot;Oh no, their main assault force has found us! Anlind&#235;, I am sorry. We have &quot;
 &quot;failed.&quot;
 msgstr &quot;&quot;
-&quot;Oh non, leur principal groupe d'assaut nous a trouv&#233;&#160;! D&#233;sol&#233;, Anlind&#235;. Nous &quot;
-&quot;avons &#233;chou&#233;.&quot;
+&quot;Oh non, leur principal groupe d'assaut nous a trouv&#233;s&#160;! D&#233;sol&#233;, Anlind&#235;. &quot;
+&quot;Nous avons &#233;chou&#233;.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/12_The_Escape.cfg:529
@@ -9853,12 +9890,12 @@
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/13_Face_your_Fate.cfg:324
-#, fuzzy
 msgid &quot;&quot;
 &quot;The commander, at last! Come and fight with me, fiendish one! This place &quot;
 &quot;shall be your grave!&quot;
 msgstr &quot;&quot;
-&quot;Le commandeur, enfin&#160;! Viens te battre avec moi&#160;! Ici sera ton s&#233;pulcre&#160;!&quot;
+&quot;Le commandeur, enfin&#160;! Viens te battre avec moi, esp&#232;ce de d&#233;mon&#160;! Cet &quot;
+&quot;endroit sera ton tombeau&#160;!&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/13_Face_your_Fate.cfg:325
@@ -9871,16 +9908,15 @@
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/13_Face_your_Fate.cfg:326
-#, fuzzy
 msgid &quot;&quot;
 &quot;I can read your mind, so I know where your friends are. Your little &quot;
 &quot;sacrifice won't stop the wrath of the Shadow Master for trying to fool him! &quot;
 &quot;We'll find them all, and your pitiful efforts will have been wasted in vain.&quot;
 msgstr &quot;&quot;
 &quot;Je peux lire dans ton esprit, je sais o&#249; sont tes amis. Ton minable &quot;
-&quot;sacrifice n'arr&#234;tera pas l'&#339;uvre du fant&#244;me du Ma&#238;tre de l'Ombre pour le &quot;
-&quot;rendre fou. Nous les retrouverons tous et tes mis&#233;rables efforts seront &quot;
-&quot;balay&#233;s.&quot;
+&quot;sacrifice n'arr&#234;tera pas la col&#232;re du Ma&#238;tre de l'Ombre, qui n'aime pas &quot;
+&quot;qu'on le prenne pour un idiot. Nous les retrouverons tous et tes mis&#233;rables &quot;
+&quot;efforts auront &#233;t&#233; vains.&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/13_Face_your_Fate.cfg:327
@@ -9901,8 +9937,8 @@
 #: Invasion_from_the_Unknown/scenarios/13_Face_your_Fate.cfg:365
 msgid &quot;Your mundane weapons or spells are not enough to destroy me.&quot;
 msgstr &quot;&quot;
-&quot;Je suis immortel&#160;: ni des armes quelconques, ni des incantations ne peuvent &quot;
-&quot;me d&#233;truire.&quot;
+&quot;Je suis immortel&#160;: ni des armes banales, ni des incantations ne peuvent me &quot;
+&quot;d&#233;truire.&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/13_Face_your_Fate.cfg:366
@@ -9914,7 +9950,7 @@
 msgid &quot;&quot;
 &quot;Ha, ha, I don't think you are ever going to have time for that before I kill &quot;
 &quot;you!&quot;
-msgstr &quot;Ha ha, je ne pense pas que tu en aura le temps, je te tuerai avant !&quot;
+msgstr &quot;Ha ha, je ne pense pas que tu en auras le temps, je te tuerai avant !&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/13_Face_your_Fate.cfg:368
@@ -9927,15 +9963,14 @@
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/13_Face_your_Fate.cfg:381
-#, fuzzy
 msgid &quot;&quot;
 &quot;This is a real proof that Mal Keshar has no power against these fiends. I &quot;
 &quot;must get rid of this mysterious masked face somehow, or they will be lost &quot;
 &quot;against it!&quot;
 msgstr &quot;&quot;
-&quot;C'est la preuve &#233;vidente que Mal Keshar n'a aucun pouvoir contre ces d&#233;mons. &quot;
-&quot;Je dois me d&#233;barrasser de ce myst&#233;rieux visage masqu&#233; d'une fa&#231;on ou d'une &quot;
-&quot;autre, ou ils seront perdus face &#224; lui.&quot;
+&quot;Cela prouve de toute &#233;vidente que Mal Keshar n'a aucun pouvoir contre ces &quot;
+&quot;d&#233;mons. Je dois me d&#233;barrasser de ce myst&#233;rieux visage masqu&#233; d'une fa&#231;on ou &quot;
+&quot;d'une autre, ou ils seront perdus contre lui !&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/13_Face_your_Fate.cfg:402
@@ -9945,7 +9980,7 @@
 #. [else]
 #: Invasion_from_the_Unknown/scenarios/13_Face_your_Fate.cfg:406
 msgid &quot;Now, what part do you want to see teared apart first?&quot;
-msgstr &quot;Maintenant qu'elle partie de ton corps veux tu que je t'arrache&#160;?&quot;
+msgstr &quot;Maintenant, quelle partie veux-tu d'abord voir d&#233;chir&#233;e&#160;?&quot;
 
 #. [else]
 #: Invasion_from_the_Unknown/scenarios/13_Face_your_Fate.cfg:407
@@ -9975,12 +10010,12 @@
 #. [else]
 #: Invasion_from_the_Unknown/scenarios/13_Face_your_Fate.cfg:421
 msgid &quot;Death will take us all now...&quot;
-msgstr &quot;Maintenant la mort va nous prendre tous.&quot;
+msgstr &quot;Maintenant, la mort va nous prendre, tous...&quot;
 
 #. [else]
 #: Invasion_from_the_Unknown/scenarios/13_Face_your_Fate.cfg:440
 msgid &quot;And so it ended.&quot;
-msgstr &quot;Ainsi cela finit il.&quot;
+msgstr &quot;C'est ainsi que cela finit.&quot;
 
 #. [option]: speaker=narrator
 #: Invasion_from_the_Unknown/scenarios/13x_Inter.cfg:128
@@ -9995,7 +10030,7 @@
 #. [scenario]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:4
 msgid &quot;Bye and Behold&quot;
-msgstr &quot;Regard en arri&#232;re&quot;
+msgstr &quot;Pars et observe&quot;
 
 #. [side]: description=Grilock, type=Saurian Flanker
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:70
@@ -10013,9 +10048,9 @@
 &quot;Now, what do you want us to do, master Galas? We have definitively lost our &quot;
 &quot;home, as you had before, at the hands of those fiends.&quot;
 msgstr &quot;&quot;
-&quot;Maintenant, que voulez vous que nous fassions, ma&#238;tre Galas&#160;? Nous avons &quot;
-&quot;d&#233;finitivement perdu notre foyer, tout comme vous, par la faute des ces &quot;
-&quot;ennemis.&quot;
+&quot;Maintenant, que voulez-vous que nous fassions, ma&#238;tre Galas&#160;? Nous avons &quot;
+&quot;d&#233;finitivement perdu notre foyer, tout comme vous par le pass&#233;. Il est entre &quot;
+&quot;les mains de ces d&#233;mons.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:288
@@ -10023,9 +10058,8 @@
 &quot;(sighs) I know, and I feel guilty, as I guess they would never have raided &quot;
 &quot;Knalga if it was not for pursuing us. I am deeply sorry about that.&quot;
 msgstr &quot;&quot;
-&quot;(soupir) Je sais et je me sens coupable, je pense qu'ils n'auraient jamais &quot;
-&quot;envahi Knalga si ce n'&#233;tait pour nous poursuivre. Je suis terriblement &quot;
-&quot;d&#233;sol&#233; pour cela.&quot;
+&quot;(soupir) Je sais et je me sens coupable&#160;; ils n'auraient jamais envahi &quot;
+&quot;Knalga si ce n'&#233;tait pour nous poursuivre. J'en suis terriblement d&#233;sol&#233;.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:289
@@ -10035,9 +10069,9 @@
 &quot;invasion, and would have perished in there; all our race exterminated in a &quot;
 &quot;few days.&quot;
 msgstr &quot;&quot;
-&quot;Ne soyez pas d&#233;sol&#233; de ce qui serait arriv&#233; t&#244;t ou tard. Si vous ne nous &quot;
-&quot;aviez pas pr&#233;venu de l'imminence de la menace, nous n'aurions pas &#233;t&#233; &quot;
-&quot;pr&#233;par&#233; &#224; l'invasion et aurions p&#233;ri l&#224; bas. Toute notre race extermin&#233;e en &quot;
+&quot;Ne soyez pas d&#233;sol&#233;, cela serait arriv&#233; t&#244;t ou tard. Si vous ne nous aviez &quot;
+&quot;pas pr&#233;venus de l'imminence de la menace, nous n'aurions pas &#233;t&#233; pr&#233;par&#233;s &#224; &quot;
+&quot;l'invasion et aurions p&#233;ri l&#224;-bas. Toute notre race aurait &#233;t&#233; extermin&#233;e en &quot;
 &quot;quelques jours.&quot;
 
 #. [event]
@@ -10047,9 +10081,9 @@
 &quot;us the cruel reality of the surface world, something that we were mostly &quot;
 &quot;unaware all this time.&quot;
 msgstr &quot;&quot;
-&quot;C'est vrai. Votre promenade nous a fait plus de bien que de mal, Galas. Je &quot;
-&quot;pense qu'elle nous a montr&#233; la cruelle r&#233;alit&#233; du monde de la surface, &quot;
-&quot;quelque chose dont nous &#233;tions totalement ignorants durant tout ce temps.&quot;
+&quot;C'est vrai. Votre errance nous a fait plus de bien que de mal, Galas. Elle &quot;
+&quot;nous a montr&#233; la cruelle r&#233;alit&#233; du monde de la surface, dont nous &#233;tions &quot;
+&quot;totalement ignorants durant tout ce temps.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:291
@@ -10085,8 +10119,8 @@
 &quot;So be it. Farewell, lord of the Elves of the forests, we shall remember you. &quot;
 &quot;May our paths meet again in better times.&quot;
 msgstr &quot;&quot;
-&quot;Ainsi soit il. Adieu, Commandant des elfes sylvains, nous nous souviendrons &quot;
-&quot;de vous. Puissent nos chemins se croiser de nouveau en de meilleurs jours.&quot;
+&quot;Ainsi soit-il. Adieu, commandant des elfes sylvains, nous nous souviendrons &quot;
+&quot;de vous. Puissent nos chemins se croiser de nouveau, en de meilleurs jours.&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:314
@@ -10096,11 +10130,11 @@
 &quot;crafting weaponry or armors because of its difficult extraction and forging. &quot;
 &quot;I am sure it will be really necessary at some point in the future.&quot;
 msgstr &quot;&quot;
-&quot;Pour vous montrer notre gratitude, j'ai fabriqu&#233; cette armure e cha&#238;nes, &quot;
-&quot;l&#233;g&#232;re et robuste, pour Gala. Elle est faite d'un m&#233;tal particulier qui est &quot;
+&quot;Pour vous prouver notre gratitude, j'ai fabriqu&#233; cette cotte de mailles, &quot;
+&quot;l&#233;g&#232;re et robuste, pour Galas. Elle est faite d'un m&#233;tal particulier &quot;
 &quot;rarement utilis&#233; pour fabriquer des armes et des armures &#224; cause des &quot;
 &quot;difficult&#233;s pour l'extraire et le forger. Je suis certain qu'elle vous sera &quot;
-&quot;n&#233;cessaire &#224; un moment ou un autre dans le futur.&quot;
+&quot;n&#233;cessaire &#224; un moment ou un autre.&quot;
 
 #. [object]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:322
@@ -10131,9 +10165,9 @@
 &quot;when fighting at close range. Those fiends don't seem to have good &quot;
 &quot;blacksmiths to forge more effective weapons or armor for them.&quot;
 msgstr &quot;&quot;
-&quot;Merci, ma&#238;tre des nains. elle m'aidera certainement, dussais je &#234;tre en &quot;
-&quot;danger lors de combats rapproch&#233;s. Nos adversaires ne semblent pas avoir de &quot;
-&quot;bons forgerons pour leur ex&#233;cuter des armes plus efficaces ou des armures.&quot;
+&quot;Merci, ma&#238;tre des nains. Elle m'aidera certainement en cas de danger lors de &quot;
+&quot;combats rapproch&#233;s. Nos adversaires ne semblent pas avoir de bons forgerons &quot;
+&quot;pour leur fabriquer des armes ou des armures de meilleure qualit&#233;.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:345
@@ -10141,8 +10175,8 @@
 &quot;Farewell Elynia, I wish I had more time to learn more of your people and &quot;
 &quot;your magical skills.&quot;
 msgstr &quot;&quot;
-&quot;Adieu, Elynia, je souhaite que j'aurai assez de temps pour en apprendre plus &quot;
-&quot;sur votre peuple et vos dons pour la magie.&quot;
+&quot;Adieu, Elynia, j'aurais aim&#233; avoir assez de temps pour en apprendre plus sur &quot;
+&quot;votre peuple et sur vos dons de magicienne.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:346
@@ -10164,7 +10198,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:366
 msgid &quot;Yes, my lady. That is the best plan I could make up.&quot;
-msgstr &quot;Oui, ma dame. C'est le meilleur plan que je puisse concevoir.&quot;
+msgstr &quot;Oui, madame. C'est le meilleur plan que je puisse concevoir.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:367
@@ -10177,12 +10211,12 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:368
-#, fuzzy
 msgid &quot;&quot;
 &quot;I don't think they'll like my presence, let alone our companions... my &quot;
 &quot;companions... you know.&quot;
 msgstr &quot;&quot;
-&quot;Je ne pense pas qu'ils appr&#233;cient ma pr&#233;sence, laissons donc nos compagnons.&quot;
+&quot;Je ne pense pas qu'ils appr&#233;cient ma pr&#233;sence, laissons donc seuls nos &quot;
+&quot;compagnons... mes compagnons... vous avez compris.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:369
@@ -10231,6 +10265,8 @@
 &quot;Elves? And refugees, you say. Elves, indeed. Creatures that don't exist but &quot;
 &quot;in old tales of the past times.&quot;
 msgstr &quot;&quot;
+&quot;Des elfes ? Et des r&#233;fugi&#233;s, vous dites. Des elfes, vraiment. Des cr&#233;atures &quot;
+&quot;qui n'existent que dans les vieilles l&#233;gendes du pass&#233;.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:415
@@ -10309,6 +10345,8 @@
 &quot;The demons. The loyalists. The damned Empire of Chaos and all the usurpers &quot;
 &quot;of the former glory of Wesnoth!&quot;
 msgstr &quot;&quot;
+&quot;Les d&#233;mons. Les loyalistes. Ce maudit Empire du Chaos et tous ces &quot;
+&quot;usurpateurs de l'ancienne gloire de Wesnoth !&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:428
@@ -10316,6 +10354,9 @@
 &quot;You escape from those fiends, then. Funny thing, necromancers always rush &quot;
 &quot;away, as cowards, when they stumble on a stronger opponent.&quot;
 msgstr &quot;&quot;
+&quot;Vous avez donc &#233;chapp&#233; &#224; ces d&#233;mons. Chose amusante, les n&#233;cromanciens &quot;
+&quot;fuient toujours comme des l&#226;ches quand ils tombent sur un adversaire plus &quot;
+&quot;fort qu'eux.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:429
@@ -10348,6 +10389,8 @@
 &quot;Shelter? Uh... only the Grand Council can decide whether to allow you to &quot;
 &quot;live in our country or not.&quot;
 msgstr &quot;&quot;
+&quot;Un refuge ? Oh... seul le Grand Conseil peut vous autoriser &#224; vivre chez &quot;
+&quot;nous.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:434
@@ -10355,10 +10398,11 @@
 &quot;If you cannot grant us shelter, at least we need your help in our fight &quot;
 &quot;against this common enemy.&quot;
 msgstr &quot;&quot;
+&quot;Si vous ne pouvez pas nous accorder un refuge, nous avons au moins besoin de &quot;
+&quot;votre aide pour combattre cet ennemi commun.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:435
-#, fuzzy
 msgid &quot;&quot;
 &quot;The Empire of Chaos is a real nuissance for us, but it is not enough reason &quot;
 &quot;to start an actual war, which seems to be what you suggest. We have resisted &quot;
@@ -10366,10 +10410,11 @@
 &quot;an ultimatum strike when we are not and will never be in favorable &quot;
 &quot;conditions?&quot;
 msgstr &quot;&quot;
-&quot;Stupide en effet. C'est une r&#233;elle nuisance pour nous que ce Ma&#238;tre de &quot;
-&quot;l'Ombre, mais nous n'avons nulle raison de d&#233;buter une guerre actuellement. &quot;
-&quot;Nous avons r&#233;sist&#233; &#224; ces attaques durant toutes ces ann&#233;es, pourquoi &quot;
-&quot;voudrions nous cesser de faire ainsi et de lui porter un coup d&#233;terminant.&quot;
+&quot;L'Empire du Chaos est une r&#233;elle nuisance pour nous, mais nous n'avons nulle &quot;
+&quot;raison de d&#233;buter une guerre, si c'est ce que vous sugg&#233;rez. Nous avons &quot;
+&quot;r&#233;sist&#233; &#224; leurs attaques durant toutes ces ann&#233;es, pourquoi ne pas continuer &quot;
+&quot;au lieu d'envoyer un ultimatum alors que nous ne sommes pas en mesure de le &quot;
+&quot;faire ?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:436
@@ -10387,15 +10432,14 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:437
-#, fuzzy
 msgid &quot;&quot;
 &quot;Wise words. Very wise, indeed. But who are you anyway? Or, more &quot;
 &quot;specifically, what are you? You look like one of those treacherous faeries. &quot;
 &quot;They like to trick our people to satisfy their whimsical demands.&quot;
 msgstr &quot;&quot;
-&quot;Jolis mots, effectivement. Mais qui &#234;tes-vous&#160;? Vous ressemblez &#224; une de ces &quot;
-&quot;f&#233;es tra&#238;tresses. Elles aiment pousser le peuple &#224; satisfaire leurs demandes &quot;
-&quot;le plus incongrues.&quot;
+&quot;Sages propos. Tr&#232;s avis&#233;s, effectivement. Mais qui &#234;tes-vous, en fait&#160;? Ou, &quot;
+&quot;plus pr&#233;cis&#233;ment, qu'&#234;tes-vous ? Vous ressemblez &#224; une de ces f&#233;es &quot;
+&quot;tra&#238;tresses. Elles aiment embobiner les gens pour satisfaire leurs caprices.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:438
@@ -10403,8 +10447,8 @@
 &quot;She is Elynia, known by some elves as Eloh, the 'Source of Light' for the &quot;
 &quot;Dwarves, or the Lady of Light, for us, humans.&quot;
 msgstr &quot;&quot;
-&quot;Il s'agit d'Elynia, connue par quelques elfes comme Eloh, la 'Source de &quot;
-&quot;Lumi&#232;re' pour les nains ou la 'Madone de Lumi&#232;re' pour nous, les humains.&quot;
+&quot;Il s'agit d'Elynia, que les elfes appellent &#171;&#160;Eloh&#160;&#187;, les nains la &#171;&#160;Source &quot;
+&quot;de Lumi&#232;re&#160;&#187;, et nous les humains la &#171;&#160;Madone de Lumi&#232;re&#160;&#187;.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:439
@@ -10418,17 +10462,17 @@
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:441
 msgid &quot;Do you trust the words of the speaking skeletal thing now?&quot;
 msgstr &quot;&quot;
-&quot;Vous faites confiance aux paroles de cette esp&#232;ce de squelette, maintenant&#160;?&quot;
+&quot;Vous faites confiance aux paroles de cette esp&#232;ce de squelette, de cette &quot;
+&quot;chose, maintenant&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:442
-#, fuzzy
 msgid &quot;&quot;
 &quot;Oh, no! What kind of plague infests this place, that makes you want to call &quot;
 &quot;me 'thing'?!&quot;
 msgstr &quot;&quot;
-&quot;Oh non&#160;! Quelle sorte de salet&#233; infeste ce lieu, ce qui vous fait m'appeler &quot;
-&quot;&#171;&#160;chose&#160;&#187;&#160;?&quot;
+&quot;Oh non&#160;! Il y a une maladie dans le coin qui vous pousse &#224; m'appeler &quot;
+&quot;&#171;&#160;chose&#160;&#187; sans arr&#234;t&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:443
@@ -10451,17 +10495,17 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:445
-#, fuzzy
 msgid &quot;&quot;
 &quot;No, no, no. Wait: first I must see a proof of reliability. As you said, &quot;
 &quot;you'd help us defeat our enemies. At the moment, these woods are infested &quot;
 &quot;with orcs, invaders who came from the northern steppes. If you can defeat &quot;
 &quot;them, I'll be pleased to arrange the meeting for you.&quot;
 msgstr &quot;&quot;
-&quot;EN tout &#233;tat de causes, j'aimerai voir en vous une preuve de confiance. &quot;
-&quot;Puisque vous avez dit que vous nous aideriez &#224; vaincre nos ennemis. Si vous &quot;
-&quot;parvenez &#224; battre les tribus d'orcs qui rodent alentour de ces bois, je me &quot;
-&quot;ferais un plaisir d'organiser une rencontre pour vous.&quot;
+&quot;Non, non, non. Attendez&#160;: j'aimerai d'abord une preuve pour vous faire &quot;
+&quot;confiance. Vous avez dit que vous nous aideriez &#224; vaincre nos ennemis. En ce &quot;
+&quot;moment, ces bois sont infest&#233;s par des orcs&#160;; ces envahisseurs sont venus &quot;
+&quot;des steppes du nord. Si vous parvenez &#224; les battre, je me ferai un plaisir &quot;
+&quot;d'organiser une r&#233;union pour vous.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:446
@@ -10518,6 +10562,8 @@
 &quot;Are we gonna kill orcs? Oh my, what should I do? I don't want to slay my &quot;
 &quot;kinsmen.&quot;
 msgstr &quot;&quot;
+&quot;Est-ce qu'on va tuer des orcs ? Oh la la, que dois-je faire ? Je ne veux pas &quot;
+&quot;tuer mes semblables.&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/14_Bye_and_Behold.cfg:504
@@ -10832,7 +10878,7 @@
 #. [scenario]
 #: Invasion_from_the_Unknown/scenarios/15_A_Paradoxical_Mission.cfg:303
 msgid &quot;Undead? Wow, what a peril for me.&quot;
-msgstr &quot;Des morts-vivants&#160;? Wouah, je suis mort de trouille.&quot;
+msgstr &quot;Des morts-vivants&#160;? Wouah, j'en tremble.&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/15_A_Paradoxical_Mission.cfg:340
@@ -10983,7 +11029,7 @@
 msgid &quot;&quot;
 &quot;That is no problem. If they dare oppose us I'll do my work with their &quot;
 &quot;corpses!&quot;
-msgstr &quot;&quot;
+msgstr &quot;S'ils osent nous affronter, je ferai mon travail avec leurs cadavres&#160;!&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/15_Paradoxical_Missions/1a_Path_of_Thieves.cfg:271
@@ -11252,13 +11298,12 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/16_Arrival_of_the_Battalion.cfg:219
-#, fuzzy
 msgid &quot;&quot;
 &quot;You happen to say something very similar to what you said when I made my &quot;
 &quot;minions fight for you in the desert, remember?&quot;
 msgstr &quot;&quot;
-&quot;Vous r&#233;p&#233;tez la m&#234;me chose que lorsque mes favoris et moi-m&#234;me avons &quot;
-&quot;combattu pour vous dans le d&#233;sert. Vous vous souvenez&#160;?&quot;
+&quot;Vous r&#233;p&#233;tez ce que vous avez dit lorsque j'ai utilis&#233; mes favoris pour &quot;
+&quot;combattre avec vous dans le d&#233;sert. Vous vous en souvenez&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/16_Arrival_of_the_Battalion.cfg:220
@@ -11291,7 +11336,7 @@
 &quot;mangled body, but I cannot distinguish what creature it pertains to. What &quot;
 &quot;kind of evil magic is this?&quot;
 msgstr &quot;&quot;
-&quot;Eh bien!, au moins ce n'&#233;tait pas immortel. Mais, qu'est-ce que c'est&#160;? J'ai &quot;
+&quot;Eh bien, au moins ce n'&#233;tait pas immortel. Mais, qu'est-ce que c'est&#160;? J'ai &quot;
 &quot;fait un petit trou dans son armure et je peux voir la chair vivante, bien &quot;
 &quot;qu'elle sente comme un cadavre pourri. D'abord on penserait que c'&#233;tait &quot;
 &quot;encore un de ces golems de fer anim&#233;s, mais maintenant &#231;a semble &#234;tre une &quot;
@@ -11312,7 +11357,7 @@
 &quot;mangled body, but I cannot distinguish what creature it pertains to. What &quot;
 &quot;kind of evil magic is this?&quot;
 msgstr &quot;&quot;
-&quot;Eh bien!, au moins ce n'&#233;tait pas immortel. Mais, qu'est-ce que c'est&#160;? J'ai &quot;
+&quot;Eh bien, au moins ce n'&#233;tait pas immortel. Mais, qu'est-ce que c'est&#160;? J'ai &quot;
 &quot;fait un petit trou dans son armure et je peux voir la chair vivante, bien &quot;
 &quot;qu'elle sente comme un cadavre pourri. D'abord on penserait que c'&#233;tait &quot;
 &quot;encore un de ces golems de fer anim&#233;s, mais maintenant &#231;a semble &#234;tre une &quot;
@@ -11361,7 +11406,7 @@
 &quot;The colossal automaton falls off to the floor, making the earth rumble below &quot;
 &quot;him.&quot;
 msgstr &quot;&quot;
-&quot;L'automaton colossal tombe sur le sol, faisant trembler la terre sous lui.&quot;
+&quot;L'automate colossal tombe sur le sol, faisant trembler la terre sous lui.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/16_Arrival_of_the_Battalion.cfg:272
@@ -11402,15 +11447,14 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/16_Arrival_of_the_Battalion.cfg:299
-#, fuzzy
 msgid &quot;&quot;
 &quot;Your boldness has signaled your doom. The Master has sent the entire &quot;
 &quot;Imperial army after you, and there is nothing you can do to stop the process &quot;
 &quot;now!&quot;
 msgstr &quot;&quot;
-&quot;Votre courage a sign&#233; votre perte. Le Ma&#238;tre a envoy&#233; l'arm&#233;e Imp&#233;riale &quot;
-&quot;enti&#232;re contre vous et il n'y a rien vous puissiez faire pour arr&#234;ter le &quot;
-&quot;processus maintenant.&quot;
+&quot;Votre insolence a sign&#233; votre perte. Le Ma&#238;tre a envoy&#233; l'Arm&#233;e Imp&#233;riale &quot;
+&quot;toute enti&#232;re contre vous, et rien ne pourra arr&#234;ter le processus &quot;
+&quot;maintenant&#160;!&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/16_Arrival_of_the_Battalion.cfg:300
@@ -11816,9 +11860,8 @@
 &quot;I finally decide to stay with you, Galas. Your courage has convinced me &quot;
 &quot;enough of how foolish it would be not to follow you in your errand.&quot;
 msgstr &quot;&quot;
-&quot;J'ai finalement d&#233;cid&#233; de rester avec vous, Galas. Votre courage m'a &quot;
-&quot;convaincu suffisamment que ce serait une folie de ne pas vous accompagner &quot;
-&quot;dans votre vagabondage.&quot;
+&quot;J'ai finalement d&#233;cid&#233; de rester avec vous, Galas. Votre courage m'a assez &quot;
+&quot;convaincu qu'il serait fou de ne pas vous accompagner dans votre p&#233;riple.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/17_Dawn_of_the_Great_War.cfg:1044
@@ -11840,16 +11883,14 @@
 &quot;I suppose I can't convince you to let me depart. You may go with us if you &quot;
 &quot;desire to, but be warned that safety is not in our path.&quot;
 msgstr &quot;&quot;
-&quot;Je suppose que je ne pourrait pas vous convaincre de me laisser partir. Vous &quot;
-&quot;pouvez venir avec moi si vous voulez, mais sachez bien que la s&#233;curit&#233; n'est &quot;
-&quot;pas sur notre route.&quot;
+&quot;Je suppose que je ne pourrai pas vous convaincre de me laisser partir. Vous &quot;
+&quot;pouvez venir avec moi si vous voulez, mais sachez bien notre route sera &quot;
+&quot;p&#233;rilleuse.&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/17_Dawn_of_the_Great_War.cfg:1060
 msgid &quot;We know, sir, and we'll face the consequences, should we have to.&quot;
-msgstr &quot;&quot;
-&quot;Nous savons, monsieur, et nous ferons face aux cons&#233;quences, comme nous &quot;
-&quot;l'avons d&#233;j&#224; fait.&quot;
+msgstr &quot;Nous le savons, monsieur, et nous l'assumerons si besoin est.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/17_Dawn_of_the_Great_War.cfg:1065
@@ -11867,24 +11908,24 @@
 msgid &quot;&quot;
 &quot;You are bold on coming to my territory. But, could you resist the temptation?&quot;
 msgstr &quot;&quot;
-&quot;Vous vous enhardissez &#224; p&#233;n&#233;trer sur mon territoire. Pourrez vous r&#233;sister &#224; &quot;
-&quot;la tentation&#160;?&quot;
+&quot;Vous osez p&#233;n&#233;trer sur mon territoire. Mais pourrez-vous r&#233;sister &#224; la &quot;
+&quot;tentation&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/17_Dawn_of_the_Great_War.cfg:1067
 msgid &quot;We'll see... what our fate will be in this quest.&quot;
-msgstr &quot;Nous verrons... ce que le destin nous r&#233;serve dans cette qu&#234;te.&quot;
+msgstr &quot;Nous verrons... ce que sera notre destin durant cette qu&#234;te.&quot;
 
 #. [scenario]
 #: Invasion_from_the_Unknown/scenarios/17_Dawn_of_the_Great_War.cfg:1071
 msgid &quot;Aiyeee!!!&quot;
-msgstr &quot;Aiyeee&#160;!&quot;
+msgstr &quot;A&#239;&#239;eee&#160;!&quot;
 
 #. [scenario]
 #: Invasion_from_the_Unknown/scenarios/17_Dawn_of_the_Great_War.cfg:1072
 msgid &quot;But what was that? I have never seen anything like it before!&quot;
 msgstr &quot;&quot;
-&quot;Mais qu'est-ce que c'&#233;tait&#160;?Je n'ai jamais vu quelque chose comme &#231;a avant.&quot;
+&quot;Mais qu'est-ce que c'&#233;tait&#160;?Je n'ai jamais vu quelque chose comme &#231;a avant&#160;!&quot;
 
 #. [scenario]
 #: Invasion_from_the_Unknown/scenarios/17_Dawn_of_the_Great_War.cfg:1073
@@ -11892,9 +11933,9 @@
 &quot;These new foes seem to have a perilous destructive strength. We ought to &quot;
 &quot;keep at safe distance from them if we can't kill them immediately!&quot;
 msgstr &quot;&quot;
-&quot;Ces nouveaux adversaires semblent avoir une dangereuse force de destruction. &quot;
-&quot;Nous devrions garder nos distances envers eux si nous ne pouvons pas les &quot;
-&quot;tuer imm&#233;diatement!&quot;
+&quot;Ces nouveaux opposants semblent poss&#233;der une dangereuse force destructrice. &quot;
+&quot;Nous devrions garder nos distances si nous ne pouvons pas les tuer &quot;
+&quot;imm&#233;diatement&#160;!&quot;
 
 #. [scenario]
 #: Invasion_from_the_Unknown/scenarios/17_Dawn_of_the_Great_War.cfg:1074
@@ -11902,9 +11943,9 @@
 &quot;Do you see the might of my fiercest creations? Don't you really want to be &quot;
 &quot;able to command them at your own will, to unleash your inner instincts?&quot;
 msgstr &quot;&quot;
-&quot;Vois la force de mes cr&#233;ations les plus f&#233;roces&#160;? Tu ne veux vraiment pas &quot;
-&quot;les commander de ta propre volont&#233; afin de lib&#233;rer tes instincts les plus &quot;
-&quot;bas&#160;?&quot;
+&quot;Tu vois la vigueur de mes cr&#233;ations les plus f&#233;roces&#160;? Tu ne veux vraiment &quot;
+&quot;pas les commander &#224; volont&#233;, afin de lib&#233;rer tes instincts les plus &quot;
+&quot;profonds&#160;?&quot;
 
 #. [objectives]
 #: Invasion_from_the_Unknown/scenarios/18_Armageddon.cfg:123
@@ -11914,7 +11955,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/18_Armageddon.cfg:134
 msgid &quot;Ah, great. Now we are surrounded by these creeps.&quot;
-msgstr &quot;&quot;
+msgstr &quot;Ah, super. Nous voici entour&#233; par ces insectes.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/18_Armageddon.cfg:135
@@ -11922,6 +11963,8 @@
 &quot;According to my calculations, we are about to reach Wesmere's territory. &quot;
 &quot;That might explain why we stumbled upon them.&quot;
 msgstr &quot;&quot;
+&quot;Selon mes calculs, nous sommes sur le point d'atteindre Wesmerer. Cela &quot;
+&quot;pourrait expliquer pourquoi nous sommes tomb&#233;s sur eux.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/18_Armageddon.cfg:136
@@ -11944,7 +11987,7 @@
 &quot;What happens, Galas? Are you hesitating? Kill them, kill your enemies. Feel &quot;
 &quot;the pleasure of their blood in your hands.&quot;
 msgstr &quot;&quot;
-&quot;Que se passe-t-il Galas&#160;? Tu h&#233;sites&#160;? Tue-les, tue tes ennemis. Ressens le &quot;
+&quot;Que se passe-t-il, Galas&#160;? Tu h&#233;sites&#160;? Tue-les, tue tes ennemis. Ressens le &quot;
 &quot;plaisir de leur sang sur tes mains.&quot;
 
 #. [event]
@@ -12018,7 +12061,7 @@
 &quot;We'll see. The Master specially wants to meet you, pitiful fairy, but &quot;
 &quot;nothing will be left of you at the end of this day!&quot;
 msgstr &quot;&quot;
-&quot;Nous verrons bien. Le Ma&#238;tre veut tout particuli&#232;rement vous rencontrer, &quot;
+&quot;Nous verrons bien. Le ma&#238;tre d&#233;sire tout particuli&#232;rement vous rencontrer, &quot;
 &quot;pitoyable f&#233;e, mais il ne restera rien de vous &#224; la tomb&#233;e du jour&#160;!&quot;
 
 #. [else]
@@ -12040,13 +12083,13 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/18_Armageddon.cfg:203
-#, fuzzy
 msgid &quot;&quot;
 &quot;Yes, you come to my domain of darkness; wherever darkness is, I shall be to &quot;
 &quot;haunt you. You cannot escape influence, Galas, I warn you.&quot;
 msgstr &quot;&quot;
-&quot;Les t&#233;n&#232;bres sont mon domaine, partout o&#249; ils r&#232;gnene, je te hanterai. Tu ne &quot;
-&quot;pouvez &#233;chapper &#224; mon influence, Galas, je te le l'affirme.&quot;
+&quot;Oui, vous entrez dans mon domaine de t&#233;n&#232;bres. Partout o&#249; elles r&#232;gnent, je &quot;
+&quot;sera l&#224; pour vous hanter. Vous ne pourrez &#233;chapper &#224; mon influence, Galas, &quot;
+&quot;vous &#234;tes averti.&quot;
 
 #. [scenario]
 #: Invasion_from_the_Unknown/scenarios/19_Wesmere.cfg:4
@@ -12056,13 +12099,11 @@
 #. [objectives]
 #: Invasion_from_the_Unknown/scenarios/19_Wesmere.cfg:129
 #: Invasion_from_the_Unknown/scenarios/19_Wesmere.cfg:311
-#, fuzzy
 msgid &quot;&quot;
 &quot;Move Galas, Mal Keshar or Elynia to the cavern in the south-eastern edge of &quot;
 &quot;map&quot;
 msgstr &quot;&quot;
-&quot;D&#233;placer Galas, Mal Keshar ou Elynia au panneau indicateur dans le coin sud-&quot;
-&quot;est de la carte.&quot;
+&quot;D&#233;placer Galas, Mal Keshar ou Elynia &#224; la grotte au bord sud-est de la carte&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/19_Wesmere.cfg:140
@@ -12149,7 +12190,8 @@
 &quot;and send them to pursue us! All would be lost then.&quot;
 msgstr &quot;&quot;
 &quot;Nous ne pouvons pas d&#233;j&#224; abandonner&#160;! Si nous le faisons, ces monstres vont &quot;
-&quot;alerter les fid&#232;les et les envoyer &#224; nos trousses&#160;! Tout serait alors perdu.&quot;
+&quot;alerter les loyalistes et les envoyer &#224; nos trousses&#160;! Tout serait alors &quot;
+&quot;perdu.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/19_Wesmere.cfg:181
@@ -12184,16 +12226,14 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/19_Wesmere.cfg:193
-#, fuzzy
 msgid &quot;&quot;
 &quot;This place was cursed, since long ago, to be sunken into eternal darkness. &quot;
 &quot;No matter what we do, the night will not end here. This makes it specially &quot;
 &quot;dangerous for us, against the fiendish new inhabitants of these lands.&quot;
 msgstr &quot;&quot;
-&quot;Cet endroit a &#233;t&#233; maudit depuis tellement longtemps qu'il a sombr&#233; dans une &quot;
-&quot;&#233;ternelle obscurit&#233;. Quoi que nous fassions, la nuit ne finit jamais ici. &quot;
-&quot;C'est particuli&#232;rement dangereux pour nous, face aux adversaires qui &quot;
-&quot;habitent ces contr&#233;es.&quot;
+&quot;Une tr&#232;s ancienne mal&#233;diction a plong&#233; cet endroit dans une obscurit&#233; &quot;
+&quot;&#233;ternelle. Quoi que nous fassions, la nuit ne finit jamais ici. C'est tr&#232;s &quot;
+&quot;dangereux pour nous, surtout face aux d&#233;mons qui habitent ces contr&#233;es.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/19_Wesmere.cfg:198
@@ -12461,15 +12501,14 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/20_Under_the_Sands.cfg:311
-#, fuzzy
 msgid &quot;&quot;
 &quot;That's a minor annoyance. There is something worse in this place, something &quot;
 &quot;that I cannot easily describe with words. The air, the rocks, everything is &quot;
 &quot;unnatural.&quot;
 msgstr &quot;&quot;
-&quot;C'est un inconv&#233;nient mineur. Il y a quelque chose de plus mauvais en cet &quot;
-&quot;endroit, quelque chose que je ne peux pas d&#233;crire avec des mots. L'air, les &quot;
-&quot;roches, tout y est artificiel.&quot;
+&quot;C'est un ennui mineur. Il y a quelque chose de pire dans cet endroit, que je &quot;
+&quot;ne peux pas d&#233;crire avec de simples mots. L'air, les roches, tout est &quot;
+&quot;artificiel.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/20_Under_the_Sands.cfg:312
@@ -12699,13 +12738,12 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/20_Under_the_Sands.cfg:561
-#, fuzzy
 msgid &quot;&quot;
 &quot;'What happened'? Why the hell are you asking our question?! What happened to &quot;
 &quot;*you*, we must ask!?&quot;
 msgstr &quot;&quot;
-&quot;Qu'est-il arriv&#233;&#160;? Pourquoi par l'enfer posez vous cette question&#160;? Que vous &quot;
-&quot;est-il arriv&#233; &#224; 'vous'&#160;?&quot;
+&quot;&#171;&#160;Qu'est-il arriv&#233;&#160;?&#160;&#187;&#160;Pourquoi diable posez-vous cette question&#160;?! Nous &quot;
+&quot;devrions plut&#244;t vous demander ce qui vous est arriv&#233; &#224; *vous*&#160;!&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/20_Under_the_Sands.cfg:562
@@ -13011,6 +13049,8 @@
 &quot;Oh yeah? Go ahead if you desire. And you, rats, follow Elynia and make sure &quot;
 &quot;the boy is kept illuminated by her!&quot;
 msgstr &quot;&quot;
+&quot;Ah ouais&#160;? Avancez si vous voulez. Et vous, esp&#232;ce de rats, suivez Elynia et &quot;
+&quot;faites en sorte qu'elle &#233;claire toujours le gar&#231;on&#160;!&quot;
 
 #. [message]: speaker=narrator
 #: Invasion_from_the_Unknown/scenarios/20_Under_the_Sands.cfg:768
@@ -13043,6 +13083,9 @@
 &quot;illuminating everything with a blueish glow. And the energy that flows from &quot;
 &quot;it and pulls me is... known, somehow.&quot;
 msgstr &quot;&quot;
+&quot;Un glyphe de cristal g&#233;ant est au centre de la salle.  Il flotte et &#233;claire &quot;
+&quot;tout d'une lueur bleut&#233;e. Et l'&#233;nergie qui en sort et m'attire... n'est &quot;
+&quot;connue, d'une certaine fa&#231;on.&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/20_Under_the_Sands.cfg:797
@@ -13050,6 +13093,8 @@
 &quot;Sounds like one of those that we found in the depths of the Unknown. Be &quot;
 &quot;careful, anyway. We don't know what it's made for.&quot;
 msgstr &quot;&quot;
+&quot;Cela ressemble &#224; ceux qu'on a trouv&#233; dans les profondeurs de l'inconnu. &quot;
+&quot;Attention, en tout cas. Nous ne savons pas &#224; quoi il sert.&quot;
 
 #. [else]
 #: Invasion_from_the_Unknown/scenarios/20_Under_the_Sands.cfg:812
@@ -13062,6 +13107,8 @@
 &quot;In a nearby pedestal there is a scroll. I'll open and read it. Possibly &quot;
 &quot;explains something about this chamber.&quot;
 msgstr &quot;&quot;
+&quot;Il y a un parchemin dans le piedestal tout proche. Je vais l'ouvrir et le &quot;
+&quot;lire. Nous y trouverons peut-&#234;tre des explications sur ce lieu.&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/20_Under_the_Sands.cfg:816
@@ -13087,6 +13134,7 @@
 #: Invasion_from_the_Unknown/scenarios/20_Under_the_Sands.cfg:819
 msgid &quot;'Note: Only faeries can receive and use the spell from the glyph.'&quot;
 msgstr &quot;&quot;
+&quot;&#171;&#160;Remarque&#160;: seules les f&#233;es peuvent utiliser les pouvoirs du glyphe.&#160;&#187;&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/20_Under_the_Sands.cfg:820
@@ -13170,6 +13218,8 @@
 &quot;... and that suddenly vanishes away. Yet, there was no noticeable difference &quot;
 &quot;in Elynia's appearance.&quot;
 msgstr &quot;&quot;
+&quot;... et cela s'est soudainement &#233;vapor&#233;. Mais l'apparence d'Elynia n'&#233;tait &quot;
+&quot;pas vraiment tr&#232;s diff&#233;rente.&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/20_Under_the_Sands.cfg:904
@@ -13217,12 +13267,12 @@
 
 #. [objectives]
 #: Invasion_from_the_Unknown/scenarios/21_The_Heart.cfg:303
-#, fuzzy
 msgid &quot;&quot;
 &quot;Move Galas, Elynia, Mal Keshar or Erathan into the dark keep (area where the &quot;
 &quot;objective marker is located in)&quot;
 msgstr &quot;&quot;
-&quot;D&#233;placer Galas, Elynia, Mal Keshar ou Erathan dans le donjon. (zone marqu&#233;e)&quot;
+&quot;D&#233;placer Galas, Elynia, Mal Keshar ou Erathan dans le donjon des t&#233;n&#232;bres &quot;
+&quot;(zone marqu&#233;e d'un indicateur d'objectif)&quot;
 
 #. [objectives]
 #: Invasion_from_the_Unknown/scenarios/21_The_Heart.cfg:304
@@ -13232,13 +13282,12 @@
 
 #. [objectives]
 #: Invasion_from_the_Unknown/scenarios/21_The_Heart.cfg:314
-#, fuzzy
 msgid &quot;&quot;
 &quot;Distract the enemy while Galas, Elynia, Mal Keshar and Erathan enter the &quot;
 &quot;dark keep&quot;
 msgstr &quot;&quot;
 &quot;Distraire les ennemis tandis que Galas, Elynia, Mal Keshar et Erathan &quot;
-&quot;entrent dans le donjon.&quot;
+&quot;entrent dans le donjon des t&#233;n&#232;bres&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/21_The_Heart.cfg:327
@@ -13310,16 +13359,15 @@
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/21_The_Heart.cfg:339
-#, fuzzy
 msgid &quot;&quot;
 &quot;Note: after this scenario your gold supply will be set to zero until the end &quot;
 &quot;of this last episode. You will be able to pick your best units to be &quot;
 &quot;recalled for the next scenarios, but only once, and without including your &quot;
 &quot;dwarvish allies.&quot;
 msgstr &quot;&quot;
-&quot;Note&#160;: apr&#232;s ce sc&#233;nario votre or sera mis &#224; z&#233;ro jusqu'&#224; la fin du dernier &quot;
-&quot;&#233;pisode. Vos meilleures unit&#233;s pourront &#234;tre rappel&#233;es dans le prochain &quot;
-&quot;sc&#233;nario, &#224; l'exception de vos alli&#233;s nains.&quot;
+&quot;Note&#160;: apr&#232;s ce sc&#233;nario, votre or sera mis &#224; z&#233;ro jusqu'&#224; la fin de ce &quot;
+&quot;dernier &#233;pisode. Vos meilleures unit&#233;s pourront &#234;tre rappel&#233;es dans le &quot;
+&quot;prochain sc&#233;nario, mais une fois seulement et sans vos alli&#233;s nains.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/21_The_Heart.cfg:351
@@ -13340,13 +13388,12 @@
 #: Invasion_from_the_Unknown/scenarios/22A_Innuendo.cfg:343
 #: Invasion_from_the_Unknown/scenarios/22A_Innuendo.cfg:412
 #: Invasion_from_the_Unknown/scenarios/22B_Gauntlet.cfg:185
-#, fuzzy
 msgid &quot;&quot;
 &quot;Explore and find your way to the main Keep with Galas, Elynia, Mal Keshar or &quot;
 &quot;Erathan&quot;
 msgstr &quot;&quot;
-&quot;Distraire les ennemis tandis que Galas, Elynia, Mal Keshar et Erathan &quot;
-&quot;entrent dans le donjon.&quot;
+&quot;Explorer et s'orienter dans le donjon principal avec Galas, Elynia, Mal &quot;
+&quot;Keshar et Erathan&quot;
 
 #. [objectives]
 #: Invasion_from_the_Unknown/scenarios/22A_Innuendo.cfg:348
@@ -13553,7 +13600,7 @@
 #. [unit]: description=Hell Gatekeeper, type=Armageddon Imp
 #: Invasion_from_the_Unknown/scenarios/22A_Innuendo.cfg:864
 msgid &quot;Hell Gatekeeper&quot;
-msgstr &quot;&quot;
+msgstr &quot;Gardien des portes des enfers&quot;
 
 #. [unit]: description=shaxthal1, type=Shaxthal Sentry Drone
 #: Invasion_from_the_Unknown/scenarios/22A_Innuendo.cfg:873
@@ -13606,7 +13653,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/22A_Innuendo.cfg:958
 msgid &quot;Shriak! Greeeeshaaaahhhh...&quot;
-msgstr &quot;Shriak&#160;! Le Maaa&#238;&#238;&#238;tttrreee...&quot;
+msgstr &quot;Shriak&#160;! Greeeeshaaaahhhh...&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/22A_Innuendo.cfg:960
@@ -13614,16 +13661,19 @@
 &quot;Ah, the Shadow Master! I cannot wait to meet him personally anymore... get &quot;
 &quot;out of our path, you bastards!&quot;
 msgstr &quot;&quot;
+&quot;Ah, le Ma&#238;tre de l'Ombre&#160;! Je cr&#232;ve d'impatience de le rencontrer &quot;
+&quot;personnellement... d&#233;gagez de notre chemin, esp&#232;ces de crevures&#160;!&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/22A_Innuendo.cfg:961
 msgid &quot;Damned we are, is it that there is an unlimited source of enemy bosses?&quot;
 msgstr &quot;&quot;
+&quot;Nous sommes maudits, il n'y aurait pas un nombre illimit&#233; de chefs ennemis ?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/22A_Innuendo.cfg:962
 msgid &quot;Haven't you said that many times already?&quot;
-msgstr &quot;&quot;
+msgstr &quot;N'avez-vous pas d&#233;j&#224; dit cela bien des fois&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/22A_Innuendo.cfg:963
@@ -13634,6 +13684,7 @@
 #: Invasion_from_the_Unknown/scenarios/22A_Innuendo.cfg:1002
 msgid &quot;Get back, filthy rebels! No living ones should tresspass these gates!&quot;
 msgstr &quot;&quot;
+&quot;Repartez, sales rebelles&#160;! Aucun &#234;tre vivant ne doit franchir ces portes&#160;!&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/22A_Innuendo.cfg:1003
@@ -13805,6 +13856,9 @@
 &quot;So you are the monster that killed Anlind&#235;. You shall pay for that, and I'll &quot;
 &quot;make sure that no part of your body is left this time to resurrect you!&quot;
 msgstr &quot;&quot;
+&quot;C'est donc vous le monstre qui avez tu&#233; Anlind&#235;. Vous allez le payer. Et je &quot;
+&quot;vais m'assurer que pas un morceau de votre cadavre ne reste pour que vous &quot;
+&quot;permettre de ressusciter&#160;!&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/22B_Gauntlet.cfg:350
@@ -13812,11 +13866,16 @@
 &quot;Fool, there is no weapon or magical power left in this world to destruct me &quot;
 &quot;permanently. You will be only wasting your last minutes of life!&quot;
 msgstr &quot;&quot;
+&quot;Imb&#233;ciles, il n'y a aucune arme ni aucun pouvoir magique qui soient dans ce &quot;
+&quot;monde pour me d&#233;truire de fa&#231;on permanente. Nous &#234;tes seulement en train de &quot;
+&quot;perdre les derni&#232;re minutes qui vous restent &#224; vivre&#160;!&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/22B_Gauntlet.cfg:351
 msgid &quot;No, we will prevail. It is you who will waste his last minutes of life.&quot;
 msgstr &quot;&quot;
+&quot;Non, nous triompherons. C'est vous qui g&#226;chez les derni&#232;res minutes de votre &quot;
+&quot;vie.&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/22B_Gauntlet.cfg:352
@@ -13825,6 +13884,9 @@
 &quot;you a lesson, to respect those who are actually powerful, to respect the &quot;
 &quot;lords of Chaos!&quot;
 msgstr &quot;&quot;
+&quot;Ah, voil&#224; la tant redout&#233; Madonne de Lumi&#232;re... vous n'&#234;tes qu'une fillette. &quot;
+&quot;Je vais vous donner une le&#231;on, qui vous apprendra &#224; respecter ceux qui sont &quot;
+&quot;vraiment puissants et vous fera r&#233;v&#233;rer les seigneurs du chaos&#160;!&quot;
 
 #. [objectives]
 #: Invasion_from_the_Unknown/scenarios/22B_Gauntlet.cfg:356
@@ -13837,6 +13899,8 @@
 &quot;I told you so, fools. What now? Will you let me kill you at last, or will &quot;
 &quot;you try to escape and run away like little rabbits?&quot;
 msgstr &quot;&quot;
+&quot;Je vous l'avais dit, idiots. Alors&#160;? Vous me laissez enfin vous tuer, ou &quot;
+&quot;vous allez essayer de vous enfuir comme des petits lapins&#160;?&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/22B_Gauntlet.cfg:399
@@ -13864,6 +13928,7 @@
 #: Invasion_from_the_Unknown/scenarios/22B_Gauntlet.cfg:403
 msgid &quot;It is highly risky, and I'll need Malin's help. Malin?&quot;
 msgstr &quot;&quot;
+&quot;C'est tr&#232;s risqu&#233; et nous allons avoir besoin de l'aide de Malin. Malin&#160;?&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/22B_Gauntlet.cfg:404
@@ -13885,7 +13950,7 @@
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/22B_Gauntlet.cfg:407
 msgid &quot;You what?&quot;
-msgstr &quot;Quoi toi&#160;?&quot;
+msgstr &quot;Vous quoi&#160;?&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/22B_Gauntlet.cfg:409
@@ -13910,7 +13975,7 @@
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/22B_Gauntlet.cfg:412
 msgid &quot;Let's distract the Warlord in the mean time, then!&quot;
-msgstr &quot;&quot;
+msgstr &quot;Donc, distrayons le seigneur de guerre pendant ce temps !&quot;
 
 #. [objectives]
 #: Invasion_from_the_Unknown/scenarios/22B_Gauntlet.cfg:416
@@ -13968,6 +14033,9 @@
 &quot;The Halls of the Damned... the door behind, and the Dark Hive... follow the &quot;
 &quot;dark road, and you will find him, in a chamber plenty of his creations...&quot;
 msgstr &quot;&quot;
+&quot;La Salle des Damn&#233;s... la porte derri&#232;re, et l'Essaim Noir... suivez la &quot;
+&quot;route noire... et vous le trouverez, dans un endroit rempli de ses &quot;
+&quot;cr&#233;ations...&quot;
 
 #. [then]
 #: Invasion_from_the_Unknown/scenarios/22B_Gauntlet.cfg:446
@@ -13980,7 +14048,7 @@
 &quot;As Elyssa performed her last breathe, her former appearance returned, &quot;
 &quot;showing that of a beautiful red-haired human mage.&quot;
 msgstr &quot;&quot;
-&quot;Alors qu'Elyssa rend son dernier souffle, son ancienne aspect resurgit, &quot;
+&quot;Alors qu'Elyssa rend son dernier souffle, son ancien aspect resurgit, &quot;
 &quot;r&#233;v&#233;lant une magnifique magicienne rousse.&quot;
 
 #. [then]
@@ -14140,6 +14208,8 @@
 &quot;I guess this explains the strange lifeforms we have found in here. Then, &quot;
 &quot;someone unleashed these creatures from their container pods.&quot;
 msgstr &quot;&quot;
+&quot;Je suppose que cela explique les &#233;tranges formes de vie que nous avons &quot;
+&quot;d&#233;couvertes ici. Et quelqu'un a lib&#233;r&#233; ces cr&#233;atures de leurs cages.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/22B_Gauntlet.cfg:692
@@ -14198,6 +14268,8 @@
 &quot;Note: only three of your heroes will be available until you make it to the &quot;
 &quot;Lair of the Shadow Master.&quot;
 msgstr &quot;&quot;
+&quot;Remarque : seuls trois de vos h&#233;ros seront disponibles jusqu'&#224; ce que vous &quot;
+&quot;arriviez au repaire du Ma&#238;tre de l'Ombre&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/23A_Interim.cfg:447
@@ -14217,18 +14289,21 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/23A_Interim.cfg:449
 msgid &quot;(sighs) Fair enough, let's move.&quot;
-msgstr &quot;Assez r&#233;jouissant, allons-y.&quot;
+msgstr &quot;(soupir) Assez r&#233;jouissant, allons-y.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/23A_Interim.cfg:450
 msgid &quot;&quot;
 &quot;Remember that now we have the power of the Union by our side, once again.&quot;
 msgstr &quot;&quot;
+&quot;Encore une fois, rappelez-vous que nous disposons du pouvoir de l'Union.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/23A_Interim.cfg:493
 msgid &quot;This is it. The final gate. This is the way to go, if we are all ready!&quot;
 msgstr &quot;&quot;
+&quot;La voici. La derni&#232;re porte. C'est le moment d'y aller, si nous sommes &quot;
+&quot;pr&#234;ts !&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/23A_Interim.cfg:547
@@ -14251,6 +14326,8 @@
 &quot;Huh? We have no time to waste in hesitating our steps here. We have come &quot;
 &quot;this far, so it is now the time to finish our task.&quot;
 msgstr &quot;&quot;
+&quot;H&#233; ? Nous n'avons pas le temps d'h&#233;siter en chemin. Nous sommes venus de si &quot;
+&quot;loin qu'il nous faut maintenant terminer notre t&#226;che.&quot;
 
 #. [objectives]
 #: Invasion_from_the_Unknown/scenarios/23A_Interim.cfg:555
@@ -14263,7 +14340,7 @@
 #: Invasion_from_the_Unknown/scenarios/23B_Welcome_to_the_Lair.cfg:110
 #: Invasion_from_the_Unknown/scenarios/23B_Welcome_to_the_Lair/enemies.cfg:8
 msgid &quot;Shadow Master&quot;
-msgstr &quot;Ma&#238;tre de l'ombre&quot;
+msgstr &quot;Ma&#238;tre de l'Ombre&quot;
 
 #. [message]: speaker=narrator
 #: Invasion_from_the_Unknown/scenarios/23A_Interim.cfg:585
@@ -14291,6 +14368,7 @@
 &quot;Come out of your hiding, villain! Your rule of doom is about to come to an &quot;
 &quot;end!&quot;
 msgstr &quot;&quot;
+&quot;Sors de ta cachette, ordure&#160;! Ton r&#232;gne de terreur va bient&#244;t s'achever&#160;!&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/23B_Welcome_to_the_Lair.cfg:119
@@ -14303,6 +14381,8 @@
 &quot;Ek! The doors behind us have been replaced by a wall. We are trapped in this &quot;
 &quot;lair, probably so that he can play his game with us.&quot;
 msgstr &quot;&quot;
+&quot;Diantre&#160;! Les portes derri&#232;re nous viennent de se transformer en mur. Nous &quot;
+&quot;sommes pi&#233;g&#233;s dans cet endroit, et il va probablement jouer avec nous.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/23B_Welcome_to_the_Lair.cfg:146
@@ -14331,6 +14411,8 @@
 &quot;Um... there is something suspicious in this room. Its center is blocked by &quot;
 &quot;walls.&quot;
 msgstr &quot;&quot;
+&quot;Humm... il y a quelque chose de suspect dans cette pi&#232;ce. Son centre est &quot;
+&quot;bloqu&#233; par des murs.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/23B_Welcome_to_the_Lair/boss.cfg:70
@@ -14338,6 +14420,8 @@
 &quot;Possibly the Emperor is hiding in there. We need to find a way to destroy &quot;
 &quot;those walls.&quot;
 msgstr &quot;&quot;
+&quot;Peut-&#234;tre que l'empereur se cache l&#224;. Nous devons trouver un moyen de &quot;
+&quot;d&#233;truire ces parois.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/23B_Welcome_to_the_Lair/boss.cfg:114
@@ -14371,6 +14455,8 @@
 #: Invasion_from_the_Unknown/scenarios/23B_Welcome_to_the_Lair/boss.cfg:163
 msgid &quot;I don't know you, what do you mean? Why should I trust you?&quot;
 msgstr &quot;&quot;
+&quot;Je ne vous connais pas, &#224; quoi pensez-vous ? Pourquoi vous ferais-je &quot;
+&quot;confiance ?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/23B_Welcome_to_the_Lair/boss.cfg:164
@@ -14752,7 +14838,7 @@
 #. [objectives]
 #: Invasion_from_the_Unknown/scenarios/23B_Welcome_to_the_Lair/chimera_fight.cfg:23
 msgid &quot;Find the object which holds the magic of the Cockatrices and destroy it&quot;
-msgstr &quot;&quot;
+msgstr &quot;Trouver et d&#233;truire l'objet qui contient la magie des cocatris&quot;
 
 #. [objectives]
 #: Invasion_from_the_Unknown/scenarios/23B_Welcome_to_the_Lair/chimera_fight.cfg:26
@@ -14771,6 +14857,8 @@
 &quot;It seems to be a creature made from parts of assorted monsters. Not a nice &quot;
 &quot;thing to know...&quot;
 msgstr &quot;&quot;
+&quot;On dirait que ces cr&#233;atures sont constitu&#233;es de morceaux de monstres &quot;
+&quot;assembl&#233;s. C'est pas tr&#232;s r&#233;jouissant &#224; savoir...&quot;
 
 #. [event]: (type=Chimera)}
 #: Invasion_from_the_Unknown/scenarios/23B_Welcome_to_the_Lair/chimera_fight.cfg:44
@@ -14778,11 +14866,13 @@
 &quot;How can it be... attention everyone! The power of these creatures seems to &quot;
 &quot;come from that abomination!&quot;
 msgstr &quot;&quot;
+&quot;Comment cela se peut-il... attention tout le monde ! Le pouvoir de ces &quot;
+&quot;horreurs semble provenir de cette abomination !&quot;
 
 #. [event]: (type=Chimera)}
 #: Invasion_from_the_Unknown/scenarios/23B_Welcome_to_the_Lair/chimera_fight.cfg:45
 msgid &quot;Are you sure? No one has ever bound the stone to the living!&quot;
-msgstr &quot;&quot;
+msgstr &quot;&#202;tes-vous s&#251;r ? Personne n'a jamais li&#233; la pierre &#224; la vie !&quot;
 
 #. [event]: (type=Chimera)}
 #: Invasion_from_the_Unknown/scenarios/23B_Welcome_to_the_Lair/chimera_fight.cfg:46
@@ -14810,6 +14900,8 @@
 &quot;As you suspected, Malin. The death of the chimera caused all the other &quot;
 &quot;cockatrices to collapse.&quot;
 msgstr &quot;&quot;
+&quot;C'&#233;tait comme vous le pensiez, Malin. La mort de la chim&#232;re a fait &quot;
+&quot;s'effondrer les autres cocatris.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/23B_Welcome_to_the_Lair/chimera_fight.cfg:88
@@ -15554,7 +15646,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/08x.cfg:181
 msgid &quot;Um... but it will be extremely dangerous if what Althurin says is true.&quot;
-msgstr &quot;&quot;
+msgstr &quot;Hum... mais ce sera tr&#232;s dangereux si ce que dit Althurin est vrai.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/08x.cfg:182
@@ -15626,7 +15718,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/12x.cfg:106
 msgid &quot;We made it! And there are no signals of demons around.&quot;
-msgstr &quot;&quot;
+msgstr &quot;Nous avons r&#233;ussi ! Et il n'y a aucun signe de d&#233;mons tout autour.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/12x.cfg:107
@@ -15663,7 +15755,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/12x.cfg:111
 msgid &quot;And so, they signaled the rest of the group to go out of the caverns.&quot;
-msgstr &quot;&quot;
+msgstr &quot;Et donc, ils signal&#232;rent la sortie des cavernes du reste du groupe.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/12x.cfg:112
@@ -15677,7 +15769,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/12x.cfg:113
 msgid &quot;May your soul rest in peace for the rest of eternity, Anlind&#235;.&quot;
-msgstr &quot;&quot;
+msgstr &quot;Que votre &#226;me repose en paix durant l'&#233;ternit&#233;, Anlind&#235;.&quot;
 
 #. [scenario]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/14x_A.cfg:4
@@ -15900,6 +15992,8 @@
 &quot;Thanks for your hospitality, my lord. It is a pleasure to meet such fine &quot;
 &quot;people.&quot;
 msgstr &quot;&quot;
+&quot;Merci pour votre hospitalit&#233;, monseigneur. C'est un plaisir de rencontrer &quot;
+&quot;des gens si courtois.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/14x_B.cfg:141
@@ -16018,6 +16112,8 @@
 #: Invasion_from_the_Unknown/scenarios/cutscenes/14x_B.cfg:158
 msgid &quot;I feel so. It seems that the darkness had a great influence on me.&quot;
 msgstr &quot;&quot;
+&quot;Je sens cela aussi. On dirait que les t&#233;n&#232;bres ont eu une grande influence &quot;
+&quot;sur moi.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/14x_B.cfg:159
@@ -16056,6 +16152,8 @@
 &quot;Brave words, elf, but again, we don't have the strength, and surely you &quot;
 &quot;don't either.&quot;
 msgstr &quot;&quot;
+&quot;Ce sont de braves paroles, elfe, mais une fois encore, nos forces sont &quot;
+&quot;insuffisantes, tout comme les v&#244;tres probablement.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/14x_B.cfg:163
@@ -16068,6 +16166,8 @@
 &quot;I doubt that would be enough. However, I really would like to hear again of &quot;
 &quot;peace and freedom, in this age, as the continent once was.&quot;
 msgstr &quot;&quot;
+&quot;Je doute que cela suffira. Mais j'aimerais vraiment retrouver la paix et la &quot;
+&quot;libert&#233;, &#224; cette &#233;poque, comme auparavant sur le continent.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/14x_B.cfg:165
@@ -16078,7 +16178,7 @@
 #: Invasion_from_the_Unknown/scenarios/cutscenes/14x_B.cfg:166
 msgid &quot;I suppose the effort and sacrifice will be worth the results.&quot;
 msgstr &quot;&quot;
-&quot;Je pense que l'effort et les sacrifices consentis en vaudront la r&#233;sultat.&quot;
+&quot;Je pense que l'effort et les sacrifices consentis en vaudront le r&#233;sultat.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/14x_B.cfg:167
@@ -16118,6 +16218,9 @@
 &quot;The orcs? But, they are just one step above the demons! We can't let those &quot;
 &quot;beasts have an opportunity to kill us when unwary!&quot;
 msgstr &quot;&quot;
+&quot;Les orcs ? Mais ils sont presque &#224; mettre sur le m&#234;me plan que les d&#233;mons ! &quot;
+&quot;Nous ne pouvons pas laisser une occasion &#224; ces animaux de nous massacrer &quot;
+&quot;alors que nous serions inattentifs !&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/14x_B.cfg:174
@@ -16191,7 +16294,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/16x.cfg:141
 msgid &quot;Atrocious. They might even have been our kinsmen before!&quot;
-msgstr &quot;Atroce. Ils auraient aussi bien pu &#234;tre nos parent auparavant.&quot;
+msgstr &quot;C'est atroce. Ils auraient aussi bien pu &#234;tre nos parents auparavant&#160;!&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/16x.cfg:142
@@ -16222,13 +16325,13 @@
 &quot;Now that we have the orcs by our side, I'd dare say it is time to start the &quot;
 &quot;final war. Anyone against?&quot;
 msgstr &quot;&quot;
-&quot;Maintenant que nous avons les orcs de notre c&#244;t&#233;, je peux affirmer qu'il est &quot;
-&quot;temps pour l'ultime guerre. Quelqu'un y est oppos&#233;&#160;?&quot;
+&quot;Maintenant que les orcs sont de notre c&#244;t&#233;, je peux affirmer qu'il est temps &quot;
+&quot;de commencer notre dernier combat. Quelqu'un y est oppos&#233;&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/16x.cfg:147
 msgid &quot;I'll take it as a no.&quot;
-msgstr &quot;Je prends cela pour un non.&quot;
+msgstr &quot;Je consid&#232;re cela comme un non.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/16x.cfg:148
@@ -16236,14 +16339,14 @@
 &quot;We must call and prepare all able-bodied man and women today. Tomorrow, we &quot;
 &quot;depart to war. May a glorious death be our fate, if not a glorious victory.&quot;
 msgstr &quot;&quot;
-&quot;Nous devons appeler et pr&#233;parer tous les hommes et femmes valides &quot;
-&quot;aujourd'hui. Demain nous partirons pou la guerre. Puisse une mort glorieuse &quot;
-&quot;&#234;tre notre destin&#233;e, si ce n'est une victoire encore plus glorieuse.&quot;
+&quot;Nous devons pr&#233;parer tous les hommes et toutes les femmes valides &quot;
+&quot;aujourd'hui. Demain, nous partirons en guerre. Si notre destin n'est pas &quot;
+&quot;d'obtenir une victoire &#233;clatante, obtenons au moins une mort glorieuse.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/16x.cfg:149
 msgid &quot;And so, the Council has spoken.&quot;
-msgstr &quot;Et ainsi, le Conseil &#224; parl&#233;.&quot;
+msgstr &quot;Et ainsi, le Conseil a parl&#233;.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/16x.cfg:150
@@ -16252,8 +16355,7 @@
 &quot;pleasure to have met you. May it be not the last time we meet together.&quot;
 msgstr &quot;&quot;
 &quot;Alors, nous partons en guerre. Mesdames et messieurs les aragwaithi, c'&#233;tait &quot;
-&quot;un plaisir de vous rencontrer. Puisse n'&#234;tre pas la derni&#232;re fois que nous &quot;
-&quot;nous voyons.&quot;
+&quot;un plaisir de vous rencontrer. J'esp&#232;re que ce n'est pas la derni&#232;re fois.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/16x.cfg:151
@@ -16261,7 +16363,7 @@
 &quot;If you don't mind, Galas, I will stay with you. You might need some of my &quot;
 &quot;help.&quot;
 msgstr &quot;&quot;
-&quot;Si vous n'y voyez rien contre, Galas, je reste avec vous. Vous pourriez &quot;
+&quot;Si vous n'y voyez aucune objection, Galas, je reste avec vous. Vous pourriez &quot;
 &quot;avoir besoin de mon aide.&quot;
 
 #. [event]
@@ -16272,7 +16374,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/16x.cfg:153
 msgid &quot;Can I cut some orcish throats now?&quot;
-msgstr &quot;Puis je couper quelques gorges d'orcs maintenant&#160;?&quot;
+msgstr &quot;Puis-je couper quelques gorges d'orcs maintenant&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/16x.cfg:154
@@ -16294,9 +16396,9 @@
 &quot;the Grand Council, before the day ended, and prepared everything for their &quot;
 &quot;final mission...&quot;
 msgstr &quot;&quot;
-&quot;Alors, la grande guerre d&#233;buta. Mais Galas, apr&#232;s avoir expliqu&#233; son plan au &quot;
-&quot;grand conseil, pr&#233;para ce qu'il fallait pour leur ultime mission, avant la &quot;
-&quot;fin du jour.&quot;
+&quot;Alors, la Grande Guerre d&#233;buta. Mais Galas, expliqua son plan au Grand &quot;
+&quot;Conseil avant la fin de la journ&#233;e, puis pr&#233;para le n&#233;cessaire pour leur &quot;
+&quot;ultime mission...&quot;
 
 #. [scenario]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/20x.cfg:4
@@ -16306,7 +16408,7 @@
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/20x.cfg:79
 msgid &quot;As dawn broke, the party encountered a nice surprise near their camp.&quot;
-msgstr &quot;&#192; l'aube pass&#233;e, l'&#233;quipe eu une belle surprise pr&#232;s du camp.&quot;
+msgstr &quot;L'aube pass&#233;e, l'&#233;quipe eut une belle surprise pr&#232;s du camp.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/20x.cfg:80
@@ -16315,12 +16417,12 @@
 &quot;saw you.&quot;
 msgstr &quot;&quot;
 &quot;Nous nous rencontrons de nouveau, Elynia. Tu es aussi belle que la derni&#232;re &quot;
-&quot;fois que je t'ai vue.&quot;
+&quot;fois.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/20x.cfg:81
 msgid &quot;Thanks, Althur.&quot;
-msgstr &quot;Merci, Althurin.&quot;
+msgstr &quot;Merci, Althur.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/20x.cfg:82
@@ -16333,14 +16435,15 @@
 &quot;Hail, Galas. How have ye been doing lately? After we got word from the &quot;
 &quot;Aragwaithi people of your courageous quest, we decided to come and help you.&quot;
 msgstr &quot;&quot;
-&quot;Salut, Galas. Pourquoi &#234;tes-vous tellement en retard&#160;? Apr&#232;s que les &quot;
-&quot;aragwaithi nous aient parl&#233; de votre courageuse aventure, nous avons d&#233;cid&#233; &quot;
-&quot;de venir vous aider.&quot;
+&quot;Salut, Galas. Pourquoi &#234;tes-vous tellement en retard&#160;? Les aragwaithi nous &quot;
+&quot;ont parl&#233; de votre courageuse aventure, et apr&#232;s nous avons d&#233;cid&#233; de venir &quot;
+&quot;vous aider.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/20x.cfg:84
 msgid &quot;Thanks, my lord; I did not ask them to tell you, though.&quot;
-msgstr &quot;Merci, seigneur, Je ne leur avais pas demand&#233; de vous le dire.&quot;
+msgstr &quot;&quot;
+&quot;Merci, monseigneur. Je ne leur avais pas demand&#233; de vous le dire, cependant.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/20x.cfg:85
@@ -16349,15 +16452,16 @@
 &quot;some help! What, trying to reach the Dark Fortress? Nay, you could not do it &quot;
 &quot;alone. We have seen it, and it is a very well guarded fortress.&quot;
 msgstr &quot;&quot;
-&quot;Ha&#160;! Ils savent aussi bien que nous que vous ne resteriez pas longtemps sans &quot;
-&quot;aide. Essayer d'atteindre la forteresse sombre&#160;? Non, vous ne pouviez pas le &quot;
-&quot;faire seul. Nous l'avons vu et c'est une forteresse tr&#232;s bien gard&#233;e.&quot;
+&quot;Ha&#160;! Ils savent aussi bien que nous que vous ne r&#233;sisteriez pas longtemps &quot;
+&quot;sans aide&#160;! Comment, tenter d'atteindre la forteresse des t&#233;n&#232;bres&#160;? Non, &quot;
+&quot;vous ne pourriez pas le faire seuls. Nous l'avons vue et elle est tr&#232;s bien &quot;
+&quot;gard&#233;e.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/20x.cfg:86
 msgid &quot;In fact, we are already surprised that you managed to come this far.&quot;
 msgstr &quot;&quot;
-&quot;En fait, nous sommes d&#233;j&#224; &#233;tonn&#233;s que vous avez r&#233;ussi &#224; venir si loin. &quot;
+&quot;En fait, nous sommes d&#233;j&#224; &#233;tonn&#233;s que vous ayez r&#233;ussi &#224; arriver si loin. &quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/20x.cfg:87
@@ -16383,9 +16487,9 @@
 &quot;next? Invade it? Is that your plan, master Galas?&quot;
 msgstr &quot;&quot;
 &quot;Euh, comme Althurin a dit, ce n'est pas une cour de r&#233;cr&#233;ation. Des choses &quot;
-&quot;ineffablement d&#233;sagr&#233;ables arrivent l&#224; et les gardes sont une peste qui &quot;
-&quot;prot&#232;ge chaque coin de la Vall&#233;e Sombre. Vous devriez le voir par vous-m&#234;me, &quot;
-&quot;mais, que sera la suite&#160;? L'investir&#160;? Est-ce votre plan, ma&#238;tre Galas&#160;?&quot;
+&quot;innommables arrivent l&#224;, et les gardes sont une calamit&#233; qui prot&#232;gent &quot;
+&quot;chaque coin de la Vall&#233;e Noire. Vous devriez le voir par vous-m&#234;me, mais que &quot;
+&quot;faire ensuite&#160;? L'investir&#160;? C'est votre plan, ma&#238;tre Galas&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/20x.cfg:91
@@ -16410,15 +16514,15 @@
 &quot;nice-worded plot what you should need to get there. You need a backup force &quot;
 &quot;to distract the main base defenses while you get in. You need us.&quot;
 msgstr &quot;&quot;
-&quot;Vous &#234;tes une brave &#233;quipe, c'est certain. Mais c'est plus que le courage, &quot;
-&quot;la n&#233;cromancie ou un plan bien l&#233;ch&#233; dont vous avez besoin pour entrer l&#224; &quot;
-&quot;bas. Vous avez besoin d'une force de secours pour distraire le socle &quot;
-&quot;principal des d&#233;fenses tandis que vous entrerez. Vous avez besoin de nous.&quot;
+&quot;Vous &#234;tes une brave &#233;quipe, c'est certain. Mais il faut plus que du courage, &quot;
+&quot;de la n&#233;cromancie ou un plan bien l&#233;ch&#233; entrer l&#224;-bas. Vous avez besoin &quot;
+&quot;d'une force de secours pour distraire la majeure partie des d&#233;fenses tandis &quot;
+&quot;que vous entrerez. Vous avez besoin de nous.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/20x.cfg:94
 msgid &quot;And you would distract them? Are you sure?&quot;
-msgstr &quot;Et vous les distrairiez&#160;? &#234;tes-vous s&#251;r&#160;?&quot;
+msgstr &quot;Et vous les distrairiez&#160;? Vous &#234;tes s&#251;r&#160;?&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/20x.cfg:95
@@ -16441,16 +16545,16 @@
 &quot;Fair enough, then. But who would enter the keep? I think only Elynia and I &quot;
 &quot;should, as others would be extremely risking their lives there.&quot;
 msgstr &quot;&quot;
-&quot;Bien joli, effectivement. Mais voulez vous entrer dans le donjon&#160;? Je pense &quot;
-&quot;que seuls Elynia et moi-m&#234;me le pouvons, les autres risqueraient grandement &quot;
-&quot;leur vie l&#224; bas.&quot;
+&quot;Bien joli, effectivement. Mais vous voulez entrer dans le donjon&#160;? Je pense &quot;
+&quot;que seuls Elynia et moi le pouvons, les autres risqueraient grandement leur &quot;
+&quot;vie l&#224;-bas.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/20x.cfg:97
 msgid &quot;I cannot let you go and have all the fun, lad. I'm going in.&quot;
 msgstr &quot;&quot;
-&quot;Je ne peux pas vous laisser partir et avoir tout le plaisir, gar&#231;on. J'y &quot;
-&quot;vais.&quot;
+&quot;Je ne peux pas vous laisser y aller et profiter de tout le plaisir, gar&#231;on. &quot;
+&quot;J'en suis.&quot;
 
 #. [event]
 #: Invasion_from_the_Unknown/scenarios/cutscenes/20x.cfg:98
@@ -16494,6 +16598,10 @@
 &quot;all our people too, all those who we protected... and swore to defend till &quot;
 &quot;the end of times. You betrayed our cause, and ultimately betrayed yourself.&quot;
 msgstr &quot;&quot;
+&quot;(pleurant) Non, c'est vous qui avez abus&#233; de ma confiance... et de mon &quot;
+&quot;amour... Vous avez &#233;galement trahi tout votre peuple, tous ceux que nous &quot;
+&quot;prot&#233;gions... et avions jur&#233; de d&#233;fendre jusqu'&#224; la fin des temps. Vous avez &quot;
+&quot;trahi notre cause et, pour finir, vous-m&#234;me.&quot;
 
 #. [event]: (description=Elynia) 21 21}, (description=Mal Keshar, (description=Galas) 22 19}, (description=Galas) 20 21}
 #: Invasion_from_the_Unknown/scenarios/cutscenes/23Bx.cfg:99
@@ -16501,9 +16609,9 @@
 &quot;Heh... nothing but... a matter of your point... of view... and choices... I &quot;
 &quot;chose my fate. I guess this is what I deserved from the beginning...&quot;
 msgstr &quot;&quot;
-&quot;H&#233;... ce n'est qu'un... r&#233;sultat de votre... point de vue et de... vos &quot;
-&quot;choix. J'ai personnellement choisi... mon destin. Je suppose que c'est... ce &quot;
-&quot;qui... m'attendait d&#232;s le d&#233;but...&quot;
+&quot;H&#233;... ce n'est qu'une... question de... point de vue et de... choix. J'ai &quot;
+&quot;personnellement choisi... mon destin. Je suppose que c'est... ce qui... &quot;
+&quot;m'attendait d&#232;s le d&#233;but...&quot;
 
 #. [event]: (description=Elynia) 21 21}, (description=Mal Keshar, (description=Galas) 22 19}, (description=Galas) 20 21}
 #: Invasion_from_the_Unknown/scenarios/cutscenes/23Bx.cfg:100
@@ -16524,8 +16632,8 @@
 &quot;You said something like that Uria did all this to you. Is she our real enemy &quot;
 &quot;then?&quot;
 msgstr &quot;&quot;
-&quot;Vous avez dit que Uria vous avait fait tout cela. C'est donc notre vrai &quot;
-&quot;ennemi&#160;?&quot;
+&quot;Vous avez dit que Uria vous avait fait tout cela. C'est donc notre vraie &quot;
+&quot;ennemie&#160;?&quot;
 
 #. [event]: (description=Elynia) 21 21}, (description=Mal Keshar, (description=Galas) 22 19}, (description=Galas) 20 21}
 #: Invasion_from_the_Unknown/scenarios/cutscenes/23Bx.cfg:105
@@ -17239,7 +17347,7 @@
 &quot;&#187;. Capables de voler, elles ont besoin d'espace pour man&#339;uvrer et donc ne &quot;
 &quot;peuvent pas &#234;tre utilis&#233;es dans les cavernes. Les ornithopt&#232;res sont &quot;
 &quot;difficiles &#224; piloter et ne sont pas adapt&#233;s au combat rapproch&#233;. &#192; la place, &quot;
-&quot;leurs pilotes lancent des oeufs &#233;tranges qu'ils appellent &#171; grenades &#187;, et &quot;
+&quot;leurs pilotes lancent des &#339;ufs &#233;tranges qu'ils appellent &#171; grenades &#187;, et &quot;
 &quot;qui explosent dans un bruit de tonnerre. Personne ne sait quel &#233;trange &quot;
 &quot;animal pond ces oeufs.&quot;
 
@@ -17605,7 +17713,7 @@
 #. [variation]: race=monster
 #: Invasion_from_the_Unknown/units/fairies/Lady_of_Light.cfg:400
 msgid &quot;It is as majestic as a falcon, yet not a falcon.&quot;
-msgstr &quot;On dirait un faucon, mais ce n'est en pas un.&quot;
+msgstr &quot;On dirait un faucon, mais ce n'en est pas un.&quot;
 
 #. [attack]: type=pierce
 #. [attack]: type=blade
@@ -18485,9 +18593,9 @@
 msgstr &quot;&quot;
 &quot;Dans ce monde de brutes, la force fait souvent office de loi et ces &quot;
 &quot;commandants sont assez costauds pour avoir pris une position de meneur. &quot;
-&quot;Dirigeant de petits groupes de combattants, les commandants savent rallier &quot;
-&quot;leurs troupes et ne montrent aucune piti&#233; pour leurs ennemis. Ils attaquent &quot;
-&quot;f&#233;rocement avec soit des &#233;p&#233;es, soit des arcs.&quot;
+&quot;Dirigeant de petits groupes de combattants, ils savent rallier leurs troupes &quot;
+&quot;et ne montrent aucune piti&#233; pour leurs ennemis. Ils attaquent f&#233;rocement &quot;
+&quot;avec des &#233;p&#233;es ou des arcs.&quot;
 
 #. [unit]: race=human
 #: Invasion_from_the_Unknown/units/humans/Loyalist_Crossbowman.cfg:5
@@ -18516,13 +18624,12 @@
 
 #. [unit]: race=human
 #: Invasion_from_the_Unknown/units/humans/Loyalist_Death_Guard.cfg:19
-#, fuzzy
 msgid &quot;&quot;
 &quot;The most experienced city guards become so strong and fiery that their &quot;
 &quot;enemies know them by the name of 'deathguards'.&quot;
 msgstr &quot;&quot;
-&quot;Les gardes municipaux les plus exp&#233;riment&#233;s deviennent si fort qu'ils sont &quot;
-&quot;fiers d'&#234;tre connus par leurs ennemis sous le nom d'escadrons de la mort.&quot;
+&quot;Les gardes municipaux les plus exp&#233;riment&#233;s deviennent si forts qu'ils sont &quot;
+&quot;fiers d'&#234;tre connus par leurs ennemis sous le nom d'&#171;&#160;escadrons de la mort&#160;&#187;.&quot;
 
 #. [unit]: race=human
 #: Invasion_from_the_Unknown/units/humans/Loyalist_High_Guard.cfg:5
@@ -18531,13 +18638,12 @@
 
 #. [unit]: race=human
 #: Invasion_from_the_Unknown/units/humans/Loyalist_High_Guard.cfg:20
-#, fuzzy
 msgid &quot;&quot;
 &quot;The most experienced deathguards become so strong and fiery that their &quot;
 &quot;enemies know them by the name of 'highguards'.&quot;
 msgstr &quot;&quot;
-&quot;Les escadrons de la mort les plus exp&#233;riment&#233;s deviennent si fort qu'ils &quot;
-&quot;sont fiers d'&#234;tre connus par leurs ennemis sous le nom de gardes ultimes.&quot;
+&quot;Les escadrons de la mort les plus exp&#233;riment&#233;s deviennent si forts qu'ils &quot;
+&quot;sont fiers d'&#234;tre connus par leurs ennemis sous le nom de &#171;&#160;gardes ultimes&#160;&#187;.&quot;
 
 #. [unit]: race=human
 #: Invasion_from_the_Unknown/units/humans/Loyalist_Man-at-Arms.cfg:5
@@ -18606,7 +18712,7 @@
 #: Invasion_from_the_Unknown/units/imps/Armageddon.cfg:42
 #: Invasion_from_the_Unknown/units/imps/Gutwrencher.cfg:44
 msgid &quot;slime spit&quot;
-msgstr &quot;&quot;
+msgstr &quot;crachat&quot;
 
 #. [unit]: race=imps
 #: Invasion_from_the_Unknown/units/imps/Blood.cfg:5
@@ -18683,7 +18789,7 @@
 #. [unit]: race=mechanical
 #: Invasion_from_the_Unknown/units/mechanical/Automaton.cfg:7
 msgid &quot;Automaton&quot;
-msgstr &quot;Auto-maton&quot;
+msgstr &quot;Automate&quot;
 
 #. [unit]: race=mechanical
 #: Invasion_from_the_Unknown/units/mechanical/Automaton.cfg:35
@@ -18734,7 +18840,7 @@
 #. [attack]: type=impact
 #: Invasion_from_the_Unknown/units/mechanical/Goliath.cfg:63
 msgid &quot;plasma bomb&quot;
-msgstr &quot;&quot;
+msgstr &quot;bombe plasma&quot;
 
 #. [unit]: race=mechanical
 #: Invasion_from_the_Unknown/units/mechanical/Iron_Golem.cfg:5
@@ -18758,7 +18864,7 @@
 #. [attack]: type=impact
 #: Invasion_from_the_Unknown/units/mechanical/Iron_Golem.cfg:51
 msgid &quot;torpedo&quot;
-msgstr &quot;&quot;
+msgstr &quot;torpille&quot;
 
 #. [unit]: race=mechanical
 #: Invasion_from_the_Unknown/units/mechanical/Sentry_Tower.cfg:5
@@ -18788,17 +18894,16 @@
 
 #. [unit]: race=mechanical
 #: Invasion_from_the_Unknown/units/mechanical/Worker_Droid.cfg:34
-#, fuzzy
 msgid &quot;&quot;
 &quot;These tiny metal gnomes are known as the 'worker droids' by the Chaos &quot;
 &quot;overlords. It is not known what nature drives their acts; in fact, nobody &quot;
 &quot;knows, aside from their creators, if they are living beings, undead, or &quot;
 &quot;animated rocks.&quot;
 msgstr &quot;&quot;
-&quot;Ces minuscules gnomes m&#233;talliques sont connus sous le nom de 'Dro&#239;de &quot;
-&quot;bosseur' par les dirigeants du chaos. On ne sait pas quelle nature dirige &quot;
-&quot;leurs actes, en fait, personne ne sait, hormis leurs cr&#233;ateurs, s'ils sont &quot;
-&quot;des vivants, des morts-vivants, ou des rochers anim&#233;s.&quot;
+&quot;Les dirigeants du chaos connaissent ces minuscules gnomes m&#233;talliques sous &quot;
+&quot;le nom de &#171;&#160;travailleurs dro&#239;des&#160;&#187;. On ne sait pas quelle nature inspire &quot;
+&quot;leurs actes. Except&#233;s leurs cr&#233;ateur, en fait personne ne sait s'ils sont &quot;
+&quot;vivants, morts-vivants, ou des rochers anim&#233;s.&quot;
 
 #. [attack]: type=impact
 #: Invasion_from_the_Unknown/units/mechanical/Worker_Droid.cfg:42
@@ -18878,7 +18983,7 @@
 &quot;to turn the living to stone. Needless to say, this makes them extremely &quot;
 &quot;dangerous.&quot;
 msgstr &quot;&quot;
-&quot;Parfois connue sous le nom de 'basilic', cette cr&#233;ature mythique est &quot;
+&quot;Parfois connue sous le nom de &#171;&#160;basilic&#160;&#187;, cette cr&#233;ature mythique est &quot;
 &quot;suppos&#233;e avoir le pouvoir de transformer la chair en pierre. Nul besoin de &quot;
 &quot;pr&#233;ciser que cela est tr&#232;s dangereux.&quot;
 
@@ -20054,7 +20159,7 @@
 #. [unit]: race=spirit
 #: Invasion_from_the_Unknown/units/spirits/Rock_Animated.cfg:5
 msgid &quot;Animated Rock&quot;
-msgstr &quot;Le pic du Pinacle&quot;
+msgstr &quot;Rocher anim&#233;&quot;
 
 #. [unit]: race=spirit
 #: Invasion_from_the_Unknown/units/spirits/Rock_Animated.cfg:19
@@ -20254,7 +20359,7 @@
 #. [unit]: race=undead
 #: Invasion_from_the_Unknown/units/undead/Shadow_Spawn.cfg:21
 msgid &quot;Blah blah... FIXME&quot;
-msgstr &quot;Blah blah... &#192; compl&#233;ter&quot;
+msgstr &quot;Bla bla... &#192; compl&#233;ter&quot;
 
 #. [unit]: race=undead
 #: Invasion_from_the_Unknown/units/undead/Skele_Death_Baron.cfg:5


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	
	<LI>Next message: <A HREF="001375.html">[Wescamp-i18n-commit] r2187 - in	branches/1.4/Extended_Era/Extended_Era: . eras	images/units/chaos races units/aragwaith units/chaos	units/dark_elves units/dwarves units/kalifa units/nagas	units/orcs units/outlaws units/sidhe units/steppe_orcs	units/sylvan_fairies units/trolls units/woses
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#1374">[ date ]</a>
              <a href="thread.html#1374">[ thread ]</a>
              <a href="subject.html#1374">[ subject ]</a>
              <a href="author.html#1374">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/wescamp-i18n-commit">More information about the Wescamp-i18n-commit
mailing list</a><br>
</body></html>
